<?php 
$lang['data_enclave_access_request']="طلب النفاذ الى مركز البيانات الوطني
";
$lang['data_enclave_description']="<p>أنشئ المركز الوطني للبيانات من قبل الأرشيف الوطني وذلك للسماح للعلماء الذين يستوفون شروطا معينة النفاذ الى البيانات الفردية وفق شروطا معينة وتحت رقابة صارمة. يسمح المركز النفاذ الى البيانات الجزئية في بيئة امنة ، وذلك دون المساس بسرية البيانات.<p>
<h2>المكان</h2>
<p>المركز الوطني للبيانات يوجد في[ضع اسم الموقع هنا] <p/>
<h2>عمليات المركز الوطني للبيانات <h2/> 

<p>كما يمكن للباحثين النفاذ إلى البيانات على مركز البيانات الوطني، حيث يتم تزويدهم بالبيانات ،
 بمعدات الحاسوب والبرمجيات و تحت إشراف الموظفين.<p/>";
$lang['data_enclave_application_form_link']="انقر هنا لتحميل النموذج للنفاذ إلى مركز البيانات الوطني
";


/* End of file data_enclave_lang.php */
/* Location: ./application/language/arabic/data_enclave_lang.php */