<?php 
$lang['show_help_tooltip']="إظهار / إخفاء كل المساعدة";
$lang['show_fields_tooltip']="إظهار كافة الحقول";
$lang['mandatory_recommended_tooltip']="إظهار الحقول الإلزامية والموصى بها فقط";
$lang['mandatory_only_tooltip']="إظهار الحقول الإلزامية فقط";
$lang['save_tooltip']="حفظ وصف الدراسة";
$lang['titl']="<p> أدخل العنوان الرسمي للمسح. يمكن أن يكون العنوان باللغة الإنجليزية أو بلغة المسح. قم بتضمين السنة (السنوات) المرجعية ، لكن لا تقم بتضمين اختصار المسح أو اسم الدولة كجزء من العنوان. اجعل الحرف الأول من كل كلمة كبيرًا (باستثناء حروف الجر أو حروف العطف الأخرى). للعناوين بالفرنسية والإنجليزية والبرتغالية وما إلى ذلك ، يجب توفير أحرف مشددة. مثال: “Enquête Démographique et de Santé 2008-2009”. </p> ";
$lang['altTitl']="<p> أدخل اختصار المسح (بما في ذلك الحرف الأول من اسم البلد إذا كان ذلك مناسبًا). يمكن تضمين السنة (السنوات) المرجعية للمسح. مثال: DHS 2008-09. </p> ";
$lang['serName']="<p> نوع الدراسة أو نوع المسح هو الفئة العامة التي تحدد المسح. حدد خيارًا واحدًا من القائمة المنسدلة. حدد &quot;أخرى&quot; إذا لم يتطابق أي من الخيارات مع المسح الخاص بك. </ p>";
$lang['serInfo']="<p> قد يتكرر المسح على فترات منتظمة (مثل مسح القوى العاملة السنوي) ، أو يكون جزءًا من برنامج مسح دولي (مثل MICS ، CWIQ ، DHS ، LSMS وغيرها). معلومات السلسلة هي وصف لهذه &quot;المجموعة&quot; من المسوح. سيتم هنا تقديم وصف موجز لخصائص المسح ، بما في ذلك وقت بدئه ، وعدد الجولات التي تم تنفيذها بالفعل ، ومن المسؤول. إذا كان المسح لا ينتمي إلى سلسلة ، فاترك هذا الحقل فارغًا. </ p>";
$lang['parTitl']="<p> سيتم ترك هذا الحقل فارغًا في معظم الحالات. في البلدان التي بها أكثر من لغة رسمية واحدة ، قد يتم توفير ترجمة للعنوان. </ p>";
$lang['IDNo']="<pre>
رقم معرّف مجموعة البيانات هو رقم فريد يُستخدم لتحديد مسح معين. حدد واستخدم مخططًا متسقًا لاستخدامه. يمكن إنشاء مثل هذا المعرف على النحو التالي: الدولة-المنتج-المسح-العام-الإصدار  حيث
- البلد هو اختصار البلد المكون من 3 أحرف ISO
- المنتج هو اختصار الوكالة المنتجة
- المسح هو اختصار المسح
- السنة هي السنة المرجعية (أو السنة التي بدأ فيها المسح)
- الإصدار هو رقم إصدار مجموعة البيانات الرقمية (انظر وصف الإصدار أدناه)
</pre>";
$lang['version']="<pre>
<p> يجب أن يحتوي وصف الإصدار على رقم إصدار متبوعًا بوصف الإصدار. أمثلة: </ p>
<p>
<ul>
<li> الإصدار 0.1: البيانات الأولية الأساسية التي تم الحصول عليها من إدخال البيانات (قبل التحرير). </ li>
<li> الإصدار 1.2: البيانات المعدلة ، الإصدار الثاني ، للاستخدام الداخلي فقط. </li>
<li> الإصدار 2.1: مجموعة بيانات معدلة ومجهولة للتوزيع العام. </li>
يجب أن يتبع الوصف المختصر للإصدار التعريف العددي. </li>
</ul>
</p>";
$lang['version_idate']="<p> هذا هو التاريخ بتنسيق ISO (yyyy-mm-dd) للإنتاج الفعلي والنهائي للبيانات. قم بتزويد الشهر والسنة على الأقل. </p>";
$lang['version_notes']="<p> يجب أن تقدم ملاحظات الإصدار تقريرًا موجزًا عن التغييرات التي تم إجراؤها من خلال عملية الإصدار. يجب أن تشير الملاحظة إلى كيفية اختلاف هذا الإصدار عن الإصدارات الأخرى لمجموعة البيانات نفسها. </ p>";
$lang['overview_abstract']="<p> يجب أن يقدم الملخص ملخصًا واضحًا لأغراض وأهداف ومحتوى المسح. </p>";
$lang['instructions_project_submit']="<p> بمجرد اقتناعك بأن المعلومات التي أدخلتها لدراستك صحيحة ، فأنت جاهز لإرسال مشروعك. الرجاء تحديد سياسة وصول مناسبة لتوزيع البيانات ، أو كتالوج يجب نشر البيانات فيه ، أو أي ملاحظات قد تكون لديك بشأن عمليات الحظر ، أو المعلومات الحساسة التي يجب إزالتها قبل التوزيع أو أي ملاحظات أو تعليمات خاصة أخرى تريدها لتقديمها إلى مكتبة البيانات الجزئية. </ p>";
$lang['instructions_project_contributor_review']="<p> بمجرد اقتناعك بأن المعلومات التي أدخلتها لدراستك صحيحة ، فأنت جاهز لإرسال مشروعك. الرجاء تحديد سياسة وصول مناسبة لتوزيع البيانات ، أو كتالوج يجب نشر البيانات فيه ، أو أي ملاحظات قد تكون لديك بشأن عمليات الحظر ، أو المعلومات الحساسة التي يجب إزالتها قبل التوزيع أو أي ملاحظات أو تعليمات خاصة أخرى تريدها لتقديمها إلى مكتبة البيانات الجزئية. </ p>";
$lang['instructions_datafiles_usage']="<p> حمّل جميع الملفات التي ترغب في مشاركتها. يتضمن ذلك ملفات البيانات (بأي تنسيق) والاستبيانات وأدوات المسح الأخرى ووصف المنهجية وملفات البرامج وأي تقارير. بمجرد تحميل الملفات ، يرجى استخدام رابط تحرير (الخط الأزرق) أدناه لتحديد نوع الملف أو المستند المناسب لهذا المورد. يجب توفير ملفات البيانات والاستبيان كحد أدنى. </ p>";
$lang['instructions_citations']="<p> إذا نشرت عملاً يستخدم مجموعة البيانات المودعة ، يمكنك إدخال معلومات الاقتباس الخاصة بها في هذا القسم. ستتم إضافة هذه المراجع إلى صفحة العرض الخاصة بدراستك بمجرد نشرها في كتالوجات مكتبة البيانات الجزئية. </ p>";
$lang['anlyUnit']="<p> الوحدة (الوحدات) الأساسية للتحليل أو الملاحظة التي تصفها الدراسة: الأفراد ، والأسر / الأسر ، والمجموعات ، والمرافق ، والمؤسسات / المنظمات ، والوحدات الإدارية ، والمواقع المادية ، وما إلى ذلك. </ p>
<p> أمثلة: </ p>
<p>
<ul>
<li> مسح مستويات المعيشة باستخدام استبيان على مستوى المجتمع سيشتمل على وحدات التحليل التالية: الأفراد والأسر والمجتمعات. </ li>
<li> يمكن أن يكون للمسح الاقتصادي الشركة والمؤسسة كوحدات تحليل. </ li> </ul>
</p>";
$lang['dataKind']="<p> هذا الحقل هو تصنيف واسع للبيانات ويرتبط بمربع منسدل يوفر مفردات مضبوطة. </p>";
$lang['keyword']="<p> تلخص الكلمات المفتاحية المحتوى أو موضوع المسح. كتصنيفات للموضوعات ، يتم استخدامها لتسهيل الإحالة والبحث في كتالوجات المسح. </p>";
$lang['scope_notes']="<p> النطاق عبارة عن وصف للموضوعات التي يغطيها المسح. يمكن اعتباره ملخصًا للوحدات التي تم تضمينها في الاستبيان. النطاق لا يتعامل مع التغطية الجغرافية. </p>
<p> مثال: </ p>
<p> يشمل نطاق المسح العنقودي متعدد المؤشرات: </ p>
<ul>
<li> المنزل: خصائص الأسرة ، وقائمة الأسرة ، والأطفال الأيتام والضعفاء ، والتعليم ، وعمالة الأطفال ، والمياه والصرف الصحي ، والاستخدام المنزلي للناموسيات المعالجة بمبيدات الحشرات ، ومعالجة الملح باليود ، مع وحدات اختيارية لتأديب الأطفال ، وإعاقة الأطفال ، ووفيات الأمهات ، و أمن الحيازة واستمرارية السكن. <li/>
<li> المرأة: خصائص المرأة ، وفيات الأطفال ، وذوفان الكزاز ، وصحة الأم والوليد ، والزواج ، وتعدد الزوجات ، وختان الإناث ، ومنع الحمل ، والمعرفة بفيروس نقص المناعة البشرية / الإيدز ، مع وحدات اختيارية للاحتياجات غير الملباة ، والعنف المنزلي ، والسلوك الجنسي. < / لي>
<li> الأطفال: خصائص الأطفال ، وتسجيل المواليد والتعلم المبكر ، وفيتامين أ ، والرضاعة الطبيعية ، والعناية بالمرض ، والملاريا ، والتحصين ، والقياسات البشرية ، مع وحدة اختيارية لنمو الطفل. <li/>
<ul/>";
$lang['topcClas']="<p> يسهل تصنيف الموضوع الرجوع إلى عمليات البحث في كتالوجات المسح الإلكتروني. </p> <p> نظرًا لأن مكتبة البيانات الجزئية لم تصوغ قائمة موضوعات قياسية ، إلا أنه قد يتم ترك هذا الحقل فارغًا < p/>";
$lang['nation']="<p> أدخل اسم البلد ، حتى في الحالات التي لا يغطي فيها المسح البلد بالكامل. في حقل &quot;الاختصار&quot; ، نوصي بإدخال رمز ISO المكون من 3 أحرف للبلد. إذا كانت مجموعة البيانات التي توثقها تغطي أكثر من بلد ، فأدخل الكل في صفوف منفصلة. <p/>";
$lang['geogCover']="<p> يهدف هذا الحقل إلى وصف التغطية الجغرافية للعينة. ستكون الإدخالات النموذجية &quot;تغطية وطنية&quot; ، &quot;حضرية (أو ريفية) فقط&quot; ، &quot;ولاية ...&quot; ، &quot;عاصمة&quot; ، إلخ. <p/>";
$lang['country_universe']="<p> نحن مهتمون هنا بعالم المسح(وليس عالم أقسام معينة من الاستبيانات أو المتغيرات) ، أي تحديد السكان المعنيين بالمسح. نادرًا ما يكون الكون هو كل سكان البلاد. على سبيل المثال ، لا تغطي عينات المسوحات المنزلية ، عادة المشردين والبدو والدبلوماسيين وأسر المجتمع. قد تغطي بعض المسوح السكان من فئة عمرية معينة فقط ، أو الذكور فقط (أو الإناث) ، وما إلى ذلك. <p/>";
$lang['AuthEnty']="<p> الباحث الرئيسي هو المؤسسة (أو في بعض الحالات الفرد (الأفراد)) الذي كان مسؤولاً عن تصميم وتنفيذ المسح (وليس التمويل أو المساعدة الفنية). </p>
<p> الترتيب الذي يتم سردها به تقديري. يمكن أن تكون أبجدية أو حسب أهمية المساهمة. </p>";
$lang['AuthEnty_iaffiliation']="التبعية
";
$lang['producers']="<p> الاختصار والتبعية والدور. إذا كان أي من الحقول غير قابل للتطبيق ، فيمكن تركها فارغة. يجب أن تكون الاختصارات هي الاختصار الرسمي للمنظمة. </p>
<p> يجب أن يكون الدور عبارة أو وصفًا قصيرًا وموجزًا للمساعدة المحددة التي تقدمها المنظمة لإنتاج البيانات. </p>
<p> أمثلة على الأدوار: </ p>
<ul>
<li> [المساعدة الفنية في] تصميم الاستبيان </ li>
<li> [المساعدة الفنية في] منهجية / اختيار العينات </ li>
<li> [المساعدة الفنية في] جمع البيانات </ li>
<li> [مساعدة فنية في] معالجة البيانات </ li>
<li> [المساعدة الفنية في] تحليل البيانات </ li>
<p> لا تضم الرعاة الماليين هنا. </ p>";
$lang['fundAg']="<p> ضع قائمة بالمنظمات (الوطنية أو الدولية) التي ساهمت ، نقدًا أو عينيًا ، في تمويل المسح. </p>";
$lang['othId_p']="<p> يمكن استخدام هذا الحقل الاختياري لتقدير أي أشخاص ومؤسسات أخرى ساهمت بشكل ما في المسح. </p>";
$lang['sampProc']="<p> ينطبق هذا الحقل فقط على المسوح بالعينة. المعلومات عن إجراءات أخذ العينات أمر بالغ الأهمية (على الرغم من أنها لا تنطبق على التعدادات ومجموعات البيانات الإدارية). يجب أن يتضمن هذا القسم معلومات موجزة تتضمن على الرغم من أنها لا تقتصر على: </ p>
<ul>
<li> حجم العينة </ li>
<li> عملية الاختيار (على سبيل المثال ، الاحتمالية المتناسبة مع الحجم أو العينات الزائدة) </ li>
<li> التقسيم الطبقي (ضمني وصريح) </li>
<li> مراحل اختيار العينة) </ li>
<li> إغفال التصميم في العينة) </ li>
<li> مستوى التمثيل) </ li>
<li> استراتيجية للمستجيبين الغائبين / غير موجود / رفض (استبدال أم لا)) </ li>
<li> نموذج الإطار المستخدم ، وتمرين القائمة الذي تم إجراؤه لتحديثه) </ li>
<p> من المفيد أيضًا الإشارة هنا إلى المتغيرات الموجودة في ملفات البيانات التي تحدد المستويات المختلفة للطبقات ووحدة العينة الأولية. هذه ضرورية لمستخدمي البيانات الذين يرغبون في حساب تصميم العينة بشكل صحيح في تحليلاتهم وحساباتهم لأخطاء أخذ العينات. </p>
<p> يقبل هذا القسم تنسيق النص فقط ؛ لا يمكن إدخال الصيغ. في معظم الحالات ، ستتوفر المستندات الفنية التي تصف استراتيجية أخذ العينات بالتفصيل. في مثل هذه الحالات ، قم بتضمين مرجع (العنوان / المؤلف / التاريخ) لهذا المستند ، وتأكد من تحميل المستند في ملفات البيانات وقسم الموارد الأخرى. </p>";
$lang['deviat']="<p> ينطبق هذا الحقل فقط على المسوح بالعينة. </ p>
<p> أحيانًا يتطلب واقع المجال انحرافًا عن تصميم العينة (على سبيل المثال بسبب صعوبة الوصول إلى المناطق بسبب مشاكل الطقس وعدم الاستقرار السياسي وما إلى ذلك). إذا انحرف تصميم العينة لأي سبب من الأسباب ، فيجب الإبلاغ عن ذلك هنا. </p>";
$lang['respRate']="<p> يوفر معدل الاستجابة تلك النسبة المئوية للأسر (أو وحدة عينة أخرى) التي شاركت في المسح بناءً على حجم العينة الأصلي. قد يحدث الإغفال بسبب رفض المشاركة ، أو استحالة تحديد مكان المدعى عليه ، أو غير ذلك. في بعض الأحيان ، قد يتم استبدال منزل بآخر بالتصميم. تحقق من أن المعلومات المقدمة هنا متوافقة مع حجم العينة المشار إليه في حقل &quot;إجراء أخذ العينات&quot; وعدد السجلات الموجودة في مجموعة البيانات (على سبيل المثال ، إذا ذكر تصميم العينة عينة من 5000 أسرة وكانت البيانات الموجودة بها تحتوي على بيانات عن 4500 أسرة ، يجب ألا يكون معدل الاستجابة 100 بالمائة). </ p>
<p> قدِّم ، إن أمكن ، معدلات الاستجابة حسب الطبقة. إذا كانت المعلومات متوفرة حول أسباب عدم الاستجابة (الرفض / لم يتم العثور على / غير ذلك) ، فقم بتوفير هذه المعلومات أيضًا. </ p>
<p> يمكن أيضًا استخدام هذا الحقل في بعض الحالات لوصف عدم الاستجابات في تعدادات السكان. </ p>";
$lang['weight']="ينطبق هذا الحقل فقط على عينات المسوحات أو عينات التعداد.
<p> قدم هنا قائمة المتغيرات المستخدمة كمعامل ترجيح. إذا كان هناك أكثر من متغير واحد هو متغير ترجيح/وزن ، فقم بوصف كيف تختلف هذه المتغيرات عن بعضها البعض والغرض من كل منها. </p>
<p> مثال: </ p>
<p> تم حساب أوزان العينات لكل ملف من ملفات البيانات. </ p>
</p> تم حساب أوزان العينات لبيانات الأسرة على أنها معكوس احتمال اختيار الأسرة ، محسوبة على مستوى مجال أخذ العينات (حضري / ريفي داخل كل منطقة). تم تعديل أوزان الأسرة لعدم الاستجابة على مستوى المجال ، ثم تم تطبيعها بعامل ثابت بحيث يساوي العدد الإجمالي المرجح للأسر إجمالي عدد الأسر غير المرجح. يُطلق على متغير وزن الأسرة اسم HHWEIGHT ويتم استخدامه مع بيانات HH وبيانات HL. </p>
<p> استخدمت أوزان العينات لبيانات النساء الأوزان المنزلية غير المعيارية ، وتعديلها لعدم الاستجابة لاستبيان النساء ، ثم تمت معايرتها بعامل ثابت بحيث يساوي العدد الإجمالي المرجح لحالات النساء إجمالي عدد غير مرجح من حالات نسائية. </ p>
<p> اتبعت أوزان العينات لبيانات الأطفال نفس نهج النساء واستخدمت أوزان الأسرة غير المعيارية ، مع تعديلها لعدم الاستجابة لاستبيان الأطفال ، ثم تم تطبيعها بعامل ثابت بحيث يكون إجمالي العدد المرجح حالات الأطفال تساوي إجمالي عدد غير مرجح لحالات الأطفال. </ p>";
$lang['collDate']="<p> أدخل التواريخ (الشهر والسنة على الأقل) لبداية جمع البيانات ونهايته. </p>
<p> في بعض الحالات ، يمكن إجراء جمع البيانات لنفس المسح على شكل موجات. في مثل هذه الحالة ، يجب عليك إدخال تاريخ البداية والنهاية لكل موجة على حدة ، وتحديد كل موجة في حقل &quot;الدورة&quot;. </p>";
$lang['timePrd']="<p> عادةً ما يُترك هذا الحقل فارغًا. تختلف الفترة الزمنية عن تواريخ الجمع لأنها تمثل الفترة التي تكون فيها البيانات التي تم جمعها قابلة للتطبيق أو ذات صلة. </p>";
$lang['collMode']="<p> أسلوب جمع البيانات هو الطريقة التي أجريت بها المقابلة أو تم جمع المعلومات بها. هذا المجال هو حقل مفردات مضبوطة. </p>
<p> استخدم زر القائمة المنسدلة لتحديد خيار واحد. في معظم الحالات ، سيكون الرد &quot;مقابلة وجهاً لوجه&quot;. ولكن بالنسبة لبعض أنواع مجموعات البيانات المحددة ، مثل البيانات المتعلقة بسقوط المطر على سبيل المثال ، ستكون الاستجابة مختلفة. </ p>";
$lang['collSitu']="<p> تم توفير هذا العنصر لتوثيق أي ملاحظات أو وقائع أو أحداث محددة أثناء جمع البيانات. ضع في اعتبارك ذكر عناصر مثل: </ p>
<ul>
<li> هل تم إجراء تدريب للعداد؟ (تفصيل) </li>
<li> أية أحداث يمكن أن يكون لها تأثير على جودة البيانات؟ </li>
<li> كم من الوقت استغرقت المقابلة في المتوسط؟ </li>
<li> هل كانت هناك عملية تفاوض بين الأسر والمجتمع والوكالة المنفذة؟ </li>
<li> هل يتم تسجيل الأحداث القصصية؟ </li>
<li> هل ساهمت الفرق الميدانية من خلال توفير معلومات حول المشكلات والأحداث أثناء جمع البيانات؟ </li>
<li> بأي لغة أجريت المقابلة؟ </li>
<li> هل تم إجراء مسح تجريبي؟ </li>
<li> هل اتخذت الإدارة أية إجراءات تصحيحية عند حدوث مشكلات في الميدان؟ </li>
</ul>
<p> مثال: <p>
<p> تم إجراء الاختبار التمهيدي للمسح في الفترة من 15 آب (أغسطس) 2006 إلى 25 آب (أغسطس) 2006 وشمل 14 من المحاورين الذين أصبحوا فيما بعد مشرفين على المسح الرئيسي. </ p>
<p> يتألف كل فريق من المقابلات من 3-4 من المقابلات (لم يتم استخدام محاورين ذكور بسبب حساسية الموضوع) ، جنبًا إلى جنب مع محرر ميداني ومشرف وسائق. تم استخدام ما مجموعه 52 من المحاورين و 14 مشرفًا و 14 محررًا ميدانيًا. تم جمع البيانات على مدى 6 أسابيع تقريبًا من 2 سبتمبر 2006 حتى 17 أكتوبر 2006. جرت المقابلة يوميًا طوال فترة العمل الميداني ، على الرغم من السماح لفرق المقابلات بأخذ يوم عطلة واحد في الأسبوع. </p>
<p> بلغ متوسط ​​المقابلات 35 دقيقة لاستبيان الأسرة (باستثناء اختبار الملح) ، و 23 دقيقة لاستبيان النساء ، و 27 دقيقة لاستبيان الأطفال دون سن الخامسة (باستثناء قياس الأنثروبومترية). أجريت المقابلات بشكل أساسي باللغتين الإنجليزية و Mumbo-jumbo ، ولكنها استخدمت أحيانًا الترجمة المحلية إلى الهولندية المزدوجة ، عندما لا يتحدث المستفتى الإنجليزية أو Mumbo-jumbo. </p>
<p> قدم ستة موظفين من GenCenStat تنسيق العمل الميداني الشامل والإشراف. كان المنسق الميداني العام السيدة دو. </ p>";
$lang['resInstru']="<p> يتم توفير هذا العنصر لوصف الاستبيان (الاستبيانات) المستخدمة في جمع البيانات. يجب ذكر ما يلي: </ p>
<ul>
<li> قائمة الاستبيانات ووصف موجز لكل منها (يجب تقديم جميع الاستبيانات كمصادر خارجية) </ li>
<li> بأي لغة تم نشر الاستبيانات؟ </li>
<li> معلومات عن عملية تصميم الاستبيان (بناءً على استبيان سابق ، بناءً على نموذج استبيان قياسي ، ومراجعة من قبل أصحاب المصلحة). إذا تم تجميع وثيقة تحتوي على التعليقات المقدمة من أصحاب المصلحة على مسودة الاستبيان ، أو تقرير معد عن اختبار الاستبيان ، فيجب تقديم إشارة إلى هذه الوثائق هنا ويجب تقديم الوثائق كمصادر خارجية. </li>
</ul>
<p> مثال: </ p>
<p> كانت الاستبيانات الخاصة بالمجموعات العنقودية متعددة المؤشرات (MICS) العامة عبارة عن استبيانات منظمة بناءً على نموذج استبيان MICS3 مع بعض التعديلات والإضافات. تم إجراء استبيان منزلي في كل أسرة ، والذي جمع معلومات عن أفراد الأسرة بما في ذلك الجنس والعمر والعلاقة وحالة اليتم. يتضمن الاستبيان المنزلي خصائص الأسرة ، ودعم الأطفال الأيتام والضعفاء ، والتعليم ، وعمالة الأطفال ، والمياه والصرف الصحي ، والاستخدام المنزلي للناموسيات المعالجة بمبيدات الحشرات ، ومعالجة الملح باليود ، مع وحدات اختيارية لتأديب الأطفال ، وإعاقة الأطفال ، ووفيات الأمهات ، وأمن الأطفال. حيازة ومتانة السكن. </ p>
<p> بالإضافة إلى استبيان الأسرة ، تم إجراء الاستبيانات في كل أسرة معيشية للنساء اللائي تتراوح أعمارهن بين 15 و 49 عامًا والأطفال دون سن الخامسة. بالنسبة للأطفال ، تم إرسال الاستبيان إلى الأم أو القائمين على رعاية الطفل. </p>
<p> يتضمن استبيان النساء خصائص المرأة ، ووفيات الأطفال ، وذوفان الكزاز ، وصحة الأم والوليد ، والزواج ، وتعدد الزوجات ، وبتر الأعضاء التناسلية للإناث ، ومنع الحمل ، ومعرفة فيروس نقص المناعة البشرية / الإيدز ، مع وحدات اختيارية للاحتياجات غير الملباة ، والعنف المنزلي ، والسلوك الجنسي . </p>
<p> يتضمن استبيان الأطفال خصائص الأطفال ، وتسجيل المواليد والتعلم المبكر ، وفيتامين أ ، والرضاعة الطبيعية ، والعناية بالمرض ، والملاريا ، والتحصين ، والقياس البشري ، مع وحدة اختيارية لنمو الطفل. </ p>
<p> تم تطوير الاستبيانات باللغة الإنجليزية من استبيانات نموذج MICS3 ، وتم ترجمتها إلى Mumbo-jumbo. بعد المراجعة الأولية ، تمت ترجمة الاستبيانات مرة أخرى إلى اللغة الإنجليزية بواسطة مترجم مستقل بدون معرفة مسبقة بالمسح. تمت مراجعة الترجمة الخلفية من إصدار Mumbo-jumbo بشكل مستقل ومقارنتها بالأصل الإنجليزي. تمت مراجعة الاختلافات في الترجمة وحلها بالتعاون مع المترجمين الأصليين. </ p>
<p> تم تجريب كل من استبيانات اللغة الإنجليزية و Mumbo-jumbo كجزء من الاختبار القبلي للمسح. </ p>
<p> يتم توفير جميع الاستبيانات والوحدات كمصادر خارجية. </ p>";
$lang['dataCollector']="<p> يتم توفير هذا العنصر لتسجيل المعلومات المتعلقة بالأشخاص و / أو الوكالات التي تولت مسؤولية جمع البيانات. يتضمن هذا العنصر 3 حقول: الاسم والاختصار والتبعية. في معظم الحالات ، نسجل هنا اسم الوكالة وليس اسم المحاورين. فقط في حالة الدراسات الاستقصائية الصغيرة جدًا ، مع وجود عدد محدود جدًا من المحاورين ، سيتم تضمين اسم الشخص أيضًا. يعد حقل الانتساب اختياريًا وليس مناسبًا في جميع الحالات. </ p>";
$lang['cleanOps']="<p> يجب أن يحتوي تحرير البيانات على معلومات حول كيفية معالجة البيانات أو التحكم فيها من حيث الاتساق والترابط. لا يتعلق هذا البند بمرحلة إدخال البيانات ولكن فقط بتحرير البيانات سواء أكان يدويًا أم آليًا. </p>
<ul>
<li> هل كان السطح الساخن أم أسلوب السطح البارد المستخدم لتعديل البيانات؟ </ li>
<li> هل تم إجراء التصحيحات تلقائيًا (حسب البرنامج) ، أو عن طريق التحكم المرئي للاستبيان؟ </li>
<li> ما هي البرامج المستخدمة؟ </li>
</ul>
<p> في حالة توفر المواد (مواصفات تحرير البيانات ، تقرير حول تحرير البيانات ، البرامج المستخدمة لتحرير البيانات) ، يجب إدراجها هنا وتحميلها في ملفات البيانات وقسم الموارد الأخرى. </p>
<p> مثال: </ p>
<p> تم تعديل البيانات في عدد من المراحل خلال المعالجة ، بما في ذلك: </ p>
<ol>
<li> التحرير والترميز المكتبي </ li>
<li> أثناء إدخال البيانات </ li>
<li> فحص الهيكل واكتماله </ li>
<li> التحرير الثانوي </ li>
<li> فحص هيكلي لملفات بيانات SPSS </li>
</ol>
<p> يمكن العثور على الوثائق التفصيلية لتحرير البيانات في مستند &quot;إرشادات معالجة البيانات&quot; المقدم كمورد خارجي. </ p>";
$lang['method_notes']="<p> استخدم هذا الحقل لتقديم أكبر قدر ممكن من المعلومات حول تصميم إدخال البيانات. يتضمن ذلك تفاصيل مثل: </ p>
<ul>
<li> طريقة إدخال البيانات (يدويًا أو عن طريق المسح ، في الميدان / في المناطق / في المقر الرئيسي) </ li>
<li> هندسة الكمبيوتر (أجهزة الكمبيوتر المحمولة في الميدان ، أجهزة الكمبيوتر المكتبية ، الماسحات الضوئية ، المساعد الرقمي الشخصي ، وغيرها ؛ حدد عدد أجهزة الكمبيوتر المستخدمة) </ li>
<li> البرامج المستخدمة </ li>
<li> استخدام (ومعدل) الإدخال المزدوج للبيانات </ li>
<li> متوسط ​​إنتاجية مشغلي إدخال البيانات ؛ عدد مشغلي إدخال البيانات المشاركين وجدول عملهم </li>
</ul>
<p> يمكن أيضًا توفير معلومات حول الجدولة والتحليل هنا. </p>
<p> يجب إدراج جميع المواد المتاحة (برامج إدخال / جدولة / تحليل ، وتقارير عن إدخال البيانات) هنا وتقديمها كموارد خارجية. </ p>
<p> مثال: </ p>
<p> تمت معالجة البيانات في مجموعات ، حيث تتم معالجة كل مجموعة كوحدة كاملة خلال كل مرحلة من مراحل معالجة البيانات. تمر كل مجموعة بالخطوات التالية: </ p>
<ol>
<li> استقبال الاستبيان </ li>
<li> التحرير والترميز المكتبي </ li>
<li> إدخال البيانات </ li>
<li> فحص الهيكل واكتماله </ li>
<li> إدخال التحقق </ li>
<li> مقارنة بيانات التحقق </ li>
<li> النسخ الاحتياطي للبيانات الأولية </ li>
<li> التحرير الثانوي </ li>
<li> النسخ الاحتياطي للبيانات المعدلة </ li>
<p> بعد معالجة جميع المجموعات ، يتم تجميع جميع البيانات معًا ثم يتم إكمال الخطوات التالية لجميع ملفات البيانات: </ p>
<li> تصدير إلى SPSS في 4 ملفات (hh- الأسرة ، hl - أفراد الأسرة ، wm - النساء ، ch- الأطفال دون سن 5) </ li>
<li> إعادة ترميز المتغيرات اللازمة للتحليل </ li>
<li> إضافة أوزان العينات </ li>
<li> حساب خماسي الثروة ودمجها في البيانات </ li>
<li> فحص هيكلي لملفات SPSS </li>
<li> جدولة جودة البيانات </ li>
<li> إنتاج جداول التحليل </ li>
</ol>
<p> يمكن العثور على تفاصيل كل خطوة من هذه الخطوات في وثائق معالجة البيانات وإرشادات تحرير البيانات وبرامج معالجة البيانات في CSPro و SPSS وإرشادات الجدولة. </ p>
<p> تم إدخال البيانات من قبل 12 عامل إدخال بيانات في نوبتين ، تحت إشراف 2 من مشرفين إدخال البيانات ، باستخدام ما مجموعه 7 أجهزة كمبيوتر (6 أجهزة كمبيوتر لإدخال البيانات بالإضافة إلى كمبيوتر واحد للمشرفين). تم إجراء جميع عمليات إدخال البيانات في المكتب الرئيسي لشركة GenCenStat باستخدام الإدخال اليدوي للبيانات. لإدخال البيانات ، تم استخدام الإصدار 2.6.007 من CSPro مع برنامج إدخال بيانات منظم للغاية ، باستخدام نهج يتحكم فيه النظام يتحكم في إدخال كل متغير. تم التحكم في جميع عمليات فحص النطاق والتخطي بواسطة البرنامج ولم يتمكن المشغلون من تجاوزها. كما تم تضمين مجموعة محدودة من فحوصات الاتساق في برنامج إدخال البيانات. بالإضافة إلى ذلك ، تم أيضًا تضمين حساب درجات Z للقياسات البشرية في برامج إدخال البيانات لاستخدامها أثناء التحليل. لم يتم إدخال الردود المفتوحة (إجابات &quot;أخرى&quot;) أو ترميزها ، إلا في حالات نادرة حيث تطابق الرد رمزًا موجودًا في الاستبيان. </p>
<p> يضمن التحقق من الهيكل والاكتمال إدخال جميع الاستبيانات الخاصة بالمجموعة ، وأنها سليمة من الناحية الهيكلية ، وأن استبيانات النساء والأطفال موجودة لكل امرأة وطفل مؤهل. </p>
<p> تم إجراء التحقق بنسبة 100٪ من جميع المتغيرات باستخدام التحقق المستقل ، أي الإدخال المزدوج للبيانات ، مع مقارنة منفصلة للبيانات متبوعة بتعديل إحدى مجموعتي البيانات أو كليهما لتصحيح أخطاء المفاتيح بواسطة المشغلين الأصليين الذين قاموا أولاً بإدخال الملفات. </p>
<p> بعد الانتهاء من جميع عمليات المعالجة في CSPro ، تم نسخ جميع ملفات المجموعات الفردية احتياطيًا قبل ربط البيانات معًا باستخدام الأداة المساعدة لسلسلة الملفات CSPro. </p>
<p> للجدولة والتحليل تم استخدام الإصدار 10.0 و 14.0 من SPSS. تم استخدام الإصدار 10.0 في الأصل لجميع برامج الجدولة ، باستثناء وفيات الأطفال. إصدار لاحق بعد نقل جميع الملفات إلى SPSS ، تم إعادة ترميز بعض المتغيرات لاستخدامها كخصائص أساسية في جدولة البيانات ، بما في ذلك تصنيف العمر والتعليم والمناطق الجغرافية حسب الحاجة للتحليل. في عملية إعادة ترميز الأعمار والتواريخ ، تم إجراء بعض التضمين العشوائي للتواريخ (ضمن قيود محسوبة) للتعامل مع الأعمار أو التواريخ المفقودة أو &quot;لا أعرف&quot;. بالإضافة إلى ذلك ، تم حساب مؤشر الثروة (الأصول) لأفراد الأسرة باستخدام تحليل المكونات الرئيسية ، استنادًا إلى أصول الأسرة ، وتم تضمين كل من النتيجة والخُمس في مجموعات البيانات لاستخدامها في عمليات الجدولة. </ p>";
$lang['EstSmpErr']="<p> بالنسبة للمسوح بالعينات ، من الممارسات الجيدة حساب ونشر أخطاء العينات. يستخدم هذا الحقل لتقديم معلومات حول هذه الحسابات. وهذا يشمل: </ p>
<ul>
<li> قائمة النسب / المؤشرات التي تم من أجلها حساب أخطاء أخذ العينات. </li>
<li> التفاصيل المتعلقة بالبرنامج المستخدم لحساب خطأ أخذ العينات ، والإشارة إلى البرامج المستخدمة (يتم توفيرها كموارد خارجية) كبرنامج مستخدم لإجراء العمليات الحسابية. </ li>
<li> إشارة إلى التقارير أو أي مستند آخر حيث يمكن العثور على النتائج (يتم توفيرها كموارد خارجية). </li>
</ul>
<p> مثال: </ p>
<p> تتأثر التقديرات المأخوذة من استطلاع عينة بنوعين من الأخطاء: 1) أخطاء غير متعلقة بأخذ العينات و 2) أخطاء أخذ العينات. الأخطاء غير المتعلقة بأخذ العينات هي نتائج الأخطاء التي ارتكبت في تنفيذ جمع البيانات ومعالجتها. بُذلت جهود عديدة أثناء تنفيذ المسح العنقودي متعدد المؤشرات للفترة 2005-2006 لتقليل هذا النوع من الخطأ ، ومع ذلك ، من المستحيل تجنب الأخطاء غير المتعلقة بأخذ العينات ويصعب تقييمها إحصائيًا. </ p>
<p> إذا كانت عينة المستجيبين عينة عشوائية بسيطة ، لكان من الممكن استخدام الصيغ المباشرة لحساب أخطاء أخذ العينات. ومع ذلك ، فإن عينة 2005-2006 MICS هي نتيجة لتصميم طبقي متعدد المراحل ، وبالتالي تحتاج إلى استخدام صيغ أكثر تعقيدًا. تم استخدام وحدة العينات المعقدة SPSS لحساب أخطاء أخذ العينات للمسح العنقودي متعدد المؤشرات 2005-2006. تستخدم هذه الوحدة طريقة تايلور الخطية لتقدير التباين لتقديرات المسح التي تكون من الوسائل أو النسب. تم توثيق هذه الطريقة في ملف SPSS CSDescriptives.pdf الموجود ضمن خيارات التعليمات والخوارزميات في SPSS. </p>
</p> تم حساب أخطاء أخذ العينات لمجموعة مختارة من الإحصائيات (وكلها نسب بسبب قيود طريقة تايلور الخطية) للعينة الوطنية ، والمناطق الحضرية والريفية ، ولكل من المناطق الخمس. لكل إحصائية ، التقدير ، وخطأه المعياري ، ومعامل الاختلاف (أو الخطأ النسبي - النسبة بين الخطأ القياسي والتقدير) ، وتأثير التصميم ، وتأثير تصميم الجذر التربيعي (DEFT - النسبة بين خطأ معياري باستخدام تصميم العينة المحدد والخطأ القياسي الذي سينتج إذا تم استخدام عينة عشوائية بسيطة) ، بالإضافة إلى فواصل الثقة 95 بالمائة (+/- 2 خطأ قياسي). </ p>
<p> يتم تقديم تفاصيل أخطاء أخذ العينات في ملحق أخطاء العينات بالتقرير وفي جدول أخطاء أخذ العينات المقدم في الموارد الخارجية. </ p>";
$lang['dataAppr']="<p> يمكن استخدام هذا القسم للإبلاغ عن أي إجراء آخر تم اتخاذه لتقييم موثوقية البيانات ، أو أي ملاحظات تتعلق بجودة البيانات. يمكن أن يشمل هذا العنصر: </ p>
<ul>
<li> بالنسبة للتعداد السكاني ، معلومات عن مسح التعداد اللاحق (يجب تقديم تقرير \ تحميله في ملفات البيانات وقسم الموارد الأخرى والمذكورة هنا). </li>
<li> لأي مسح / تعداد ، مقارنة مع بيانات من مصدر آخر. </ li>
<li> إلخ. </ li>
<p> مثال: </ p>
<p> تتوفر سلسلة من جداول جودة البيانات والرسوم البيانية لمراجعة جودة البيانات وتشمل ما يلي: </ p>
<ul>
<li> التوزيع العمري لسكان الأسرة </ li>
<li> التوزيع العمري للنساء المؤهلات والنساء المقابلات </ li>
<li> التوزيع العمري للأطفال المؤهلين والأطفال الذين تمت مقابلة الأم أو القائم بالرعاية من أجلهم </ li>
<li> التوزيع العمري للأطفال دون سن 5 في مجموعات 3 أشهر </ li>
<li> نسب العمر والفترة في حدود الأهلية </ li>
<li> النسبة المئوية للملاحظات مع المعلومات الناقصة عن المتغيرات المحددة </ li>
<li> وجود الأم في المنزل والشخص الذي تمت مقابلته في الاستبيان الأقل من 5 </li>
<li> الالتحاق بالمدرسة حسب سن السنة الواحدة </ li>
<li> نسبة الجنس عند الولادة بين الأطفال الذين ولدوا على قيد الحياة والذين ماتوا حسب عمر المستجيب</ li>
<li> توزيع النساء حسب الوقت منذ آخر ولادة </ li>
<li> مخطط مبعثر للوزن حسب الطول والوزن حسب العمر والطول حسب العمر </ li>
<li> رسم بياني للسكان الذكور والإناث حسب العمر الفردي </ li>
<li> الهرم السكاني </ li>
</ul>
<p> يتم عرض نتائج كل جدول من جداول جودة البيانات هذه في ملحق التقرير النهائي ويتم تقديمها أيضًا في قسم الموارد الخارجية. <p>
<p> تتمثل القاعدة العامة لعرض البيانات المفقودة في جداول التقرير النهائية في تقديم عمود للبيانات المفقودة إذا كانت النسبة المئوية للحالات التي تحتوي على بيانات مفقودة 1٪ أو أكثر. يتم تضمين الحالات التي تحتوي على بيانات مفقودة حول خصائص الخلفية (مثل التعليم) في الجداول ، ولكن يتم حذف صفوف البيانات المفقودة وتسجيلها في أسفل الجداول في التقرير (ولكن ليس في ناتج SPSS). </ p>";
$lang['useStmt_contact']="<p> يتكون هذا القسم من أقسام مختلفة: الاسم - التبعية- البريد الإلكتروني - URI. توفر هذه المعلومات جهة الاتصال أو الكيان للحصول على السلطة للوصول إلى البيانات. يُنصح باستخدام جهة اتصال بريد إلكتروني عامة مثل microdata@worldbank.org كلما أمكن ذلك لتجنب تقييد الوصول إلى فرد معين قد تتغير وظائفه بمرور الوقت. <p />";
$lang['confDec']="<p> إذا لم تكن مجموعة البيانات مجهولة المصدر ، فقد نشير هنا إلى ما يجب توقيع إفادة السرية قبل التمكن من الوصول إلى البيانات. خيار آخر هو تضمين هذه المعلومات في العنصر التالي (شروط الوصول). إذا لم تكن هناك مشكلة تتعلق بالسرية ، فيمكن ترك هذا الحقل فارغًا. </ p>";
$lang['conditions']="<p> يجب أن تحتوي كل مجموعة بيانات على &quot;سياسة وصول&quot; مرفقة بها. توصي مكتبة البيانات الجزئية بأحد المستويات التالية لإمكانية الوصول إلى البيانات: </ p>
<ul>
<li> ملفات الاستخدام العام ، في متناول الجميع. </ li>
<li> مجموعات البيانات المرخصة ، التي يمكن الوصول إليها بموجب الشروط والمراجعة التالية. </ li>
<li> البيانات المتاحة من مستودع خارجي </ li>
</ul>
<p> صاغ البنك الدولي سياسات معيارية عامة ونماذج وصول لكل نوع من أنواع الوصول هذه. </p> <p> يمكن الاطلاع على شروط استخدام البنك الدولي للبيانات في الكتالوج العام الخارجي <a href = http: //microdata.worldbank.org/index.php/terms-of-use ”target =&quot; _blank ”> هنا </a> ويمكن الاطلاع على شروط استخدام كتالوج الموظفين الداخلي <a href=”http://microdatalib.worldbank.org/index.php/terms“ target=”_blank&quot;> هنا. </a> </p>";
$lang['citReq']="<p> متطلبات الاقتباس هي الطريقة التي يجب الإشارة إليها بمجموعة البيانات عند الاقتباس في أي منشور. يجب أن يكون لكل مجموعة بيانات متطلب اقتباس. سيضمن ذلك حصول منتج البيانات على الائتمان المناسب ، ويمكن ربط النتائج التحليلية بالإصدار المناسب من مجموعة البيانات. يجب أن تذكر سياسة الوصول صراحة الالتزام بالامتثال لمتطلبات الاقتباس. يجب أن يتضمن الاقتباس الباحث الأساسي على الأقل ، واسم مجموعة البيانات واختصارها ، والسنة المرجعية ، ورقم الإصدار. قم أيضًا بتضمين موقع ويب حيث يتم توفير البيانات أو المعلومات الموجودة على البيانات من قبل مودع البيانات الرسمي. </ p>
<p> <small> سارة بيرد ، جامعة جورج واشنطن ، كريج ماكنتوش ، جامعة كاليفورنيا سان دييغو ، بيرك أوزلر ، البنك الدولي. صندوق العمل الاجتماعي الثاني في تنزانيا (TASAF II) - تقييم تأثير المجموعات الضعيفة - الجولة الأولى ، مسح الأسرة لعام 2008 ، المرجع. TZA_2008_TASAF-II_v01_M_v01_A_PUF. تم تنزيل مجموعة البيانات من [URL] في [التاريخ] </small> </p>.";
$lang['disclaimer']="<p> مثال: يقر مستخدم البيانات أن جامع البيانات الأصلي والموزع المعتمد للبيانات ووكالة التمويل ذات الصلة لا يتحملون أي مسؤولية عن استخدام البيانات أو التفسيرات أو الاستنتاجات القائمة على هذه الاستخدامات. </p>";
$lang['copyright']="<p> ضمِّن هنا بيان حقوق الطبع والنشر في مجموعة البيانات ، مثل: </ p>
<p> (C) 2007 ، البنك الدولي </ p>";
$lang['impact_wb_name_help']="<p> اسم رمز تقييم الأثر المقابل للبنك الدولي أو ، إذا لم يكن لتقييم الأثر رمز البنك الدولي المنفصل ، فعندئذٍ يُعرف العنوان / الاسم الذي بموجبه يُعرف تقييم التأثير هذا </ p>";
$lang['impact_wb_id_help']="<p> رمز تقييم تأثير البنك الدولي المقابل (على سبيل المثال ، P012345). اكتب &quot;N / A&quot; إذا لم يكن لتقييم الأثر هذا رمز WB منفصل) </ p>";
$lang['impact_wb_lead_help']="<p> WB TTL و / أو المستشار (المستشارون) / الباحث (الباحثون) الرئيسيون </ p>";
$lang['impact_wb_members_help']="<p> موظفو البنك الدولي أو باحثون / مستشارون آخرون عملوا على تقييم الأثر هذا </ p>";
$lang['impact_wb_description_help']="<p> اسم رمز تقييم الأثر المقابل للبنك الدولي أو ، إذا لم يكن لتقييم الأثر رمز البنك الدولي المنفصل ، فعندئذٍ يُعرف العنوان / الاسم الذي يُعرف به تقييم التأثير هذا. </ p>";
$lang['operational_wb_name_help']="<p> اسم عملية البنك الدولي التي يرتبط بها تقييم الأثر هذا < p/>";
$lang['operational_wb_id_help']="<p> رمز المشروع (على سبيل المثال ، P012345) للعملية ذات الصلة </ p>";
$lang['operational_wb_summary_help']="<p> قدم ملخصًا / نظرة عامة عن العملية وأهداف تطوير المشروع </ p>";
$lang['distStmt_contact']="<p> قد يحتاج مستخدمو البيانات إلى مزيد من التوضيح والمعلومات. قد يتضمن هذا القسم الاسم - التبعية - البريد الإلكتروني - URI لشخص واحد أو أكثر من جهات الاتصال. تجنب وضع أسماء الأفراد. يجب أن تكون المعلومات المقدمة هنا صالحة على المدى الطويل. لذلك من الأفضل تحديد الأشخاص الذين يمكن الاتصال بهم من خلال اللقب. الأمر نفسه ينطبق على مجال البريد الإلكتروني. من الناحية المثالية ، يجب توفير عنوان بريد إلكتروني &quot;عام&quot;. من السهل تهيئة خادم بريد بحيث تتم إعادة توجيه جميع الرسائل المرسلة إلى عنوان البريد الإلكتروني العام تلقائيًا إلى بعض أعضاء فريق العمل. </ p>";
$lang['catalog_to_publish_help']="<p> اختر خارجيًا إذا كنت تنوي مشاركة بياناتك مع الجمهور. اختر داخلي إذا كنت تنوي المشاركة مع موظفي البنك فقط. يتم أيضًا تضمين الدراسات حول الكتالوج الخارجي تلقائيًا في الكتالوج الداخلي </ p>";
$lang['is_embargoed_help']="<p> إذا لم يتم إصدار هذه الدراسة لموظفي البنك أو للجمهور لفترة من الوقت ، أي وجود حظر على الاصدار والإطلاق، فحدد هذا المربع. يرجى الإشارة في المربع أدناه إلى الفترة الزمنية وشروط الحظر </ p>";
$lang['disclosure_risk_help']="<p> من المهم حماية هوية وخصوصية المستجيبين الذين قدموا البيانات. إذا كانت ملفات البيانات التي تودعها تحتوي على أي متغيرات تعريفية (على سبيل المثال ، الأسماء وأرقام الهوية الرسمية وإحداثيات نظم المعلومات الجغرافية الدقيقة وما إلى ذلك) أو أي متغيرات تعتبر حساسة بخلاف ذلك في إعداد الدراسة (على سبيل المثال ، العرق ، القبيلة ، الدين ، إلخ) يرجى إدراجها أدناه حتى يمكن منع الوصول إليها. </ p>";
$lang['notes_to_library_help']="أدخل أي ملاحظات أو تعليمات إضافية هنا.";
$lang['notes_to_embargoed_help']="<p> تشير إلى شروط الحظر ، على سبيل المثال الفترة الزمنية وأية تعليمات خاصة أخرى. </ p>";
$lang['cc_help']="<p> أدخل عناوين البريد الإلكتروني للأشخاص الإضافيين الذين ترغب في تلقيهم نسخة موجزة من رسالتك. </ p>";
$lang['suggested_access_policy_help']="<p> حدد سياسة الوصول المناسبة لبياناتك. لمزيد من التفاصيل انظر: شروط الاستخدام التالية للفهرس الداخلي <a href=&quot;http://microdatalib.worldbank.org/index.php/terms&quot;> http://microdatalib.worldbank.org/index.php/ الشروط </a> وللحصول على الكتالوج الخارجي راجع شروط الاستخدام التالية <a href=&quot;http://microdata.worldbank.org/index.php/terms-of-use&quot;> http: //microdata.worldbank. org / index.php / شروط الاستخدام </a> </p>";
$lang['study_help']="الرجاء إكمال الحقول في كل قسم من الأقسام أدناه. سيؤدي توفير المعلومات التفصيلية هنا إلى تسريع عملية نشر الدراسة. كما أنه يسهل على مستخدمي البيانات العثور على المعلومات التي يحتاجون إليها وبالتالي يقلل من حاجة المستخدمين إلى الاتصال بمنتج البيانات للتوضيح. ثلاثة حقول فقط إلزامية لعملية التقديم. إذا كان الوقت أو المعلومات المتاحة لا تسمح بإكمال جميع الحقول ، فإننا نطلب على الأقل إكمال الحقول الإلزامية والموصى بها.";
$lang['create_title']="أدخل العنوان الكامل لمشروعك.";
$lang['create_short']="أدخل اختصارًا قصيرًا لمشروعك. (على سبيل المثال ، UZB HBS 1998)";
$lang['create_collab']="قم بتوفير عنوان البريد الإلكتروني لموظفي البنك الآخرين الذين قد يتم تفويضهم بتعديل هذا المشروع.";
$lang['create_desc']="قدم وصفا مفصلا لمشروعك.";
$lang['help_subtitle']="قدم عنوان فرعي قصيرة للمسح الخاص بك.";
$lang['section_identification']=" رقم تعريفي/محدد";
$lang['section_version']="إصدار";
$lang['no_files_uploaded']="لم يتم تحميل أي ملفات";
$lang['no_citations_attached']="لا اقتباسات";


/* End of file dd_help */
/* Location: ./application/language/arabic/dd_help */