<?php 
$lang['Line ministry/public administration']="الوزارة التنفيذية / الإدارة العامة";
$lang['University']="الجامعة";
$lang['Research centre']="مركز أبحاث
";
$lang['Private company']="شركة خاصة
";
$lang['International organization']="منظمة دولية
";
$lang['Non-governmental agency (national)']="منظمة غير حكومية (وطنية)
";
$lang['Non-governmental agency (international)']="منظمة غير حكومية (دولية)
";
$lang['Other']="أخرى
";
$lang['application_access_licensed_dataset']="طلب للنفاذ الى البيانات بموجب ترخيص
";
$lang['required_fields']="الحقول التي تحمل علامة * إلزامية.";
$lang['info_kept_confidential']="سيتم الحفاظ على سرية المعلومات الواردة في هذه الصفحة وسيتم استخدامها للأغراض الداخلية فقط.";
$lang['dataset_requested']="مجموعة البيانات المطلوبة:";
$lang['filled_lead_research']="<p> يجب ملء هذا النموذج وإرساله بواسطة الباحث الرئيسي. يشير الباحث الرئيسي إلى الشخص الذي يعمل كنقطة اتصال رئيسية لجميع الاتصالات التي تتضمن هذه الاتفاقية. لن يتم منح الوصول إلى مجموعات البيانات المرخصة إلا عندما يكون الباحث الرئيسي موظفًا في وكالة استقبال مسجلة قانونًا (جامعة ، شركة ، مركز أبحاث ، منظمة وطنية أو دولية ، إلخ) والتي يُطلب الوصول إلى البيانات نيابة عنها. يتحمل الباحث الرئيسي المسؤولية الكاملة عن الامتثال للكل
شروط اتفاقية الوصول إلى البيانات هذه من قبل موظفي المؤسسة المستقبلة. </ p>

<p> ستتم مراجعة هذا الطلب من قبل لجنة إصدار البيانات ، والتي قد تقرر الموافقة على الطلب ، أو رفض الوصول إلى البيانات ، أو طلب معلومات إضافية من الباحث الرئيسي. قد يتم أيضًا طلب نسخة موقعة من نموذج الطلب هذا. </p>

<p> يتم تقديم هذا الطلب نيابة عن: </ p>";
$lang['receiving_org']="اسم المؤسسة المستفيدة :
";
$lang['rec_org_refers']="تشير المنظمة المستفيدة أو المستقبلة للبيانات إلى المنظمة / الجامعة / المؤسسة التي توظف الباحث الرئيسي.";
$lang['org_type']="نوع المؤسسة
";
$lang['other']="اذا كان غير ذلك ، يرجى تحديد :
";
$lang['post_add']="العنوان البريدي
";
$lang['telephone']="رقم الهاتف (رمز البلد)
";
$lang['fax']="الفاكس (مع رمز البلد)
";
$lang['intended_use']="الهدف من وراء استخدام البيانات :
";
$lang['provide_short_desc']="يرجى تقديم وصف موجز لمشروعك البحثي (سؤال المشروع ، الأهداف ، الأساليب ، المخرجات المتوقعة ، الشركاء)";
$lang['expected_output']="قائمة بالمخرجات المتوقعة وسياسة النشر";
$lang['expected_completion']="تاريخ الانتهاء المتوقع (DD-MM-YYYY) من مشروع البحث:";
$lang['data_matching']="مطابقة/دمج  البيانات";
$lang['merge_dataset']="هل ستحتاج إلى دمج مجموعة البيانات مع بيانات أخرى؟";
$lang['other_data_merge']="إذا كانت الإجابة بنعم ، حدد جميع مجموعات البيانات الأخرى التي ستحتاج إلى دمجها";
$lang['research_team']="أعضاء فريق البحث (بخلاف الباحث الرئيسي)";
$lang['provide_names']="قدم أسماء وعناوين وانتماءات/تبعيات أي أعضاء آخرين في فريق البحث ممن يمكنهم الوصول إلى البيانات المقيدة.";
$lang['ident_needed']="تحديد ملفات البيانات والمتغيرات المطلوبة";
$lang['da_website']="يوفر أرشيف البيانات بيانات وصفية مفصلة على موقعه على الويب ، بما في ذلك وصف ملفات البيانات والمتغيرات لكل مجموعة بيانات. قد يشير الباحثون الذين لا يحتاجون إلى الوصول إلى مجموعة البيانات الكاملة إلى أي مجموعة فرعية من المتغيرات أو الحالات التي يهتمون بها. ونظرًا لأن هذا يقلل من مخاطر الكشف ، فإن تزويدنا بهذه المعلومات قد يزيد من احتمالية توفير البيانات.";
$lang['this_request']="هذا الطلب إذا تم تقديمه للوصول/للنفاذ:";
$lang['whole_dataset']="مجموعة البيانات الكاملة (كل الملفات ، كل الحالات)";
$lang['subset_data']="مجموعة فرعية من المتغيرات و / أو الحالات كما هو موضح أدناه (لاحظ أن المتغيرات مثل معاملات ترجيح/توزين العينة ومعرفات السجلات سيتم تضمينها دائمًا في مجموعات فرعية):";
$lang['data_access_agreement']="اتفاقية الوصول إلى البيانات";
$lang['i_read_and_agree']="لقد قرأت ووافقت على الشروط";
$lang['agreement_text']="<p> يوافق ممثل المؤسسة المستلمة على الامتثال للشروط التالية: </ p>
<ol>
<li> سيقتصر الوصول إلى البيانات المقيدة على الباحث الرئيسي والأعضاء الآخرين في فريق البحث المدرجين في هذا الطلب. </ li>
<li> لن يتم نسخ أي من البيانات المقيدة أو أي بيانات تم إنشاؤها على أساس البيانات الأصلية أو إتاحتها لأي شخص آخر غير تلك المذكورة في اتفاقية الوصول إلى البيانات هذه ، ما لم يتم الحصول على تصريح رسمي من أرشيف البيانات. </ li>
<li> ستتم معالجة البيانات للأغراض الإحصائية والبحثية المحددة فقط. سيتم استخدامها فقط للإبلاغ عن المعلومات المجمعة ، وليس للتحقيق مع أفراد أو منظمات معينة. لن يتم استخدام البيانات بأي شكل من الأشكال لأية أغراض إدارية أو خاصة بالملكية أو لإنفاذ القانون. </li>
<li> يجب على الباحث الرئيسي تحديد ما إذا كانت نيته مطابقة البيانات الجزئية المقيدة مع أي مجموعة بيانات مصغرة أخرى. في حالة حدوث أي مطابقة ، يجب تقديم تفاصيل مجموعات البيانات المطلوب مطابقتها وأسباب المطابقة. سيتم اعتبار أي مجموعات بيانات تم إنشاؤها نتيجة المطابقة مقيدة ويجب أن تمتثل لشروط اتفاقية الوصول إلى البيانات هذه. </ li>

<li> يتعهد الباحث الرئيسي بعدم القيام بأي محاولة لتحديد أي شخص أو عائلة أو شركة أو مؤسسة . إذا تم هذا الكشف الفريد عن غير قصد ، فلن يتم استخدام هوية أي شخص أو مؤسسة تم اكتشافها وسيتم إبلاغ التفاصيل الكاملة إلى أرشيف البيانات. لن يتم الكشف عن الهوية لأي شخص آخر غير مدرج في اتفاقية الوصول إلى البيانات. </ li>
<li> سينفذ الباحث الرئيسي إجراءات أمنية لمنع الوصول غير المصرح به إلى البيانات الجزئية المرخصة التي تم الحصول عليها من أرشيف البيانات. يجب إتلاف البيانات الجزئية عند الانتهاء من هذا البحث ، ما لم يحصل أرشيف البيانات على ضمان مُرضٍ بإمكانية تأمين البيانات ويوفر تفويضًا كتابيًا للمؤسسة المستقبلة للاحتفاظ بها. سيتم تأكيد إتلاف البيانات الجزئية كتابيًا بواسطة الباحث الرئيسي لأرشيف البيانات. </ li>
<li> أي كتب أو مقالات أو أوراق مؤتمرات أو أطروحات أو تقارير أو منشورات أخرى تستخدم البيانات التي تم الحصول عليها من أرشيف البيانات ستشير إلى مصدر البيانات وفقًا لمتطلبات الاقتباس المتوفرة مع مجموعة البيانات. </ li>
<li> سيتم إرسال نسخة إلكترونية من جميع التقارير والمنشورات بناءً على البيانات المطلوبة إلى أرشيف البيانات. </ li>
<li> لا يتحمل المُجمع الأصلي للبيانات وأرشيف البيانات ووكالات التمويل ذات الصلة أية مسؤولية عن استخدام البيانات أو التفسيرات أو الاستنتاجات المستندة إلى هذه الاستخدامات. </ li>
<li> ستدخل هذه الاتفاقية حيز التنفيذ في تاريخ منح الموافقة للوصول إلى مجموعة البيانات المقيدة وتظل سارية المفعول حتى تاريخ اكتمال المشروع أو تاريخ سابق إذا اكتمل المشروع في وقت مبكر. </ li>

<li> إذا كانت هناك أي تغييرات على مواصفات المشروع أو الترتيبات الأمنية أو الموظفين أو المنظمة المفصلة في نموذج الطلب هذا ، فمن مسؤولية الباحث الرئيسي السعي للحصول على موافقة أرشيف البيانات على هذه التغييرات. عندما يكون هناك تغيير في منظمة صاحب العمل للباحث الرئيسي ، فسيتضمن ذلك تقديم طلب جديد وإنهاء المشروع الأصلي. </ li>
<li> سيتم التعامل مع انتهاكات الاتفاقية على محمل الجد وسيتخذ أرشيف البيانات إجراءات ضد المسؤولين عن الانقضاء إذا كان متعمدًا أو عرضيًا. سيعتبر عدم الامتثال لتوجيهات أرشيف البيانات بمثابة انتهاك كبير للاتفاقية وقد ينطوي على اللجوء إلى الإجراءات القانونية. يحتفظ &quot;أرشيف البيانات&quot; بسجل لأرشيفات بيانات الشركاء ويتبادله مع هؤلاء الأفراد والمؤسسات المسؤولين عن انتهاك شروط &quot;اتفاقية الوصول إلى البيانات&quot; وسيفرض عقوبات على الإفراج عن البيانات المستقبلية إلى هذه الأطراف. </li>
</ol>";
$lang['success_request_submitted']="لقد قمت بإرسال طلب الوصول إلى البيانات بنجاح. تم إرسال بريد إلكتروني للتأكيد إلى عنوان بريدك الإلكتروني.";
$lang['track_status_request']="لتتبع حالة طلبك ، قم بزيارة";
$lang['thank_you']="شكرا!
";
$lang['confirmation_application_for_licensed_dataset']="[تأكيد] طلب الحصول على البيانات بموجب ترخيص
";
$lang['view_all_requests']="عرض جميع الطلبات
";
$lang['open_in_new_window']="افتح في نافذة جديدة";


/* End of file licensed_access_form */
/* Location: ./application/language/arabic/licensed_access_form */