<?php 
$lang['open_terms_and_conditions']="الأحكام والشروط";
$lang['open_terms_of_use']="<ul>
<li> لك مطلق الحرية في نسخ البيانات أو توزيعها أو تكييفها أو عرضها أو تضمينها في منتجات أخرى لأغراض تجارية وغير تجارية دون أي تكلفة وفقًا لقيود معينة ملخصة أدناه.
<li> يجب عليك تضمين الإسناد للبيانات التي تستخدمها بالطريقة الموضحة في البيانات الوصفية المضمنة في البيانات.
<li> يجب ألا تدعي أو تشير ضمنًا إلى أن البنك الدولي يؤيد استخدامك للبيانات بواسطة أو استخدام شعار (شعارات) البنك الدولي أو علامته التجارية (علاماته التجارية) بالاقتران مع هذا الاستخدام.
<li> قد يكون لأطراف أخرى مصالح ملكية في بعض المواد الواردة في موقع البنك الدولي على الويب. على سبيل المثال،
نحتفظ بقائمة ببعض البيانات المحددة ضمن مجموعات البيانات التي لا يجوز لك إعادة توزيعها أو إعادة استخدامها دون الاتصال أولاً بموفر المحتوى الأصلي ، بالإضافة إلى المعلومات المتعلقة بكيفية الاتصال بموفر المحتوى الأصلي. قبل دمج أي بيانات في منتجات أخرى ، يرجى مراجعة القائمة: <a target=&quot;_blank&quot; href=&quot;http://www.worldbank.org/terms-datasets-restricted&quot;> شروط الاستخدام: البيانات المقيدة </a>
<li> لا يقدم البنك الدولي أي ضمانات فيما يتعلق بالبيانات وأنت توافق على أن البنك الدولي لن يكون مسؤولاً تجاهك فيما يتعلق باستخدامك للبيانات.
</ul>
<p> هذا مجرد ملخص لشروط استخدام مجموعات البيانات المدرجة في كتالوج بيانات البنك الدولي. يرجى قراءة الاتفاقية الفعلية التي تتحكم في استخدامك لمجموعات البيانات ،
المتاح هنا: <a target=&quot;_blank&quot; href=&quot;http://www.worldbank.org/terms-datasets&quot;> شروط استخدام مجموعات البيانات </a>. انظر أيضا
<a target=&quot;_blank&quot; href=&quot;http://www.worldbank.org/terms&quot;> أحكام وشروط البنك الدولي </a>. </p>";


/* End of file open_data */
/* Location: ./application/language/arabic/open_data */