<?php 
$lang['application_for_access_to_public_use_dataset']="طلب النفاذ الى ملف للإستخدام عام
";
$lang['fields_marked_mandatory']="الحقول التي تحتوي على * فهي إلزامية";
$lang['msg_information_confidential']="إن المعلومات الوجودة على هذه الصفحة سرية ولا يجب ان تستخدم إلا لأغراض داخلية";
$lang['first_name']="اسم
";
$lang['last_name']="لقب
";
$lang['organization']="المنظمة";
$lang['email']="البريد الإلكتروني
";
$lang['dataset_requested']=" الملف المطلوب
";
$lang['intended_use_of_data']=" الهدف من استخدام البيانات
";
$lang['describe_your_project']="يرجى تقديم وصفا موجزا لمشروع البحث (الموضوع الأهداف ، المشروع ، الأساليب، الشركاء والمخرجات)
";
$lang['i_agree']="أوافق
";
$lang['terms_and_conditions']="الشروط";
$lang['terms_text']="<ol>
<li>لا يحق إعادة توزيع أو بيع البيانات لأفراد اومؤسسات ، أو المنظمات من غير المرخص لهم دون موافقة خطية من أرشيف البيانات الوطنية.<li/>
 
<li>وستستخدم هذه البيانات لأغراض البحوث الإحصائية والعلمية فقط. وسيتم استخدامهالإبلاغ المعلومات المجمعة ، وليس من أجل التحقيق في أفراد معينين أو منظمات.<li/>
<li>فعلي الباحث الرئيسي تنفيذ تدابير أمنية لمنع نفاذ اشخاص غير مصرح لهم إلى البيانات الجزئية. لا بد من فسخ البيانات الجزئية عند الانتهاء من هذا البحث ، ما لم يوقع إذن كتابي للاحتفاظ بهم مصحوب بضمان أن البيانات محفوضة بطريقة جيدة<li/>
<li> يجب ان يعلن الباحث الرئيسي إذا كان يقصد مطابقة البيانات الجزئية المحدودة مع أي مجموعة بيانات أخرى. ويجب تقديم تفاصيل عن مجموعات البيانات وأسباب المطابقة. كما تخضع البيانات التي انشأت  لقيود، ويجب أن تمتثل لشروط الاتفاق حول البيانات الاصلية. <li/> 
<li>أي كتب اومقالات اوأوراق مؤتمرات وأطروحات اورسائل وتقارير ، أو غيرها من المنشورات التي تستخدم البيانات التي تم الحصول عليها من أرشيف البيانات سوف تستشهد بمصدر البيانات وفقا للمتطلبات الاقتباس المنصوص عليها.<li/>
<li>ثمة يجب البعث بنسخة إلكترونية من جميع التقارير اوالمنشورات التي استعملت البيانات إلى أرشيف البيانات.<li/>
<li>الجامع الأصلي للبيانات ، اوأرشيف البيانات  ، اووكالات التمويل ذات الصلة لا تتحمل أية مسؤولية عن استخدام البيانات أو للتفسيرات أو الاستنتاجات المستخلصة من طرف المستخدم. <li/>
<ol>

<p>من خلال استمراركم بعد هذه النقطة في عملية النفاذ الى البيانات، تتعهدون بالامتثال للشروط المذكورة أعلاه و تتعهدون باستخدام البيانات الإحصائية التي تم الحصول عليها وفقا للمعايير القانونية التي تهدف إلى حماية سرية الأفراد.<p/>

";
$lang['public_use_files']=" ملفات للإستخدام عام
";


/* End of file public_access_terms_lang.php */
/* Location: ./application/language/arabic/public_access_terms_lang.php */