<?php 
$lang['login_to_access_data']="تسجيل الدخول للوصول إلى البيانات";
$lang['login_to_access_data_text']="للوصول إلى البيانات الخاصة بهذه الدراسة ، يجب أن يقوم المستخدم بتسجيل الدخول. انقر فوق الروابط أدناه لتسجيل الدخول أو التسجيل للحصول على حساب مجاني.";
$lang['application_for_access_to_dataset_research']="طلب الوصول إلى مجموعة بيانات البحث";
$lang['application_for_access_to_public_use_dataset']="طلب الوصول إلى مجموعة بيانات الاستخدام العام";
$lang['application_for_access_to_dataset_public']="طلب الوصول إلى مجموعة بيانات الاستخدام العام";
$lang['fields_marked_mandatory']="الحقول التي تحمل علامة * إلزامية.";
$lang['msg_information_confidential']="سيتم الحفاظ على سرية المعلومات الواردة في هذه الصفحة وسيتم استخدامها للأغراض الداخلية فقط.";
$lang['first_name']="الإسم الأول";
$lang['last_name']="إسم العائلة
";
$lang['organization']="المنظمة";
$lang['email']="البريد الإلكتروني
";
$lang['dataset_requested']="مجموعة البيانات المطلوبة";
$lang['intended_use_of_data']=" الهدف من استخدام البيانات
";
$lang['describe_your_project']="يرجى تقديم وصف موجز لمشروعك البحثي (سؤال المشروع ، الأهداف ، الأساليب ، المخرجات المتوقعة ، الشركاء)";
$lang['i_agree']="أوافق
";
$lang['terms_and_conditions']="الأحكام والشروط";
$lang['terms_text_public']="<ol>
<li> لن يتم إعادة توزيع البيانات والمواد الأخرى التي يوفرها أرشيف البيانات الوطني أو بيعها لأفراد أو مؤسسات أو منظمات أخرى دون موافقة كتابية من أرشيف البيانات الوطني. </li>
<li> سيتم استخدام البيانات لأغراض البحث الإحصائي والعلمي فقط. سيتم استخدامها فقط للإبلاغ عن المعلومات المجمعة ، وليس للتحقيق مع أفراد أو مؤسسات معينة. </ li>
<li> لن يتم إجراء أي محاولة لإعادة تعريف المستجيبين ، ولن يتم استخدام هوية أي شخص أو مؤسسة يتم اكتشافها عن غير قصد. سيتم الإبلاغ عن أي اكتشاف من هذا القبيل على الفور إلى أرشيف البيانات الوطني. </ li>
<li> لن يتم إجراء أي محاولة لإنتاج روابط بين مجموعات البيانات التي يوفرها أرشيف البيانات الوطني ، أو بين البيانات من أرشيف البيانات الوطني ومجموعات البيانات الأخرى التي يمكن أن تحدد الأفراد أو المنظمات. </ li>
<li> أي كتب أو مقالات أو أوراق مؤتمرات أو أطروحات أو تقارير أو منشورات أخرى تستخدم البيانات التي تم الحصول عليها من أرشيف البيانات الوطني ستشير إلى مصدر البيانات وفقًا لمتطلبات الاقتباس المقدمة مع كل مجموعة بيانات. </ li>
<li> سيتم إرسال نسخة إلكترونية من جميع التقارير والمنشورات بناءً على البيانات المطلوبة إلى أرشيف البيانات الوطني. </ li>
<li> لا يتحمل الجامع الأصلي للبيانات وأرشيف البيانات الوطني ووكالات التمويل ذات الصلة أية مسؤولية عن استخدام البيانات أو التفسيرات أو الاستنتاجات القائمة على هذه الاستخدامات. </ li>
</ol>
<p> من خلال الاستمرار في تجاوز هذه النقطة إلى عملية استرداد البيانات ، فإنك تشير إلى موافقتك على الامتثال للشروط والأحكام المذكورة أعلاه وتؤكد لك أن استخدام البيانات الإحصائية التي تم الحصول عليها من أرشيف البيانات الوطني سوف يتوافق مع الشروط المقبولة على نطاق واسع معايير الممارسة والقيود القانونية التي تهدف إلى حماية سرية المستجيبين. </ p>";
$lang['public_use_files']=" ملفات للإستخدام العام PUF
";
$lang['surveys_in_collection']="المجموعة [s%] تحتوي على المسوح التالية:";
$lang['collection_data_files']="ملفات الاستخدام العام حسب المجموعة";
$lang['collection_requested']="طلبات الوصول إلى المجموعة";
$lang['public_use_data_access_by_collection_message']="لقد تم منحك حق الوصول إلى جميع دراسات الاستخدام العام في المجموعة. يرجى زيارة كل صفحة دراسة لتنزيل ملفات البيانات والوثائق الأخرى.";
$lang['public_use_data_access_by_collection']="تنزيل ملفات البيانات";
$lang['terms_text_research']="<ol>
<li> لن يتم إعادة توزيع البيانات والمواد الأخرى التي يوفرها أرشيف البيانات الوطني أو بيعها لأفراد أو مؤسسات أو منظمات أخرى دون موافقة كتابية من أرشيف البيانات الوطني. </li>
<li> سيتم استخدام البيانات لأغراض البحث الإحصائي والعلمي فقط. سيتم استخدامها فقط للإبلاغ عن المعلومات المجمعة ، وليس للتحقيق مع أفراد أو مؤسسات معينة. </ li>
<li> لن يتم إجراء أي محاولة لإعادة تعريف المستجيبين ، ولن يتم استخدام هوية أي شخص أو مؤسسة يتم اكتشافها عن غير قصد. سيتم الإبلاغ عن أي اكتشاف من هذا القبيل على الفور إلى أرشيف البيانات الوطني. </ li>
<li> لن يتم إجراء أي محاولة لإنتاج روابط بين مجموعات البيانات التي يوفرها أرشيف البيانات الوطني ، أو بين البيانات من أرشيف البيانات الوطني ومجموعات البيانات الأخرى التي يمكن أن تحدد الأفراد أو المنظمات. </ li>
<li> أي كتب أو مقالات أو أوراق مؤتمرات أو أطروحات أو تقارير أو منشورات أخرى تستخدم البيانات التي تم الحصول عليها من أرشيف البيانات الوطني ستشير إلى مصدر البيانات وفقًا لمتطلبات الاقتباس المقدمة مع كل مجموعة بيانات. </ li>
<li> سيتم إرسال نسخة إلكترونية من جميع التقارير والمنشورات بناءً على البيانات المطلوبة إلى أرشيف البيانات الوطني. </ li>
<li> لا يتحمل الجامع الأصلي للبيانات وأرشيف البيانات الوطني ووكالات التمويل ذات الصلة أية مسؤولية عن استخدام البيانات أو التفسيرات أو الاستنتاجات القائمة على هذه الاستخدامات. </ li>
</ol>
<p> من خلال الاستمرار في تجاوز هذه النقطة إلى عملية استرداد البيانات ، فإنك تشير إلى موافقتك على الامتثال للشروط والأحكام المذكورة أعلاه وتؤكد لك أن استخدام البيانات الإحصائية التي تم الحصول عليها من أرشيف البيانات الوطني سوف يتوافق مع الشروط المقبولة على نطاق واسع معايير الممارسة والقيود القانونية التي تهدف إلى حماية سرية المستجيبين. </ p>";


/* End of file public_access_terms */
/* Location: ./application/language/arabic/public_access_terms */