<?php 
$lang['title_terms_and_conditions']="条款和条件";
$lang['terms_text']="<ol>
<li>由国家数据档案馆提供的数据和其他材料，未与国家数据档案馆达成书面协议，不得重新发布或出售给其他个人，机构或组织。</li>
<li>这些数据将仅仅用于统计和科研目的。它们将被纯粹用于汇报和汇总信息，而不是为了调查特定的个人或组织。</li>
<li>不试图重新识别受访者，不使用意外发现的任何人或机构的身份。任何这样的发现，将立即上报国家数据档案馆。</li>
<li>不试图通过建立国家数据档案馆提供的数据集之间的联系，或国家数据档案馆数据和其他数据集之间的联系，来够识别个人或组织。</li>
<li>任何采用了国家数据档案馆数据的书籍，文章，研讨会论文，毕业论文，博士论文，报告或其他出版物，将按照每个数据集提供的引用要求来引用数据资源。</li>
<li>一个基于所请求数据所有报告和出版物的电子副本将被发送到国家数据档案馆。</li>
<li>数据的原始收集者，国家数据档案馆，以及相关融资机构对数据的使用、解释或推断等用途不承担责任。</li>
</ol>
<p>继续越过数据检索过程中的这点，即表示您同意遵守上述条款及细则，并保证您所使用的从国家数据档案馆获得的统计数据，将符合广泛接纳的实践标准以及法律限制，目的是保护受访者的机密。</p>";
$lang['form_removed_and_not_available']="表格已被删除，不再存在。";
$lang['survey_data_files']="调查数据文件";


/* End of file direct_access_terms_lang.php */
/* Location: ./application/language/chinese/direct_access_terms_lang.php */