<?php 
$lang['Line ministry/public administration']="分支职能部门/公共管理";
$lang['University']="大学";
$lang['Research centre']="研究中心";
$lang['Private company']="私有企业";
$lang['International organization']="国际组织";
$lang['Non-governmental agency (national)']="非政府机构（全国性）";
$lang['Non-governmental agency (international)']="非政府机构（国际性）";
$lang['Other']="其他";
$lang['application_access_licensed_dataset']="申请访问许可数据集";
$lang['required_fields']="标有*号的字段是必填的。";
$lang['info_kept_confidential']="此页面上提供的信息将予以保密，并将仅供内部使用。";
$lang['dataset_requested']="请求数据集：";
$lang['filled_lead_research']="<p>此表格必须由首席研究员填写并提交。首席研究员是指作为本协议中所有沟通的主要联络点的个人。只有当首席研究员是合法注册的接收机构（大学，公司，研究中心，国家或国际组织等）的雇员，代表接收机构接收访问请求时，许可数据集的访问才会被授予。首席研究员为接收机构的员工遵守数据访问协议的所有条款承担全部责任。</p>

<p>这个请求由一个数据发布委员会审核，委员会可以决定批准该请求，拒绝数据访问请求，或要求首席研究员提供额外信息。 委员会亦可要求一份请求的签署文本。</p>
 
<p>此请求代表以下（人或机构）提交：</p> ";
$lang['receiving_org']="接收机构名称：";
$lang['rec_org_refers']="接收组织是指聘用了首席研究员的组织/大学/机构。";
$lang['org_type']="组织类型";
$lang['other']="如果是其他，请指定：";
$lang['post_add']="邮政地址";
$lang['telephone']="电话（含国家代码）";
$lang['fax']="传真（含国家代码）";
$lang['intended_use']="数据的拟定用途";
$lang['provide_short_desc']="请为您的研究项目提供一个简短的描述（项目问题，目标，方法，预期产出，合作伙伴）";
$lang['expected_output']="预期产出和传播政策列表";
$lang['expected_completion']="该研究项目的预计完工日期（DD-MM-YYYY）：";
$lang['data_matching']="数据匹配";
$lang['merge_dataset']="请问您需要将此数据集与其他数据合并吗？";
$lang['other_data_merge']="如果为“是”，请指明所有其他需要合并的数据集。";
$lang['research_team']="研究小组成员（除首席研究员）";
$lang['provide_names']="提供研究小组中，任何其他将有权访问受限制数据的成员的姓名，职称及从属关系。";
$lang['ident_needed']="识别所需的数据文件和变量";
$lang['da_website']="数据档案馆在其网站上提供详细的元数据，包括有关每个数据集的数据文件和变量的一个描述。不需要访问整个数据集的研究人员。可以表示哪个子集的变量或个案是他们感兴趣的。因为这样会降低泄密风险，向我们提供这样的信息可能增加数据会被提供的可能性。";
$lang['this_request']="如果提交此请求来访问：";
$lang['whole_dataset']="整个数据集（所有文件，所有个案）";
$lang['subset_data']="一个变量和/或个案的子集，如下文所述（请注意，变量例如样本加权系数和记录标识符等，将始终包含在子集中):";
$lang['data_access_agreement']="数据访问协议";
$lang['i_read_and_agree']="我已阅读并同意这些条件";
$lang['agreement_text']="<p>接受组织的代表同意遵守下列条件：</p>
<ol>
<li>只有首席研究员和在这个申请中列出的研究小组的其他成员可以访问受限制的数据。</li>
<li>受限制数据的副本，或基于原始数据创建的任何数据的副本，不会被复制或提供给除此数据访问协议中提及人员以外的任何人，除非有数据档案馆的正式授权。</li>
<li>数据处理将只用于规定的统计和研究目的。他们将纯粹被用于报告或汇总信息，而不是调查特定的个人或组织。数据将不会以任何方式被用于任何行政，私有或执法目的。</li>
<li>首席研究员必须声明他们是否有意图将受限制的微观数据和任何其他的微观数据集进行匹配。如果发生任何匹配，必须提供要匹配的数据集和匹配原因的详情。任何由匹配结果产生的数据集将被视为受到限制的，并且必须遵守这个数据访问协议的条款。</li>

<li>首席研究员承诺，不会尝试识别任何个人，家庭，业务，企业或组织。 如果特定信息在无意中被披露了，不使用任何被发现的个人或机构的身份，并把全部细节上报给数据档案馆。不向除此数据访问协议中提及人员以外的任何人透露识别信息。</li>
<li>首席研究员将实施安全措施，防止未经授权，访问从数据档案馆中获得许可微观数据。这项研究完成后，这些微观数据必须销毁，除非数据档案馆获得满意的保证，数据安全可以确保，并向保留数据的接收组织提供书面授权。销毁微观数据将由首席研究员书面向数据档案馆确认。</li>
<li>任何采用了数据档案馆数据的书籍，文章，研讨会论文，毕业论文，博士论文，报告或其他出版物，将按照数据集提供的引用要求来引用数据资源。</li>
<li>一个基于所请求数据的所有报告和出版物的电子副本将被发送到数据档案馆。</li>
<li>原来的数据收集者，数据档案馆，及相关融资机构对使用数据或基于使用数据所获得的解释或推论不承担任何责任。</li>
<li>该协议将于批准访问受限制数据集之日起生效，并保持有效，直到项目完成之日或一个更早的日期，如果该项目提前完成。</li>

<li>如果此申请表中详述的项目说明，安全安排，人员或组织有任何变动，首席研究员要负责与数据档案馆为这些变化寻求协议。当首席研究员的雇佣组织发生变化，这将涉及到终止原项目，申请新项目。</li>
<li>违反该协议将会被严肃对待，数据档案馆将采取行动，打击那些对有关失误承担责任的个人或组织，无论失职行为是故意的或是意外的。不遵守数据档案馆的指示，将被视为对协议的重大违反，可能涉及诉诸法律程序。数据档案馆将与合作数据档案馆保存并分享一个名册，记录违反数据访问协议条款并为此承担责任的个人和组织，而且会对他们未来获得数据采取制裁。</li>
</ol> ";
$lang['success_request_submitted']="您已成功提交数据访问请求。确认邮件已发送到您的电子邮件地址。";
$lang['track_status_request']="以便能查询您的请求，请访问";
$lang['thank_you']="谢谢您！";
$lang['confirmation_application_for_licensed_dataset']="[确认]申请访问许可数据集";
$lang['view_all_requests']="查看所有的请求";
$lang['open_in_new_window']="在新窗口打开";


/* End of file licensed_access_form_lang.php */
/* Location: ./application/language/chinese/licensed_access_form_lang.php */