<?php 
$lang['title_terms_and_conditions']="شروط النفاذ";
$lang['terms_text']=" <ol> 
  <li>البيانات والمواد الأخرى الموجودة في  أرشيف البيانات الوطنية لن 
    يتم إعادة توزيعها أو بيعها لغيرهم من الأفراد والمؤسسات ، أو الكائنات 
    دون موافقة خطية من أرشيف البيانات الوطنية.<li/>
 
  <li>      سيتم استخدام هاته البيانات لاغراض البحوث الاحصائية و العلمية فقط. سيتم نشر البيانات التجميعية  فقط  <li/>
<li>لن يسمح بالمحاولة لاعادة تحديد هوية الافراد المجيبين. لن يسمح باستعمال بيانات الافراد او المؤسسات الذين تم اكتشافهم من دون قصد. اذا تم تحديد هوية فرد او مؤسسة من دون قصد يجب اعلام المركز والارشيف الوطني  فورا
. <li/> 
  
<li>لن يسمح بمحاولة ربط بين مجموعات بيانات التي يوفرها الارشيف الوطني ، او بين بيانات الارشيف و بيانات وطنية اخرى للتعرف على الافراد او المؤسسات 
</li>
  <li>يجب على أي كتب او مقالات او اطروحات او تقارير استعملت بيانات تم الحصول من طرف الارشيف الوطني ذكر المصدر. وذلك وفقا للمتطلبات المنصوص عليها في اقتباس كل البيانات  
<li/> 
  <li> يجب ارسال كل التقارير والمنشورات و النسخ الالكترونية  التي اعتمدت على بيانات الارشيف الى ارشيف البيانات الوطني  
 <li/> 

  <li> لا يتحمل أرشيف البيانات الوطني أية مسؤولية عن أي استنتاجات او تفسيرات في استخدام بياناته. 
<li/> 
<ol/> 
<p>
على مستخدم البيانات الامتثال للاتفاق وللشروط المذكورة اعلاه . مع تأكيده على ان يكون استخدام بيانات ارشيف البيانات الوطني لغرض احصائي و ذلك وفقا للمعايير القانونية الدولية التي تهدف الى حماية سرية الاجابات.
<p/>  
";
$lang['form_removed_and_not_available']="تم حذف النموذج ولم يعد متوفر";
$lang['survey_data_files']="ملفات البيانات";


/* End of file direct_access_terms_lang.php */
/* Location: ./application/language/arabic/direct_access_terms_lang.php */