<?php 
$lang['Line ministry/public administration']="وزارة/ ادارة عمومية";
$lang['University']="جامعة";
$lang['Research centre']="مركز بحوث
";
$lang['Private company']="شركة خاصة
";
$lang['International organization']="منظمة دولية
";
$lang['Non-governmental agency (national)']="منظمة غير حكومية (وطنية)
";
$lang['Non-governmental agency (international)']="المنظمة غير الحكومية (دولية)
";
$lang['Other']="أخرى
";
$lang['application_access_licensed_dataset']="طلب للنفاذ الى البيانات بموجب ترخيص
";
$lang['required_fields']="الحقوالتي تحتوي على * فهي إلزامية.
";
$lang['info_kept_confidential']=" المعلومات  المدخلة في هذا النموذج يجب ان تعتبر سرية ولا تستخدم إلا لأغراض داخلية";
$lang['dataset_requested']=" البيانات المطلوبة ";
$lang['filled_lead_research']="<p>يجب ملء هذا النموذج و تقديمه من طرف الباحث الرئيسي. الباحث الرئيسي هو الشخص الذي بمثابة نقطة الاتصال الرئيسية لجميع الاتصالات التي ينطوي عليها هذا الاتفاق. الحصول على الترخيص
 لن يتم الا في حالة ان الباحث الرسمي هو موظف في وكالة(جامعة، شركة، مركز البحوث ، منظمة وطنية أو دولية، إلخ) لها قانونيا حق الحصول على البيانات. الباحث الرئيسي يتحمل كامل المسؤولية عن الامتثال لجميع شروط هذا الاتفاق من قبل موظفي المنظمة المتلقية.<p/>


<p>سيتم النظر في هذا الطلب من قبل لجنة النفاذ الي البيانات، الذين يرجع لهم قرار الموافقة على الطلب ، لرفض الوصول إلى البيانات ، أو لطلب معلومات إضافية من الباحثين. ويمكن أيضا طلب نسخة موقعة من مطلب النفاذ.
 إذا تمت الموافقة عليه، سيتم تقديم البيانات والوثائق المتعلقة بها في CD-ROM/DVD أو من خلال خادم بروتوكول نقل الملفات.<p/>

<p>ويقدم هذا الطلب نيابة عن: <p/>
";
$lang['receiving_org']="اسم المؤسسة المستفيدة :
";
$lang['rec_org_refers']=" المؤسسة المستفيدة هي الجامعة ،المنظمة ،او الشركة التي يعمل بها الباحث الرئيسي.
";
$lang['org_type']="نوع المؤسسة
";
$lang['other']="اذا كان غير ذلك ، يرجى تحديد :
";
$lang['post_add']="العنوان البريدي
";
$lang['telephone']="رقم الهاتف (رمز البلد)
";
$lang['fax']="الفاكس (مع رمز البلد)
";
$lang['intended_use']="الهدف من وراء استخدام البيانات :
";
$lang['provide_short_desc']="يرجى تقديم وصفا موجزا لمشروع البحث (الموضوع ،الأهداف ،المنهجية ،النتائج المتوقعة ، والشركاء).
";
$lang['expected_output']="قائمة المنتجات (المطبوعات ، والكتب ، الخ) وسياست نشرهم
";
$lang['expected_completion']="الموعد المتوقع لاكتمال مشروع البحث :
";
$lang['data_matching']="دمج ملفات
";
$lang['merge_dataset']="هل تريد دمج هذه الملفات مع ملفات بيانات أخرى؟
";
$lang['other_data_merge']="إذا كان الجواب بنعم ، يرجى تحديد كافة الملفات الأخرى (حدد ماّتاهم ومضمونهم)
";
$lang['research_team']="أعضاء فريق البحث (بخلاف الباحث الرئيسي)
";
$lang['provide_names']="حدد اسم وعنوان وانتماء جميع أعضاء فريق البحث الآخرين الذين لهم حق النفاذ إلى لبيانات";
$lang['ident_needed']=" تحديد الملفات والمتغيرات المطلوبة";
$lang['da_website']=" هذا الموقع يقدم وصفا مفصلا لملفات البيانات والمتغيرات. الباحثون الذين ليس لديهم الحاجة الماسة لكافة الملفات / كافة المتغيرات يمكنهم تحديد مجموعة فرعية من المتغيرات. ونظرا لانخفاض نسبة إعادة تحديد المجيبين ، احتمال تلبية الطلب تكون اعلى";
$lang['this_request']="هذا الطلب يتعلق بالنفاذ :
";
$lang['whole_dataset']="على جميع بيانات الدراسة (جميع السجلات وجميع المتغيرات)
";
$lang['subset_data']="مجموعة فرعية من المتغيرات و / أو السجلات الموصوفة ادناه  (لاحظ ان المتغيرات مل متغير التوزين و متغير التعريف تكون دائما ضمن هاته المجموعة ) ";
$lang['data_access_agreement']="عقد النفاذ إلى البيانات";
$lang['i_read_and_agree']="لقد اطلعت على الشروط و قبلتها";
$lang['agreement_text']="<p>ممثل المنظمة المتلقية يوافق على الامتثال للشروط التالية : <p>
<ol> 
<li> يقتصر النفاذ إلى البيانات على الباحث الرئيسي و الباحثين من أعضاء فريق البحث المدرج في هذا الطلب..<li/>
 
<li>نسخ من هذه البيانات أو أي بيانات اخري تم إنشاؤها على أساس البيانات الأصلية لا يمكن  إتاحتها لأي اشخاص غير تلك المذكورة في هذا الاتفاق، ما لم يأذن رسميا من طرف أرشيف البيانات.<li/>

<li> يتم معالجة البيانات لغرض البحوث الإحصائية. ويتم استخدامهالمجرد الإبلاغ عن المعلومات المجمعة ، وليس من أجل التحقيق في أفراد معينين أو منظمات. لا يحق استعمال البيانات في أي حال من الأحوال لأغراض إداريةأو قانونية..<li/>
 
<li> يجب ان يعلن الباحث الرئيسي إذا كان يقصد مطابقة البيانات الجزئية المحدودة مع أي مجموعة بيانات أخرى. ويجب تقديم تفاصيل عن مجموعات البيانات وأسباب المطابقة. كما تخضع البيانات التي انشأت  لقيود، ويجب أن تمتثل لشروط الاتفاق حول البيانات الاصلية. .<li/>
 

<li>يجب ان يتعهد الباحث الرئيسي بعدم محاولة تحديد هوية أي فرد او اسرة اومؤسسة أو منظمة. إذا اكشاف عن غير قصد ، فسوف لن يقع استخدام لهوية أي شخص أو مؤسسة وسيتم الإبلاغ عن التفاصيل الكاملة للمكلف بالأرشيف. ولن يتم الكشف عن الهوية المكتشفة لأي شخص غير مدرج في اتفاق الوصول إلى البيانات. .<li/>

 
<li>فعلي الباحث الرئيسي تنفيذ تدابير أمنية لمنع نفاذ اشخاص غير مصرح لهم إلى البيانات الجزئية. لا بد من فسخ البيانات الجزئية عند الانتهاء من هذا البحث ، ما لم يوقع إذن كتابي للاحتفاظ بهم مصحوب بضمان أن البيانات محفوضة بطريقة جيدة.<li/>

 
<li>أي كتب اومقالات اوأوراق مؤتمرات وأطروحات اورسائل وتقارير ، أو غيرها من المنشورات التي تستخدم البيانات التي تم الحصول عليها من أرشيف البيانات سوف تستشهد بمصدر البيانات وفقا للمتطلبات الاقتباس المنصوص عليها.<li/>
 
<li>ثمة يجب البعث بنسخة إلكترونية من جميع التقارير اوالمنشورات التي استعملت البيانات إلى أرشيف البيانات.<li/>

<li>الجامع الأصلي للبيانات ، اوأرشيف البيانات  ، اووكالات التمويل ذات الصلة لا تتحمل أية مسؤولية عن استخدام البيانات أو للتفسيرات أو الاستنتاجات المستخلصة من طرف المستخدم.<li/>
 
<li>هذا الاتفاق سيدخل حيز التنفيذ في التاريخ الذي يتم إعطاء الموافقة على النفاذ إلى مجموعة البيانات وتبقى سارية المفعول حتى تاريخ انتهاء المشروع أو تاريخ سابق إذا تم انتهاء المشروع قبل الموعد المحدد.<li/>
 

<li>إذاطرء اي تغيير في مواصفات المشروع ، اوالترتيبات الأمنية فيجب ان يقدم الباحث الرئيسي تفصيلا في تغيير البحث مع طلب موافقة أرشيف البيانات لهذه التغيرات. عندما يكون هناك تغيير في منظومة العمل فإن هذا يستوجب توقيع مشروع جديد وإنهاء المشروع الأصلي.<li/>
 
<li>يجب اخذ انتهاكات الاتفاق على محمل الجد وأخذ إجراءات ضد المسؤولين عن هذاالانتهاك حتي ولو كان ذلك عن غير قصد. سيعتبر عدم الامتثال لتوجيهات أرشيف البيانات خرقا كبيرا للاتفاق ، وياًدي ذلك لإجراءات القانونية. وسوف يعطي أرشيف البيانات اسماء هؤلاء الأفراد اوالمنظمات  لكل شركائه لمنع نفاذهم لاًي بيانات في المستقبل .<li/>
 
<lo/> 

";
$lang['success_request_submitted']="طلبك للنفاذ الى البيانات كامل الشروط . تم إرسال رسالة تأكيد الى بريدك الإلكتروني";
$lang['track_status_request']="لتتبع حالة طلبك،انقر على الزر";
$lang['thank_you']="شكرا!
";
$lang['confirmation_application_for_licensed_dataset']="[تأكيد] طلب الحصول على البيانات بموجب ترخيص
";
$lang['view_all_requests']="عرض جميع الطلبات
";
$lang['open_in_new_window']="افتح في نافذة جديدة";


/* End of file licensed_access_form_lang.php */
/* Location: ./application/language/arabic/licensed_access_form_lang.php */