{
    "type": "template",
    "title": "Microdata Project",
    "items": [
        {
            "type": "section_container",
            "id": "doc_description",
            "key": "doc_description",
            "title": "Document description",
            "class": "mandatory recommended",
            "help_text": "",
            "expanded": true,
            "items": [
                {
                    "key": "doc_desc.title_statement",
                    "title": "Information on metadata",
                    "type": "section",
                    "required": false,
                    "help_text": "",
                    "items": [
                        {
                            "key": "doc_desc.title",
                            "title": "Document title",
                            "type": "string",
                            "required": false,
                            "help_text": "The title of the metadata document (which may be the title of the study itself). The metadata document is the DDI metadata file (XML or JSON file) that is being generated. The \"Document title\" should mention the geographic scope of the data collection as well as the time period covered. For example: “DDI 2.5: Albania Living Standards Study 2012”.",
                            "display_type": "text"
                        },
                        {
                            "key": "doc_desc.idno",
                            "title": "Document ID",
                            "type": "string",
                            "required": false,
                            "help_text": "A unique identifier for the metadata document. This identifier must be unique in the catalog where the metadata are intended to be published. Ideally, the identifier should also be unique globally. This is different from the \"Primary ID\" in section Study description / Title statement, although it is good practice to generate identifiers that establish a clear connection between these two identifiers. The Document ID could also include the metadata document version identifier. For example, if the \"Primary identifier\" of the study is “ALB_LSMS_2012”, the \"Document ID\" in the Metadata information could be “IHSN_DDI_v01_ALB_LSMS_2012” if the DDI metadata are produced by the IHSN. Each organization should establish systematic rules to generate such IDs. A validation rule can be set (using a regular expression) in user templates to enforce a specific ID format. The identifier may not contain blank spaces.",
                            "display_type": "text"
                        },
                        {
                            "key": "doc_desc.producers",
                            "title": "Metadata producers",
                            "type": "array",
                            "required": false,
                            "help_text": "The metadata producer is the person or organization with the financial and/or administrative responsibility for the processes whereby the metadata document was created. This is a \"Recommended\" element. For catalog administration purposes, information on the producer and on the date of metadata production is useful. ",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "help_text": "The name of the person or organization in charge of the production of the DDI metadata. If the name of individuals cannot be provided due to an organization’s data protection rules, the title of the person, or an anonymized identifier, can be provided (or this field can be left blank if no other option is available).",
                                    "type": "string",
                                    "prop_key": "doc_desc.producers.name",
                                    "display_type": "text"
                                },
                                {
                                    "key": "abbr",
                                    "title": "Abbreviation",
                                    "type": "string",
                                    "prop_key": "doc_desc.producers.abbr",
                                    "help_text": "The initials of the person, or the abbreviation of the organization’s name mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "affiliation",
                                    "type": "string",
                                    "title": "Affiliation",
                                    "prop_key": "doc_desc.producers.affiliation",
                                    "help_text": "The affiliation of the person or organization mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "role",
                                    "title": "Role",
                                    "type": "string",
                                    "prop_key": "doc_desc.producers.role",
                                    "help_text": "The specific role of the person or organization mentioned in \"Name\" in the production of the DDI metadata.",
                                    "display_type": "textarea"
                                }
                            ],
                            "is_recommended": true
                        },
                        {
                            "key": "doc_desc.prod_date",
                            "title": "Production date",
                            "type": "string",
                            "required": false,
                            "help_text": "The date the DDI metadata document was produced (not the date it was distributed or archived), preferably entered in ISO 8601 format (YYYY-MM-DD or YYY-MM). A validation rule can be set in user templates to enforce a date format. This is a \"Recommended\" element, as information on the producer and on the date of metadata production is useful for catalog administration purposes.",
                            "is_recommended": true,
                            "display_type": "text"
                        },
                        {
                            "key": "doc_desc.version_statement.version",
                            "title": "Version",
                            "type": "string",
                            "help_text": "Documenting a dataset is not a trivial exercise. It may happen that, having identified errors or gaps in a DDI document, or after receiving suggestions for improvement or additional input, the DDI metadata are modified. The \"Version\" element and the elements \"Version date\", \"Version responsibility\", and \"Version notes\" describe the version of the metadata document. The \"Version\" element is used to enter the label of the version of the metadata document, also known as release or edition. For example, \"Version 1.1\" or \"v1.1\".",
                            "display_type": "text"
                        },
                        {
                            "key": "doc_desc.version_statement.version_date",
                            "title": "Version date",
                            "type": "string",
                            "required": false,
                            "help_text": "The date when this version of the metadata document (DDI file) was produced, preferably identifying an exact date. This will usually correspond to the \"Production date\" element. It is recommended to enter the date in the ISO 8601 date format (YYYY-MM-DD or YYYY-MM or YYYY). A validation rule can be entered in customized templates to ensure that dates are entered in the appropriate format. \n",
                            "display_type": "text"
                        },
                        {
                            "key": "doc_desc.version_statement.version_resp",
                            "title": "Version responsibility",
                            "type": "string",
                            "required": false,
                            "help_text": "The organization or person responsible for this version of the metadata document.\n",
                            "display_type": "text"
                        },
                        {
                            "key": "doc_desc.version_statement.version_notes",
                            "title": "Version notes",
                            "type": "string",
                            "required": false,
                            "help_text": "This element can be used to clarify information/annotation regarding this version of the metadata document, for example to indicate what is new or specific in this version comparing with a previous version. ",
                            "display_type": "textarea"
                        }
                    ]
                }
            ]
        },
        {
            "type": "section_container",
            "key": "study_desc",
            "title": "Study description",
            "class": "mandatory recommended",
            "expanded": true,
            "items": [
                {
                    "type": "section",
                    "key": "study_desc.title_statement",
                    "title": "Title statement",
                    "class": "mandatory recommended",
                    "expanded": true,
                    "items": [
                        {
                            "key": "study_desc.title_statement.idno",
                            "title": "Primary ID",
                            "type": "string",
                            "required": true,
                            "help_text": "The \"Primary ID\" (also referred to as IDNO) is a unique identification number used to identify the study (survey, census or other). A unique identifier is required for cataloguing purpose, so this element is declared as \"Required\". The identifier will allow users to cite the dataset properly. The identifier must be unique within the catalog. Ideally, it should also be globally unique; the recommended option is to obtain a Digital Object Identifier (DOI) for the study. Alternatively, the \"Primary ID\" can be constructed by an organization using a consistent scheme. The scheme could for example be “catalog-country-study-year-version”, where country is the 3-letter ISO country code, producer is the abbreviation of the producing agency, study is the study acronym, year is the reference year (or the year the study started), version is a version number. Using that scheme, the Uganda 2005 Demographic and Health Survey for example would have the following ID (where “MDA” stand for “My Data Archive”): MDA_UGA_DHS_2005_v01. Note that the schema allows you to provide more than one identifier for a same study (in element \"Other identifiers\"); a catalog-specific identifier is thus not incompatible with a globally unique identifier like a DOI. A validation rule can be set (using a regular expression) in user templates to enforce a specific ID format. The identifier may not contain blank spaces.",
                            "rules": [],
                            "is_required": true,
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.title_statement.identifiers",
                            "title": "Other identifiers",
                            "type": "array",
                            "required": true,
                            "help_text": "This repeatable element is used to enter identifiers (IDs) other than the \"Primary ID\" (IDNO). It can for example be a Digital Object Identifier (DOI). The \"Primary ID\" can be repeated here (the \"Primary ID\" does not provide a \"Type\" parameter, so if a DOI or other standard ID type is used as main identifier, it is recommended to repeat it here with the identification of the type). ",
                            "props": [
                                {
                                    "key": "type",
                                    "title": "Type",
                                    "hlep_text": "Type of identifier e.g. `doi`, `handle`, `other`",
                                    "type": "string",
                                    "prop_key": "study_desc.title_statement.identifiers.type",
                                    "help_text": "The type of identifier. For example: “DOI”. ",
                                    "display_type": "text"
                                },
                                {
                                    "key": "identifier",
                                    "title": "Identifier",
                                    "type": "string",
                                    "prop_key": "study_desc.title_statement.identifiers.identifier",
                                    "help_text": "The identifier itself.",
                                    "display_type": "text"
                                }
                            ]
                        },
                        {
                            "key": "study_desc.title_statement.title",
                            "title": "Title",
                            "type": "string",
                            "required": true,
                            "help_text": "This element is \"Required\". Provide here the full authoritative title for the study. Make sure to use a unique name for each distinct study. The title should indicate the time period covered. For example, in a country conducting monthly labor force surveys, the title of a study would be like “Labor Force Survey, December 2020”. When a survey spans two years (for example, a household income and expenditure survey conducted over a period of 12 months from June 2020 to June 2021), the range of years can be provided in the title, for example “Household Income and Expenditure Survey 2020-2021”. The title of a survey should be its official name as stated on the survey questionnaire or in other study documents (report, etc.). Including the country name in the title is optional (another metadata element is used to identify the reference countries). Pay attention to the consistent use of capitalization in the title. ",
                            "rules": [],
                            "is_required": true,
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.title_statement.sub_title",
                            "title": "Subtitle",
                            "type": "string",
                            "help_text": "The sub-title is a secondary title used to amplify or state certain limitations on the main title, for example to add information usually associated with a sequential qualifier for a survey. For example, we may have “[country] Universal Primary Education Project, Impact Evaluation Survey 2007” as Title, and “Baseline dataset” as Subtitle. Note that this information could also be entered as a Title with no Subtitle: “[country] Universal Primary Education Project, Impact Evaluation Survey 2007 - Baseline dataset”. ",
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.title_statement.alternate_title",
                            "title": "Alternate title",
                            "type": "string",
                            "help_text": "The alternate title will typically be used to capture the abbreviation of the survey title. Many surveys are known and referred to by their acronym. The survey reference year(s) may be included. For example, the \"Demographic and Health Survey 2012\" would be abbreviated as \"DHS 2012\", or the \"Living Standards Measurement Study 2020-2012\" as \"LSMS 2020-2021\".  ",
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.title_statement.translated_title",
                            "title": "Translated title",
                            "type": "string",
                            "help_text": "In countries with more than one official language, a translation of the title may be provided here. Likewise, the translated title may simply be a translation into English from a country’s own language. Special characters should be properly displayed, such as accents and other stress marks or different alphabets.",
                            "display_type": "text"
                        }
                    ]
                },
                {
                    "type": "section",
                    "key": "study_description.version",
                    "title": "Version",
                    "class": "recommended",
                    "items": [
                        {
                            "key": "study_desc.version_statement.version",
                            "title": "Version name",
                            "type": "string",
                            "help_text": "The version number, also known as release or edition. The version statement should contain a version number followed by a version label. The version number should follow a standard convention to be adopted by the data repository. We recommend that larger series be defined by a number to the left of a decimal and iterations of the same series by a sequential number that identifies the release. The left number could for example be (0) for the raw, unedited dataset; (1) for the edited dataset, non anonymized, available for internal use at the data producing agency; and (2) the edited dataset, prepared for dissemination to secondary users (possibly anonymized). For example:\n- v0: Basic raw data, resulting from the data capture process, before any data editing is implemented.\n- v1.0: Edited data, first iteration, for internal use only.\n- v1.1: Edited data, second iteration, for internal use only.\n- v2.1: Edited data, anonymized and packaged for public distribution.",
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.version_statement.version_date",
                            "title": "Version date",
                            "help_text": "The reference date for this version of the dataset. The use of the ISO 8601 standard is highly recommended for the formatting of the date (YYYY-MM-DD). A regular expression can be provided in \"Validation rules\" in user templates to validate the information entered in this element.",
                            "type": "string",
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.version_statement.version_resp",
                            "title": "Version responsibility",
                            "help_text": "The person(s) or organization(s) responsible for this version of the study.",
                            "type": "string",
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.version_statement.version_notes",
                            "title": "Notes on version",
                            "type": "string",
                            "help_text": "Version notes should provide a brief report on the changes made through the versioning process. The note should indicate how this version differs from other versions of the same dataset.",
                            "display_type": "textarea"
                        }
                    ]
                },
                {
                    "type": "section",
                    "key": "study_desc.production_statement",
                    "title": "Production",
                    "class": "mandatory recommended",
                    "expanded": true,
                    "items": [
                        {
                            "key": "study_desc.authoring_entity",
                            "title": "Authoring entity",
                            "type": "array",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "type": "string",
                                    "prop_key": "study_desc.authoring_entity.name",
                                    "help_text": "The name of the person, corporate body, or agency responsible for the work’s substantive and intellectual content. The primary investigator will in most cases be an institution, but could also be an individual in the case of small-scale academic surveys. If persons are mentioned, use the appropriate format of Surname, First name.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "affiliation",
                                    "title": "Affiliation",
                                    "type": "string",
                                    "prop_key": "study_desc.authoring_entity.affiliation",
                                    "help_text": "The affiliation of the person, corporate body, or agency mentioned in \"Name\".",
                                    "display_type": "text"
                                }
                            ],
                            "help_text": "The name and affiliation of the person, corporate body, or agency responsible for the study’s substantive and intellectual content (the \"authoring entity\" or “primary investigator”). Generally, in a survey, the authoring entity will be the institution implementing the survey. Repeat the element for each authoring entity, and enter the “Affiliation” when relevant. If various institutions have been equally involved as main investigators, then should all be listed. This only includes the agencies responsible for the implementation of the study, not sponsoring agencies or entities providing technical assistance (for which other metadata elements are available). The order in which authoring entities are listed is discretionary. It can be alphabetic or by significance of contribution. Individual persons can also be mentioned, if not prohibited by privacy protection rules."
                        },
                        {
                            "key": "study_desc.production_statement.producers",
                            "title": "Other producers",
                            "type": "array",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "type": "string",
                                    "prop_key": "study_desc.production_statement.producers.name",
                                    "help_text": "The name of the person or organization.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "abbreviation",
                                    "title": "Abbreviation",
                                    "type": "string",
                                    "prop_key": "study_desc.production_statement.producers.abbreviation",
                                    "help_text": "The official abbreviation of the organization mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "affiliation",
                                    "title": "Affiliation",
                                    "type": "string",
                                    "prop_key": "study_desc.production_statement.producers.affiliation",
                                    "help_text": "The affiliation of the person or organization mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "role",
                                    "title": "Role",
                                    "type": "string",
                                    "prop_key": "study_desc.production_statement.producers.role",
                                    "help_text": "A succinct description of the specific contribution by the person or organization in the production of the data.",
                                    "display_type": "textarea"
                                }
                            ],
                            "help_text": "This field is used to list other parties and persons that have played a significant but not the leading technical role in implementing and producing the data (which will be listed in \"Authoring entity\"). Do not include here the financial sponsors, who should be listed in \"Funding agencies\"."
                        },
                        {
                            "key": "study_desc.production_statement.funding_agencies",
                            "title": "Funding agencies",
                            "help_text": "The source(s) of funds for the production of the study. If different funding agencies sponsored different stages of the production process, use the role attribute to distinguish them.",
                            "type": "array",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "type": "string",
                                    "prop_key": "study_desc.production_statement.funding_agencies.name",
                                    "help_text": "The name of the funding agency.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "abbr",
                                    "title": "Abbreviation",
                                    "type": "string",
                                    "prop_key": "study_desc.production_statement.funding_agencies.abbr",
                                    "help_text": "The abbreviation (acronym) of the funding agency mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "grant",
                                    "title": "Grant number",
                                    "type": "string",
                                    "prop_key": "study_desc.production_statement.funding_agencies.grant",
                                    "help_text": "The grant number. If an agency has provided more than one grant, list them all separated with a “;”.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "role",
                                    "title": "Role",
                                    "type": "string",
                                    "prop_key": "study_desc.production_statement.funding_agencies.role",
                                    "help_text": "The specific contribution of the funding agency mentioned in \"Name\". This element is used when multiple funding agencies are listed to distinguish their specific contributions.",
                                    "display_type": "textarea"
                                }
                            ]
                        },
                        {
                            "key": "study_desc.oth_id",
                            "title": "Other contributors",
                            "type": "array",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "type": "string",
                                    "prop_key": "study_desc.oth_id.name",
                                    "help_text": "The name of the person or organization.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "affiliation",
                                    "title": "Affiliation",
                                    "type": "string",
                                    "prop_key": "study_desc.oth_id.affiliation",
                                    "help_text": "The affiliation of the person or organization mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "role",
                                    "title": "Role",
                                    "type": "string",
                                    "prop_key": "study_desc.oth_id.role",
                                    "help_text": "A brief description of the specific role of the person or organization mentioned in \"Name\".",
                                    "display_type": "textarea"
                                }
                            ],
                            "help_text": "This element is used to acknowledge any other people and organizations that have in some form contributed to the study. This does not include other producers which should be listed in \"Other producers\", and financial sponsors which should be listed in the element \"Funding agencies\"."
                        },
                        {
                            "key": "study_desc.production_statement.prod_date",
                            "title": "Production date",
                            "type": "string",
                            "type_options": {
                                "date_format": "YYYY-MM-DD",
                                "date_parts": true,
                                "is_utc": false
                            },
                            "required": false,
                            "help_text": "This is the date (preferably entered in ISO 8601 format: YYYY-MM-DD or YYYY-MM or YYYY) of the actual and final production of the version of the dataset being documented. At least the month and year should be provided. A regular expression can be entered in user templates to validate the information captured in this field.",
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.production_statement.prod_place",
                            "title": "Production place",
                            "type": "string",
                            "required": false,
                            "help_text": "The address of the organization that produced the dataset being documented.",
                            "display_type": "textarea"
                        },
                        {
                            "key": "study_desc.production_statement.copyright",
                            "title": "Copyright",
                            "type": "string",
                            "help_text": "A copyright statement for the study at the appropriate level.",
                            "display_type": "text"
                        }
                    ]
                },
                {
                    "type": "section",
                    "key": "study_description.study_authorization",
                    "help_text": "Provides structured information on the agency that authorized the study, the date of authorization, and an authorization statement",
                    "title": "Study authorization",
                    "items": [
                        {
                            "key": "study_desc.study_authorization.date",
                            "title": "Authorization date",
                            "help_text": "This element will be used when a special legislation is required to conduct the data collection (for example a Census Act) or when the approval of an Ethics Board or other body is required to collect the data. This and other related elements provide a way to capture structured information on the agency that authorized the study, the date of authorization, and the authorization statement. The \"Authorization date\" element is used to store the date when the authorization to conduct the study was granted. The date will preferably be entered in ISO 8601 format (YYYY-MM-DD or YYYY-MM). A Validation rule can be set in user templates to enforce a specific date format. ",
                            "type": "string",
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.study_authorization.agency",
                            "title": "Authorizing agency",
                            "type": "array",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "type": "string",
                                    "prop_key": "study_desc.study_authorization.agency.name",
                                    "help_text": "Name of the agent or agency that authorized the study.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "affiliation",
                                    "title": "Affiliation",
                                    "type": "string",
                                    "prop_key": "study_desc.study_authorization.agency.affiliation",
                                    "help_text": "The institutional affiliation of the authorizing agent or agency mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "abbr",
                                    "title": "Abbreviation",
                                    "type": "string",
                                    "prop_key": "study_desc.study_authorization.agency.abbr",
                                    "help_text": "The abbreviation of the authorizing agent’s or agency’s name.",
                                    "display_type": "text"
                                }
                            ],
                            "help_text": "This element will be used when a special legislation is required to conduct the data collection (for example a Census Act) or when the approval of an Ethics Board or other body is required to collect the data. This and other related elements provide a way to capture structured information on the agency that authorized the study, the date of authorization, and the authorization statement. This element is used to capture the identification (name, acronym, and affiliation) of the agency that authorized the study."
                        },
                        {
                            "key": "study_desc.study_authorization.authorization_statement",
                            "title": "Authorization statement",
                            "help_text": "This element will be used when a special legislation is required to conduct the data collection (for example a Census Act) or when the approval of an Ethics Board or other body is required to collect the data. This and other related elements provide a way to capture structured information on the agency that authorized the study, the date of authorization, and the authorization statement. This element is used to capture the text of the authorization (or a description and link to a document or other resource containing the authorization statement).",
                            "type": "string",
                            "display_type": "textarea"
                        }
                    ]
                },
                {
                    "type": "section",
                    "key": "study_description.series_statement",
                    "title": "Series",
                    "class": "recommended",
                    "items": [
                        {
                            "key": "study_desc.series_statement.series_name",
                            "title": "Series name",
                            "type": "string",
                            "enum": [],
                            "help_text": "A study may be repeated at regular intervals (such as an annual labor force survey), or be part of an international survey program (such as the MICS, DHS, LSMS and others). The name of the series to which the study belongs is captured in this element. For example, \"Living Standards Measurement Study (LSMS)\" or \"Demographic and Health Survey (DHS)\" or \"Multiple Indicator Cluster Survey VII (MICS7)\". A description of the series can be provided in the element \"Series information\".",
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.series_statement.series_info",
                            "title": "Series information",
                            "type": "string",
                            "help_text": "A study may be repeated at regular intervals (such as an annual labor force survey), or be part of an international survey program (such as the MICS, DHS, LSMS and others). The name of the series to which the study belongs is captured in this element. For example, \"Living Standards Measurement Study (LSMS)\" or \"Demographic and Health Survey (DHS)\" or \"Multiple Indicator Cluster Survey VII (MICS7)\". The name of the series is provided in element \"Series name\". The element \"Series description\" will contain a brief description of the characteristics of the series, including when it started, how many rounds were already implemented, and who is in charge would be provided here.",
                            "display_type": "textarea"
                        }
                    ]
                },
                {
                    "key": "study_desc1674579453273",
                    "title": "Scope and universe",
                    "type": "section",
                    "items": [
                        {
                            "key": "study_desc.study_info.data_kind",
                            "title": "Kind of data",
                            "type": "string",
                            "enum": [
                                {
                                    "code": "ssd",
                                    "label": "Sample survey data"
                                },
                                {
                                    "code": "cen",
                                    "label": "Census/enumeration data"
                                },
                                {
                                    "code": "adm",
                                    "label": "Administrative records data"
                                },
                                {
                                    "code": "agg",
                                    "label": "Aggregate data"
                                },
                                {
                                    "code": "cli",
                                    "label": "Clinical data"
                                },
                                {
                                    "code": "evn",
                                    "label": "Event/transaction data"
                                },
                                {
                                    "code": "obs",
                                    "label": "Observation data/ratings"
                                },
                                {
                                    "code": "pro",
                                    "label": "Process-produced data"
                                },
                                {
                                    "code": "tbd",
                                    "label": "Time budget diaries"
                                }
                            ],
                            "help_text": "This field describes the main type of microdata generated by the study: survey data, census/enumeration data, aggregate data, clinical data, event/transaction data, program source code, machine-readable text, administrative records data, experimental data, psychological test, textual data, coded textual, coded documents, time budget diaries, observation data/ratings, process-produced data, etc. A controlled vocabulary should be used in user templates as this information may be used to build facets (filters) in a catalog user interface.",
                            "display_type": "dropdown-custom"
                        },
                        {
                            "key": "study_desc.study_info.abstract",
                            "title": "Abstract",
                            "type": "string",
                            "help_text": "An un-formatted summary describing the purpose, nature, and scope of the data collection, special characteristics of its contents, major subject areas covered, and what questions the primary investigator(s) attempted to answer when they conducted the study. The summary should ideally be between 50 and 5000 characters long. The abstract should provide a clear summary of the purposes, objectives and content of the survey. It should be written by a researcher or survey statistician aware of the study. Inclusion of this element is recommended.",
                            "is_recommended": true,
                            "display_type": "textarea"
                        },
                        {
                            "key": "study_desc.study_info.keywords",
                            "title": "Keywords",
                            "type": "array",
                            "props": [
                                {
                                    "key": "keyword",
                                    "title": "Keyword",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.keywords.keyword",
                                    "help_text": "A keyword (or phrase).",
                                    "display_type": "text"
                                },
                                {
                                    "key": "vocab",
                                    "title": "Vocabulary",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.keywords.vocab",
                                    "help_text": "The controlled vocabulary from which the keyword is extracted, if any.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "uri",
                                    "title": "URL",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.keywords.uri",
                                    "help_text": "The URL of the controlled vocabulary from which the keyword is extracted, if any.",
                                    "rules": {
                                        "is_uri": true
                                    },
                                    "display_type": "text"
                                }
                            ],
                            "help_text": "Keywords are words or phrases that describe salient aspects of what the dataset is about. The addition of keywords can significantly improve the discoverability of data and is thus recommended. Keywords can summarize and improve the description of the content or subject matter of a resource. Keywords can be selected from a standard thesaurus, preferably an international, multilingual thesaurus. Or they can be suggested by machine learning models. A controlled vocabulary can be used in user templates.",
                            "is_recommended": true
                        },
                        {
                            "key": "study_desc.study_info.topics",
                            "title": "Topics",
                            "type": "array",
                            "props": [
                                {
                                    "key": "topic",
                                    "title": "Topic",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.topics.topic",
                                    "help_text": "The label of the topic. ",
                                    "display_type": "text"
                                },
                                {
                                    "key": "vocab",
                                    "title": "Vocabulary",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.topics.vocab",
                                    "help_text": "The specification (name including the version and date) of the controlled vocabulary from which the topic is taken.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "uri",
                                    "title": "URL",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.topics.uri",
                                    "help_text": "A link (URL) to the controlled vocabulary website.",
                                    "rules": {
                                        "is_uri": true
                                    },
                                    "display_type": "text"
                                }
                            ],
                            "help_text": "Topics indicate the broad substantive topic(s) that the dataset covers. A topic classification facilitates referencing and searches in electronic survey catalogs; topics should thus be selected from a standard controlled vocabulary, for example the CESSDA Topics classification (a typology of topics available in 11 languages), or the Journal of Economic Literature (JEL) Classification System. Note that you may combine topics from more than one controlled vocabulary. "
                        },
                        {
                            "key": "study_desc.study_info.analysis_unit",
                            "title": "Unit of analysis",
                            "type": "string",
                            "help_text": "A study can have multiple units of analysis. This field will list the various units that can be analyzed. For example, a Living Standard Measurement Study (LSMS) may have collected data on households and their members (individuals), on dwelling characteristics, on prices in local markets, on household enterprises, on agricultural plots, and on characteristics of health and education facilities in the sample areas.",
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.study_info.universe",
                            "title": "Universe",
                            "type": "string",
                            "help_text": "The universe is the group of persons (or other units of observations, like dwellings, facilities, or other) that are the object of the study and to which any analytic results refer. The universe will rarely cover the entire population of the country. Sample household surveys, for example, may not cover homeless, nomads, diplomats, community households. Population censuses do not cover diplomats. Facility surveys may be limited to facilities of a certain type (e.g., public schools). Try to provide the most detailed information possible on the population covered by the survey/census, focusing on excluded categories of the population. For household surveys, age, nationality, and residence commonly help to delineate a given universe, but any of a number of factors may be involved, such as sex, race, income, veteran status, criminal convictions, etc. In general, it should be possible to tell from the description of the universe whether a given individual or element (hypothetical or real) is a member of the population under study.",
                            "display_type": "textarea"
                        }
                    ],
                    "help_text": ""
                },
                {
                    "key": "study_desc1674578978386",
                    "title": "Spatial and geographic coverage",
                    "type": "section",
                    "items": [
                        {
                            "key": "study_desc.study_info.time_periods",
                            "title": "Time periods",
                            "help_text": "This refers to the time period (also known as span) covered by the data. It does not necessarily correspond to the dates of data collection (a specific element \"Dates of data collection\" is also available in the standard).\n",
                            "type": "array",
                            "props": [
                                {
                                    "key": "start",
                                    "title": "Start",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.time_periods.start",
                                    "help_text": "The start date for the cycle being described. Enter the date in ISO 8601 format (YYYY-MM-DD or YYYY-MM or YYYY). Indicate open-ended dates with two decimal points (..)",
                                    "display_type": "text"
                                },
                                {
                                    "key": "end",
                                    "title": "End",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.time_periods.end",
                                    "help_text": "The end date for the cycle being described. Enter the date in ISO 8601 format (YYYY-MM-DD or YYYY-MM or YYYY). Indicate open-ended dates with two decimal points (..)",
                                    "display_type": "text"
                                },
                                {
                                    "key": "cycle",
                                    "title": "Cycle",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.time_periods.cycle",
                                    "help_text": "The \"Cycle\" attribute permits specification of the relevant cycle, wave, or round of data.",
                                    "display_type": "text"
                                }
                            ]
                        },
                        {
                            "key": "study_desc.study_info.nation",
                            "title": "Country",
                            "type": "array",
                            "class": "required",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "type": "string",
                                    "rules": [],
                                    "name": "Country name",
                                    "prop_key": "study_desc.study_info.nation.name",
                                    "help_text": "The country name, even in cases where the study does not cover the entire country.  ",
                                    "display_type": "text"
                                },
                                {
                                    "key": "abbreviation",
                                    "title": "Code",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.nation.abbreviation",
                                    "help_text": "The abbreviation will contain a country code, preferably the 3-letter ISO 3166-1 country code.",
                                    "display_type": "text"
                                }
                            ],
                            "help_text": "Indicates the country or countries (or “economies”, or “territories”) covered in the study (but not the sub-national geographic areas). If the study covers more than one country, they will be entered separately. Consistent country names and spelling should be used across an organization (for example, if \"Democratic Republic of Congo\" is the recommended name for the organization, the information should should not be entered as \"Congo, Democratic Republic\", \"Congo, Dem. Rep.\", \"DR Congo\", or other option). In user templates, a controlled vocabulary can be set at the country name level, at the country code level, or at the combined name/code level. ",
                            "is_recommended": true
                        },
                        {
                            "key": "study_desc.study_info.bbox",
                            "title": "Bounding box",
                            "type": "array",
                            "class": "required",
                            "props": [
                                {
                                    "key": "west",
                                    "title": "West",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.bbox.west",
                                    "help_text": "West longitude of the bounding box.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "east",
                                    "title": "East",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.bbox.east",
                                    "help_text": "East longitude of the bounding box.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "south",
                                    "title": "South",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.bbox.south",
                                    "help_text": "South latitude of the bounding box.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "north",
                                    "title": "North",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.bbox.north",
                                    "help_text": "North latitude of the bounding box.",
                                    "display_type": "text"
                                }
                            ],
                            "help_text": "This element is used to define one or multiple geographic bounding box(es), which are the rectangular fundamental geometric description of the geographic coverage of the data. A bounding box is defined by west and east longitudes and north and south latitudes, and includes the largest geographic extent of the dataset’s geographic coverage. The bounding box provides the geographic coordinates of the top left (north/west) and bottom-right (south/east) corners of a rectangular area. This element can be used in catalogs as the first pass of a coordinate-based search. This element is optional, but if the \"Bounding polygon\" element is used, then the \"Bounding box\" element must be included. Also, all 4 components (or none) of the element must be entered. The valid range of latitude in degrees is -90 and +90 for the southern and northern hemisphere, respectively. Longitude is in the range -180 and +180 specifying coordinates west and east of the Prime Meridian, respectively."
                        },
                        {
                            "key": "study_desc.study_info.bound_poly",
                            "title": "Bounding polygon",
                            "help_text": "The \"Bounding box\" metadata element describes a rectangular area representing the entire geographic coverage of a dataset. The element \"Bounding polygon\" allows for a more detailed description of the geographic coverage, by allowing multiple and non-rectangular polygons (areas) to be described. This is done by providing list(s) of latitude and longitude coordinates that define the area(s). It should only be used to define the outer boundaries of the covered areas. This field is intended to enable a refined coordinate-based search, not to actually map an area. Note that if the \"Bounding polygon\" element is used, then the element \"Bounding box\" MUST be present as well, and all points enclosed by the \"Bounding polygon\" MUST be contained within the bounding box defined in \"Bounding box\".",
                            "type": "array",
                            "class": "required",
                            "props": [
                                {
                                    "key": "lat",
                                    "title": "Latitude",
                                    "help_text": "The latitude of the coordinate (Y coordinate).",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.bound_poly.lat",
                                    "display_type": "text"
                                },
                                {
                                    "key": "lon",
                                    "title": "Longitude",
                                    "help_text": "The longitude of the coordinate (X coordinate) .",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.bound_poly.lon",
                                    "display_type": "text"
                                }
                            ]
                        },
                        {
                            "key": "study_desc.study_info.geog_coverage",
                            "title": "Geographic coverage",
                            "type": "string",
                            "help_text": "Information on the geographic coverage of the study. This includes the total geographic scope of the data, and any additional levels of geographic coding provided in the variables. Typical entries will be “National coverage”, “Urban areas”, “Rural areas”, “State of …”, “Capital city”, etc. This does not describe where the data were collected; it describes which area the data are representative of. This means for example that a sample survey could be declared as having a national coverage even if some districts of the country where not included in the sample, as long as the sample is nationally representative. A controlled vocabulary can be provided in user templates.",
                            "enum": [],
                            "display_type": "textarea"
                        },
                        {
                            "key": "study_desc.study_info.geog_unit",
                            "title": "Geographic unit",
                            "type": "string",
                            "help_text": "Describes the levels of geographic aggregation covered by the data. Particular attention must be paid to include information on the lowest geographic area for which data are representative.",
                            "enum": [],
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.study_info.geog_coverage_notes",
                            "title": "Geographic coverage notes",
                            "type": "string",
                            "help_text": "Additional information on the geographic coverage of the study entered as a free text field.",
                            "enum": [],
                            "display_type": "textarea"
                        }
                    ],
                    "help_text": ""
                },
                {
                    "key": "study_desc1674579234511",
                    "title": "Sampling",
                    "type": "section",
                    "items": [
                        {
                            "key": "study_desc.method.data_collection.sampling_procedure",
                            "title": "Sampling procedure",
                            "type": "string",
                            "help_text": "This field only applies to sample surveys. It describes the type of sample and sample design used to select the survey respondents to represent the population. This section should include summary information that includes (but is not limited to): sample size (expected and actual) and how the sample size was decided; level of representation of the sample; sample frame used, and listing exercise conducted to update it; sample selection process (e.g., probability proportional to size or over sampling); stratification (implicit and explicit); design omissions in the sample; strategy for absent respondents/not found/refusals (replacement or not). Detailed information on the sample design is critical to allow users to adequately calculate sampling errors and confidence intervals for their estimates. To do that, they will need to be able to clearly identify the variables in the dataset that represent the different levels of stratification and the primary sampling unit (PSU).\n\nIn publications and reports, the description of sampling design often contains complex formulas and symbols. As the XML and JSON formats used to store the metadata are plain text files, they cannot contain these complex representations. You may however provide references (title/author/date) to documents where such detailed descriptions are provided, and make sure that the documents (or links to the documents) are provided in the catalog where the survey metadata are published.",
                            "display_type": "textarea"
                        },
                        {
                            "key": "study_desc.method.data_collection.sampling_deviation",
                            "title": "Deviations from sample design",
                            "help_text": "Sometimes the reality of the field requires a deviation from the sampling design (for example due to difficulty to access to zones due to weather problems, political instability, etc). If for any reason, the sample design has deviated, this can be reported here. This element will provide information indicating the correspondence as well as the possible discrepancies between the sampled units (obtained) and available statistics for the population (age, sex-ratio, marital status, etc.) as a whole.",
                            "type": "string",
                            "enum": [],
                            "display_type": "textarea"
                        },
                        {
                            "key": "study_desc.method.data_collection.weight",
                            "title": "Weighting",
                            "type": "string",
                            "help_text": "This field only applies to sample surveys. The use of sampling procedures may make it necessary to apply weights to produce accurate statistical results. Describe here the criteria for using weights in analysis of a collection, and provide a list of variables used as weighting coefficient. If more than one variable is a weighting variable, describe how these variables differ from each other and what the purpose of each one of them is.",
                            "_ddi_xpath": "stdyDscr.method.dataColl.weight",
                            "enum": [],
                            "display_type": "textarea"
                        },
                        {
                            "key": "study_desc16745792345111674579295696",
                            "title": "Sample frame",
                            "type": "section",
                            "items": [
                                {
                                    "key": "study_desc.method.data_collection.sample_frame.name",
                                    "title": "Name",
                                    "type": "string",
                                    "help_text": "A description of the sample frame used for identifying the population from which the sample was taken. For example, a telephone book may be a sample frame for a phone survey. Or the listing of enumeration areas (EAs) of a population census can provide a sample frame for a household survey. In addition to the name, label and text describing the sample frame, this structure lists who maintains the sample frame, the period for which it is valid, a use statement, the universe covered, the type of unit contained in the frame as well as the number of units available, the reference period of the frame and procedures used to update the frame. This field capture the name (title) of the sample frame.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "study_desc.method.data_collection.sample_frame.valid_period",
                                    "title": "Valid periods",
                                    "help_text": "Defines a time period for the validity of the sampling frame, using a list of events and dates.",
                                    "type": "array",
                                    "props": [
                                        {
                                            "key": "event",
                                            "title": "Event",
                                            "type": "string",
                                            "help_text": "The event can for example be start or end.",
                                            "prop_key": "study_desc.method.data_collection.sample_frame.valid_period.event",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "date",
                                            "title": "Date",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.sample_frame.valid_period.date",
                                            "help_text": "The date corresponding to the event, preferably entered in ISO 8601 format: YYYY-MM-DD. A validation rule can be set in user templates to enforce the date formatting.",
                                            "display_type": "text"
                                        }
                                    ]
                                },
                                {
                                    "key": "study_desc.method.data_collection.sample_frame.custodian",
                                    "title": "Custodian",
                                    "help_text": "Custodian identifies the agency or individual responsible for creating and/or maintaining the sample frame.",
                                    "type": "string",
                                    "display_type": "text"
                                },
                                {
                                    "key": "study_desc.method.data_collection.sample_frame.universe",
                                    "title": "Universe",
                                    "help_text": "A description of the universe of population covered by the sample frame. Age, nationality, and residence commonly help to delineate a given universe, but any of a number of factors may be involved, such as sex, race, income, etc. The universe may consist of elements other than persons, such as housing units, court cases, deaths, countries, etc. In general, it should be possible to tell from the description of the universe whether a given individual or element (hypothetical or real) is included in the sample frame.",
                                    "type": "string",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.method.data_collection.sample_frame.frame_unit.unit_type",
                                    "title": "Unit type",
                                    "help_text": "The type of the sampling frame unit (for example “household”, or “dwelling”).",
                                    "type": "string",
                                    "enum": [],
                                    "display_type": "text"
                                },
                                {
                                    "key": "study_desc.method.data_collection.sample_frame.frame_unit.is_primary",
                                    "title": "Units are primary",
                                    "type": "boolean",
                                    "help_text": "This Boolean attribute (true/false) indicates whether the sample unit is primary or not.",
                                    "enum": [
                                        {
                                            "code": "true",
                                            "label": "True"
                                        },
                                        {
                                            "code": "false",
                                            "label": "False"
                                        }
                                    ],
                                    "display_type": "dropdown"
                                },
                                {
                                    "key": "study_desc.method.data_collection.sample_frame.frame_unit.num_of_units",
                                    "title": "Number of units",
                                    "help_text": "The number of units in the sample frame, possibly with information on its distribution (e.g. by urban/rural, province, or other).",
                                    "type": "string",
                                    "enum": [],
                                    "display_type": "text"
                                },
                                {
                                    "key": "study_desc.method.data_collection.sample_frame.reference_period",
                                    "title": "Reference periods",
                                    "help_text": "Indicates the period of time in which the sampling frame was actually used for the study in question. ",
                                    "type": "array",
                                    "props": [
                                        {
                                            "key": "event",
                                            "title": "Event",
                                            "type": "string",
                                            "help_text": "Indicates the type of event that the date corresponds to, e.g., “start”, “end”, “single”.",
                                            "prop_key": "study_desc.method.data_collection.sample_frame.reference_period.event",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "date",
                                            "title": "Date",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.sample_frame.reference_period.date",
                                            "help_text": "The relevant date preferably entered in ISO 8601 format: YYYY-MM-DD. A validation rule can be set in user templates to enforce the date formatting.",
                                            "display_type": "text"
                                        }
                                    ]
                                },
                                {
                                    "key": "study_desc.method.data_collection.sample_frame.update_procedure",
                                    "title": "Update procedure",
                                    "help_text": "This element is used to describe how and with what frequency the sample frame is updated. For example: “The lists and boundaries of enumeration areas are updated every ten years at the occasion of the population census cartography work. Listing of households in enumeration areas are updated as and when needed, based on their selection in survey samples.”",
                                    "type": "string",
                                    "enum": [],
                                    "display_type": "textarea"
                                }
                            ],
                            "help_text": ""
                        }
                    ],
                    "help_text": ""
                },
                {
                    "type": "section",
                    "key": "study_desc.method",
                    "title": "Data collection and processing",
                    "items": [
                        {
                            "type": "section",
                            "key": "study_desc.method.data_collection",
                            "title": "Data collection",
                            "items": [
                                {
                                    "key": "study_desc.study_info.coll_dates",
                                    "title": "Dates of data collection",
                                    "type": "array",
                                    "props": [
                                        {
                                            "key": "start",
                                            "title": "Start",
                                            "type": "string",
                                            "prop_key": "study_desc.study_info.coll_dates.start",
                                            "help_text": "Date the data collection started (for the specified cycle, if any). Enter the date preferably in ISO 8601 format (YYYY-MM-DD or YYYY-MM or YYYY). A validation rule can be set in user templates to enforce a specific date format.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "end",
                                            "title": "End",
                                            "type": "string",
                                            "prop_key": "study_desc.study_info.coll_dates.end",
                                            "help_text": "Date the data collection ended (for the specified cycle, if any). Enter the date preferably in ISO 8601 format (YYYY-MM-DD or YYYY-MM or YYYY). A validation rule can be set in user templates to enforce a specific date format.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "cycle",
                                            "title": "Cycle",
                                            "type": "string",
                                            "prop_key": "study_desc.study_info.coll_dates.cycle",
                                            "help_text": "Identification of the cycle of data collection. The cycle attribute permits specification of the relevant cycle, wave, or round of data. For example, a household consumption survey could visit households in four phases (one per quarter). Each quarter would be a cycle, and the specific dates of data collection for each quarter would be entered.",
                                            "display_type": "text"
                                        }
                                    ],
                                    "help_text": "Contains the date(s) when the data were collected, which may be different from the dates the data refer to (see \"Time periods\" element in section \"Geographic and time coverage\"). For example, data may be collected over a period of two weeks (\"Dates of data collection\") about household expenditures during a reference week (\"Time period\") preceding the beginning of data collection. ",
                                    "is_recommended": true
                                },
                                {
                                    "key": "study_desc.method.data_collection.time_method",
                                    "title": "Time method",
                                    "help_text": "The time method or time dimension of the data collection. A controlled vocabulary can be used. The entries for this element may include “panel survey”, “cross-section”, “trend study”, or “time-series”.",
                                    "type": "string",
                                    "display_type": "dropdown-custom",
                                    "enum": [
                                        {
                                            "code": "panel survey",
                                            "label": "Panel survey"
                                        },
                                        {
                                            "label": "Cross-section",
                                            "code": "cross section"
                                        },
                                        {
                                            "code": "trend study",
                                            "label": "Trend study"
                                        },
                                        {
                                            "code": "timeseries",
                                            "label": "Time-series"
                                        }
                                    ]
                                },
                                {
                                    "key": "study_desc.method.data_collection.data_collectors",
                                    "title": "Data collectors",
                                    "help_text": "The entity (individual, agency, or institution) responsible for administering the questionnaire or interview or compiling the data.",
                                    "type": "array",
                                    "props": [
                                        {
                                            "key": "name",
                                            "title": "Name",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.data_collectors.name",
                                            "help_text": "In most cases, we will record here the name of the agency, not the name of interviewers. Only in the case of very small-scale surveys, with a very limited number of interviewers, the name of persons will be included as well.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "affiliation",
                                            "title": "Affiliation",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.data_collectors.affiliation",
                                            "help_text": "The affiliation of the data collector mentioned in \"Name\".",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "abbr",
                                            "title": "Abbreviation",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.data_collectors.abbr",
                                            "help_text": "The abbreviation given to the agency mentioned in \"Name\".",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "role",
                                            "title": "Role",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.data_collectors.role",
                                            "help_text": "The specific role of the person or agency mentioned in \"Name\".",
                                            "display_type": "textarea"
                                        }
                                    ]
                                },
                                {
                                    "key": "study_desc.method.data_collection.collector_training",
                                    "title": "Collector training",
                                    "help_text": "Describes the training provided to data collectors including interviewer training, process testing, compliance with standards etc. This set of elements is repeatable, to capture different aspects of the training process.",
                                    "type": "array",
                                    "props": [
                                        {
                                            "key": "type",
                                            "title": "Type",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.collector_training.type",
                                            "help_text": "The type of training being described. For example, “Training of interviewers”, “Training of controllers”, “Training of cartographers”, “Training on the use of tablets for data collection”, etc.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "training",
                                            "title": "Training",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.collector_training.training",
                                            "help_text": "A brief description of the training. This may include information on the dates and duration, audience, location, content, trainers, issues, etc.",
                                            "display_type": "textarea"
                                        }
                                    ]
                                },
                                {
                                    "key": "study_desc.method.data_collection.frequency",
                                    "title": "Frequency",
                                    "help_text": "For data collected at more than one point in time, the frequency with which the data were collected.",
                                    "type": "string",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.method.data_collection.coll_mode",
                                    "title": "Mode of data collection",
                                    "help_text": "The mode of data collection is the manner in which the interview was conducted or information was gathered. Ideally, a controlled vocabulary will be used to constrain the entries in this field (which could include items like “telephone interview”, “face-to-face paper and pen interview”, “face-to-face computer-assisted interviews (CAPI)”, “mail questionnaire”, “computer-aided telephone interviews (CATI)”, “self-administered web forms”, “measurement by sensor”, and others.\n\nThis is a repeatable field, as some data collection activities implement multi-mode data collection (for example, a population census can offer respondents the options to submit information via web forms, telephone interviews, mailed forms, or face-to-face interviews. ",
                                    "type": "string",
                                    "enum": [
                                        {
                                            "code": "CATI",
                                            "label": "Computer-aided telephone interviews"
                                        },
                                        {
                                            "code": "CAPI",
                                            "label": "Face-to-face computer-assisted interviews"
                                        },
                                        {
                                            "code": "face-to-face",
                                            "label": "Face-to-face paper and pen interview"
                                        },
                                        {
                                            "code": "mail",
                                            "label": "Mail questionnaire"
                                        },
                                        {
                                            "code": "sensor",
                                            "label": "Measurement by sensor"
                                        },
                                        {
                                            "code": "web",
                                            "label": "Self-administered web forms"
                                        },
                                        {
                                            "code": "telephone",
                                            "label": "Telephone interview"
                                        },
                                        {
                                            "code": "other",
                                            "label": "Other"
                                        }
                                    ],
                                    "display_type": "dropdown-custom"
                                },
                                {
                                    "key": "study_desc.method.data_collection.research_instrument",
                                    "title": "Questionnaires",
                                    "help_text": "The questionnaire (or \"form\", or \"research instrument \") used for collecting the data. The following should be mentioned:\n- List of questionnaires and short description of each (all questionnaires must be provided as external resources)\n- In what language(s) was/were the questionnaire(s) available?\n- Information on the questionnaire design process (based on a previous questionnaire, based on a standard model questionnaire, review by stakeholders). If a document was compiled that contains the comments provided by the stakeholders on the draft questionnaire, or a report prepared on the questionnaire testing, a reference to these documents can be provided here.",
                                    "type": "string",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.method.data_collection.instru_development",
                                    "type": "string",
                                    "title": "Instrument development",
                                    "help_text": "Describe any development work on the data collection instrument. This may include a description of the review process, standards followed, and a list of agencies/people consulted.",
                                    "_ddi_xpath": "stdyDscr.method.dataColl.instrumentDevelopment",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.method.data_collection.instru_development_type",
                                    "type": "string",
                                    "title": "Instrument development type",
                                    "help_text": "The instrument development type. This element will be used when a pre-defined list of options (controlled vocabulary) is available.",
                                    "_ddi_xpath": "stdyDscr.method.dataColl.instrumentDevelopment.@type",
                                    "enum": [],
                                    "display_type": "text"
                                },
                                {
                                    "key": "study_desc.method.data_collection.sources",
                                    "title": "Data collection sources",
                                    "type": "array",
                                    "_ddi_xpath": "stdyDscr.method.dataColl.sources",
                                    "props": [
                                        {
                                            "key": "name",
                                            "title": "Name",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.sources.name",
                                            "help_text": "The name and other information on the source. For example, “United States Internal Revenue Service Quarterly Payroll File”",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "origin",
                                            "title": "Origin",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.sources.origin",
                                            "help_text": "For historical materials, information about the origin(s) of the sources and the rules followed in establishing the sources should be specified. This may not be relevant to survey data.",
                                            "display_type": "textarea"
                                        },
                                        {
                                            "key": "characteristics",
                                            "title": "Characteristics",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_collection.sources.characteristics",
                                            "help_text": "Assessment of characteristics and quality of source material. This may not be relevant to survey data.",
                                            "display_type": "textarea"
                                        }
                                    ],
                                    "help_text": "A description of sources used for developing the methodology of the data collection."
                                },
                                {
                                    "key": "study_desc.method.data_collection.coll_situation",
                                    "title": "Data collection situation",
                                    "help_text": "A description of noteworthy aspects of the data collection situation. Includes information on factors such as cooperativeness of respondents, duration of interviews, number of call-backs, etc.",
                                    "type": "string",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.method.data_collection.act_min",
                                    "title": "Minimization of data loss",
                                    "help_text": "A summary of actions taken to minimize data loss. This includes information on actions such as follow-up visits, supervisory checks, historical matching, estimation, etc. Note that this element does not have to include detailed information on response rates, as a specific metadata element is provided for that purpose in section analysis_info / response_rate.",
                                    "type": "string",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.method.data_collection.control_operations",
                                    "type": "string",
                                    "title": "Control operations",
                                    "help_text": "This element contains information on the oversight of the data collection, i.e. on methods implemented to facilitate data control usually performed by the primary investigator.",
                                    "_ddi_xpath": "stdyDscr.method.dataColl.ConOps",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.study_info.notes",
                                    "title": "Notes on data collection",
                                    "type": "string",
                                    "enum": [],
                                    "help_text": "This element is provided to document any specific situations, observations, or events that occurred during data collection. Consider stating such items like: \n    - Was a training of enumerators held? (elaborate) \n    - Was a pilot survey conducted? \n    - Did any events have a bearing on the data quality? (elaborate) \n    - How long did an interview take on average? \n    - In what language(s) were the interviews conducted? \n    - Were there any corrective actions taken by management when problems occurred in the field?",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.method.method_notes",
                                    "title": "Notes on methodology",
                                    "type": "string",
                                    "help_text": "This element is provided to capture any additional relevant information on the data collection methodology, which could not fit in the previous metadata elements.",
                                    "enum": [],
                                    "display_type": "textarea"
                                }
                            ]
                        },
                        {
                            "key": "study_desc.method1674579656806",
                            "title": "Data processing",
                            "type": "section",
                            "items": [
                                {
                                    "key": "study_desc.method.data_processing",
                                    "title": "Data processing",
                                    "help_text": "This element is used to describe how data were electronically captured (e.g., entered in the field, in a centralized manner by data entry clerks, captured electronically using tablets and a CAPI application, via web forms, etc.). Information on devices and software used for data capture can also be provided here. Other data processing procedures not captured elsewhere in the documentation can be described here (tabulation, etc.)",
                                    "_ddi_xpath": "stdyDscr.method.dataProcessing",
                                    "type": "array",
                                    "props": [
                                        {
                                            "key": "type",
                                            "title": "Type",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_processing.type",
                                            "help_text": "The type attribute supports better classification of this activity, including the optional use of a controlled vocabulary. The vocabulary could include options like “data capture”, “data validation”, “variable derivation”, “tabulation”, “data visualizations”, anonymization“, ”documentation\", etc.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "description",
                                            "title": "Description",
                                            "type": "string",
                                            "prop_key": "study_desc.method.data_processing.description",
                                            "help_text": "A description of a data processing task.",
                                            "display_type": "textarea"
                                        }
                                    ]
                                },
                                {
                                    "key": "study_desc.method.data_collection.cleaning_operations",
                                    "title": "Cleaning operations",
                                    "type": "string",
                                    "help_text": "A description of the methods used to clean or edit the data, e.g., consistency checking, wild code checking, etc. The data editing should contain information on how the data was treated or controlled for in terms of consistency and coherence. This item does not concern the data entry phase but only the editing of data whether manual or automatic. It should provide answers to questions like: Was a hot-deck or a cold-deck technique used to edit the data? Were corrections made automatically (by program), or by visual control of the questionnaire? What software was used? If materials are available (specifications for data editing, report on data editing, programs used for data editing), they should be listed here and provided as external resources in data catalogs (the best documentation of data editing consists of well-documented reproducible scripts).",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.method.coding_instructions",
                                    "title": "Coding instructions",
                                    "help_text": "The \"Coding instructions\" elements can be used to describe specific coding instructions used in data processing, cleaning, or tabulation. Providing this information may however be complex and very tedious for datasets with a significant number of variables, where hundreds of commands are used to process the data. An alternative option, preferable in many cases, will be to publish reproducible data editing, tabulation and analysis scripts together with the data, as related resources.",
                                    "_ddi_xpath": "stdyDscr.method.codingInstructions",
                                    "type": "array",
                                    "props": [
                                        {
                                            "key": "type",
                                            "title": "Type",
                                            "type": "string",
                                            "_ddi_xpath": "stdyDscr.method.codingInstructions.@type",
                                            "prop_key": "study_desc.method.coding_instructions.type",
                                            "help_text": "The “type” attribute supports the classification of this activity (e.g. “topcoding”). A controlled vocabulary can be used.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "related_processes",
                                            "title": "Related processes",
                                            "type": "string",
                                            "_ddi_xpath": "stdyDscr.method.codingInstructions.@relatedProcesses",
                                            "prop_key": "study_desc.method.coding_instructions.related_processes",
                                            "help_text": "The \"Related processes\" links a coding instruction to one or more processes such as “data editing”, “recoding”, “imputations and derivations”, “tabulation”, etc.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "txt",
                                            "title": "Description",
                                            "type": "string",
                                            "_ddi_xpath": "stdyDscr.method.codingInstructions.txt",
                                            "prop_key": "study_desc.method.coding_instructions.txt",
                                            "help_text": "A description of the code/command, in a human readable form.",
                                            "display_type": "textarea"
                                        },
                                        {
                                            "key": "command",
                                            "title": "Command",
                                            "help_text": "The command code for the coding instruction.",
                                            "type": "string",
                                            "_ddi_xpath": "stdyDscr.method.codingInstructions.command",
                                            "prop_key": "study_desc.method.coding_instructions.command",
                                            "display_type": "textarea"
                                        },
                                        {
                                            "key": "formal_language",
                                            "title": "Formal language",
                                            "help_text": "The language of the command code, e.g. “Stata”, “R”, “SPSS”, “SAS”, “Python”, etc.",
                                            "type": "string",
                                            "_ddi_xpath": "stdyDscr.method.codingInstructions.command.@formalLanguage",
                                            "prop_key": "study_desc.method.coding_instructions.formal_language",
                                            "display_type": "text"
                                        }
                                    ]
                                }
                            ],
                            "help_text": ""
                        }
                    ]
                },
                {
                    "type": "section",
                    "key": "study_desc.study_development",
                    "title": "Activities",
                    "help_text": "Describe the process of study development as a series of development activities. These activities can be typed using a controlled vocabulary. Describe the activity, listing participants with their role and affiliation, resources used (sources of information), and the outcome of the development activity.",
                    "items": [
                        {
                            "key": "study_desc.study_development.development_activity",
                            "title": "Study activities",
                            "help_text": "This section is used to describe the process that led to the production of the final output of the study, from its inception/design to the dissemination of the final output. Each activity is documented separately. The Generic Statistical Business Process Model (GSBPM) provides a useful decomposition of such a process, which can be used to list the activities to be described. ",
                            "type": "nested_array",
                            "display_options":{
                                "header_fields": ["activity_type", "description"]
                            },
                            "props": [
                                {
                                    "key": "activity_type",
                                    "title": "Type",
                                    "type": "string",
                                    "prop_key": "study_desc.study_development.development_activity.activity_type",
                                    "help_text": "The type of activity. A controlled vocabulary can be used, possibly comprising the main components of the GSBPM: {Needs specification, Design, Build, Collect, Process, Analyze, Disseminate, Evaluate}).",
                                    "enum": [
                                        {
                                            "label": "Needs specification",
                                            "code": "needs-specification"
                                        },
                                        {
                                            "label": "Design",
                                            "code": "design"
                                        },
                                        {
                                            "label": "Build",
                                            "code": "build"
                                        },
                                        {
                                            "label": "Collect",
                                            "code": "collect"
                                        },
                                        {
                                            "label": "Process",
                                            "code": "process"
                                        },
                                        {
                                            "label": "Analyze",
                                            "code": "analyze"
                                        },
                                        {
                                            "label": "Disseminate",
                                            "code": "disseminate"
                                        },
                                        {
                                            "label": "Evaluate",
                                            "code": "evaluate"
                                        }
                                    ],
                                    "display_type": "dropdown-custom"
                                },
                                {
                                    "key": "activity_description",
                                    "title": "Description",
                                    "type": "string",
                                    "_ddi_xpath": "stdyDscr.studyDevelopment.developmentActivity.description",
                                    "prop_key": "study_desc.study_development.development_activity.activity_description",
                                    "help_text": "A brief description of the activity.",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "participants",
                                    "title": "Participants",
                                    "type": "array",
                                    "props": [
                                        {
                                            "key": "name",
                                            "title": "Name",
                                            "type": "string",
                                            "prop_key": "study_desc.study_development.development_activity.participants.name",
                                            "help_text": "Name of the participating person or organization.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "affiliation",
                                            "title": "Affiliation",
                                            "type": "string",
                                            "prop_key": "study_desc.study_development.development_activity.participants.affiliation",
                                            "help_text": "Affiliation of the person or organization mentioned in \"Name\".",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "role",
                                            "title": "Role",
                                            "type": "string",
                                            "prop_key": "study_desc.study_development.development_activity.participants.role",
                                            "help_text": "Specific role (participation) of the person or organization mentioned in \"Name\".",
                                            "display_type": "textarea"
                                        }
                                    ],
                                    "prop_key": "study_desc.study_development.development_activity.participants",
                                    "help_text": "A list of participants (persons or organizations) in the activity. This is a repeatable set of elements; each participant can be documented separately."
                                },
                                {
                                    "key": "resources",
                                    "title": "Resources",
                                    "type": "array",
                                    "_ddi_xpath": "stdyDscr.studyDevelopment.developmentActivity.resource",
                                    "props": [
                                        {
                                            "key": "name",
                                            "title": "Name",
                                            "type": "string",
                                            "prop_key": "study_desc.study_development.development_activity.resources.name",
                                            "help_text": "The name of the resource.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "origin",
                                            "title": "Origin",
                                            "type": "string",
                                            "prop_key": "study_desc.study_development.development_activity.resources.origin",
                                            "help_text": "The origin of the resource mentioned in \"Name\".",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "characteristics",
                                            "title": "Characteristics",
                                            "type": "string",
                                            "prop_key": "study_desc.study_development.development_activity.resources.characteristics",
                                            "help_text": "The characteristics of the resource mentioned in \"Name\".",
                                            "display_type": "textarea"
                                        }
                                    ],
                                    "prop_key": "study_desc.study_development.development_activity.resources",
                                    "help_text": "A description of the data sources and other resources used to implement the activity."
                                },
                                {
                                    "key": "outcome",
                                    "title": "Activity outcome",
                                    "type": "string",
                                    "prop_key": "study_desc.study_development.development_activity.outcome",
                                    "help_text": "A brief description of the main outcome of the activity.",
                                    "display_type": "textarea"
                                }
                            ]
                        }
                    ]
                },
                {
                    "key": "study_desc1674579714270",
                    "title": "Quality",
                    "type": "section",
                    "items": [
                        {
                            "key": "study_desc.study_info.quality_statement.compliance_description",
                            "title": "Standard compliance",
                            "type": "string",
                            "help_text": "A statement on compliance with standard quality assessment procedures. The list of these standards can be documented in the element \"Standards\".",
                            "display_type": "textarea"
                        },
                        {
                            "key": "study_desc.study_info.quality_statement.standards",
                            "title": "Quality standards",
                            "help_text": "An itemized list of quality standards complied with during the execution of the study.",
                            "type": "array",
                            "class": "required",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Standard",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.quality_statement.standards.name",
                                    "help_text": "The name of the quality standard, if such a standard was used. Include the date when the standard was published, and the version of the standard with which the study is compliant, and possibly a URL.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "producer",
                                    "title": "Producer",
                                    "type": "string",
                                    "prop_key": "study_desc.study_info.quality_statement.standards.producer",
                                    "help_text": "The producer of the quality standard mentioned in \"Standard\".",
                                    "display_type": "text"
                                }
                            ]
                        },
                        {
                            "key": "study_desc.study_info.quality_statement.other_quality_statement",
                            "title": "Other quality statement",
                            "type": "string",
                            "help_text": "Any additional statement on the quality of the data, entered as free text. This can be independent of any particular quality standard.",
                            "display_type": "textarea"
                        },
                        {
                            "key": "study_desc16745797142701674579780231",
                            "title": "Ex-post evaluation",
                            "type": "section",
                            "items": [
                                {
                                    "key": "study_desc.study_info.ex_post_evaluation.completion_date",
                                    "title": "Completion date",
                                    "type": "string",
                                    "help_text": "Ex-post evaluations are frequently done within large statistical or research organizations, in particular when a study is intended to be repeated. Such evaluations are recommended by the Generic Statistical Business Process Model (GSBPM). This section of the schema is used to describe the evaluation procedures and their outcomes. This field is used to capture the date the ex-post evaluation was completed. It is recommended to enter the date in ISO format (YYYY-MM-DD or YYYY-MM). A validation rule can be set in user templates to enforce a date format.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "study_desc.study_info.ex_post_evaluation.type",
                                    "title": "Evaluation type",
                                    "type": "string",
                                    "help_text": "The \"Type\" attribute identifies the type of ex-post evaluation, with or without the use of a controlled vocabulary.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "study_desc.study_info.ex_post_evaluation.evaluator",
                                    "title": "Evaluators",
                                    "help_text": "The \"Evaluator\" element identifies the person(s) and/or organization(s) involved in the ex-post evaluation.",
                                    "type": "array",
                                    "class": "required",
                                    "props": [
                                        {
                                            "key": "name",
                                            "title": "Name",
                                            "type": "string",
                                            "prop_key": "study_desc.study_info.ex_post_evaluation.evaluator.name",
                                            "help_text": "The name of the person or organization involved in the evaluation.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "abbr",
                                            "title": "Abbreviation",
                                            "type": "string",
                                            "prop_key": "study_desc.study_info.ex_post_evaluation.evaluator.abbr",
                                            "help_text": "An abbreviation for the organization mentioned in \"Name\".",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "affiliation",
                                            "title": "Affiliation",
                                            "type": "string",
                                            "prop_key": "study_desc.study_info.ex_post_evaluation.evaluator.affiliation",
                                            "help_text": "The affiliation of the individual or organization mentioned in \"Name\".",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "role",
                                            "title": "Role",
                                            "type": "string",
                                            "prop_key": "study_desc.study_info.ex_post_evaluation.evaluator.role",
                                            "help_text": "The specific role played by the individual or organization mentioned in \"Name\" in the evaluation process.",
                                            "display_type": "textarea"
                                        }
                                    ]
                                },
                                {
                                    "key": "study_desc.study_info.ex_post_evaluation.evaluation_process",
                                    "title": "Evaluation process",
                                    "type": "string",
                                    "help_text": "A description of the ex-post evaluation process. This may include information on the period when the evaluation was conducted, cost/budget, relevance, institutional or legal arrangements, etc.",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.study_info.ex_post_evaluation.outcomes",
                                    "title": "Evaluation outcomes",
                                    "type": "string",
                                    "help_text": "A description of the outcomes of the ex-post evaluation. It may include a reference to an evaluation report.",
                                    "display_type": "textarea"
                                }
                            ],
                            "help_text": ""
                        },
                        {
                            "key": "study_desc16745797142701674579912911",
                            "title": "Data appraisal",
                            "type": "section",
                            "items": [
                                {
                                    "key": "study_desc.method.analysis_info.response_rate",
                                    "title": "Response rates",
                                    "type": "string",
                                    "help_text": "The response rate is the percentage of sample units that participated in the survey based on the original sample size. Omissions may occur due to refusal to participate, impossibility to locate the respondent, or other reason. This element is used to provide a narrative description of the response rate, possibly by stratum or other criteria, and if possible with an identification of possible causes. If information is available on the causes of non-response (refusal/not found/other), it can be reported here. This field can also be used to describe non-responses in population censuses.",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.method.data_collection.analysis_info.sampling_error_estimates",
                                    "title": "Sampling errors",
                                    "type": "string",
                                    "help_text": "Sampling errors are intended to measure how precisely one can estimate a population value from a given sample. For sampling surveys, it is good practice to calculate and publish sampling error. This field is used to provide information on these calculations (not to provide the sampling errors themselves, which should be made available in publications or reports). Information can be provided on which ratios/indicators have been subjected to the calculation of sampling errors, and on the software used for computing the sampling error. Reference to a report or other document where the results can be found can also be provided.",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.method.data_collection.analysis_info.data_appraisal",
                                    "title": "Other data appraisal",
                                    "type": "string",
                                    "help_text": "This section is used to report any other action taken to assess the reliability of the data, or any observations regarding data quality. Describe here issues such as response variance, interviewer and response bias, question bias, etc. For a population census, this can include information on the main results of a post enumeration survey (a report should be provided in external resources and mentioned here); it can also include relevant comparisons with data from other sources that can be used as benchmarks.",
                                    "display_type": "textarea"
                                }
                            ],
                            "help_text": ""
                        }
                    ],
                    "help_text": ""
                },
                {
                    "type": "section",
                    "key": "study_desc.data_access",
                    "title": "Data access",
                    "_ddi_xpath": "stdyDscr.dataAccs.setAvail.dataAccs",
                    "items": [
                        {
                            "type": "section",
                            "key": "study_desc.data_access.dataset_availability",
                            "title": "Dataset availability",
                            "help_text": "Information on availability and storage of the collection",
                            "_ddi_xpath": "stdyDscr.dataAccs.setAvail.dataAccs",
                            "items": [
                                {
                                    "key": "study_desc.data_access.dataset_availability.access_place",
                                    "type": "string",
                                    "title": "Location",
                                    "help_text": "Name of the location where the data collection is currently stored.",
                                    "_ddi_xpath": "stdyDscr.dataAccs.setAvail.accsPlac",
                                    "display_type": "text"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_availability.access_place_url",
                                    "type": "string",
                                    "title": "Location URL",
                                    "help_text": "The URL of the website of the location where the data collection is currently stored.",
                                    "_ddi_xpath": "stdyDscr.dataAccs.setAvail.accsPlac.@URI",
                                    "rules": {
                                        "is_uri": true
                                    },
                                    "display_type": "text"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_availability.original_archive",
                                    "type": "string",
                                    "title": "Original archive",
                                    "help_text": "Archive from which the data collection was obtained, if any (the originating archive). Note that the schema we propose provides an element provenance, which is not part of the DDI, that can be used to document the origin of a dataset.",
                                    "_ddi_xpath": "stdyDscr.dataAccs.setAvail.origArch",
                                    "display_type": "text"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_availability.status",
                                    "type": "string",
                                    "title": "Availability status",
                                    "help_text": "A statement of the data availability. An archive may need to indicate that a collection is unavailable because it is embargoed for a period of time, because it has been superseded, because a new edition is imminent, etc. This element will rarely be used.",
                                    "_ddi_xpath": "stdyDscr.dataAccs.setAvail.avlStatus",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_availability.coll_size",
                                    "type": "string",
                                    "title": "Extent of collection",
                                    "help_text": "Extent of the collection. This is a summary of the number of physical files that exist in a collection. We will record here the number of files that contain data and note whether the collection contains other machine-readable documentation and/or other supplementary files and information such as data dictionaries, data definition statements, or data collection instruments. This element will rarely be used.",
                                    "_ddi_xpath": "stdyDscr.dataAccs.setAvail.collSize",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_availability.complete",
                                    "type": "string",
                                    "title": "Completeness",
                                    "help_text": "This item indicates the relationship of the data collected to the amount of data coded and stored in the data collection. Information as to why certain items of collected information were not included in the data file stored by the archive should be provided here. Example: “Because of embargo provisions, data values for some variables have been masked. Users should consult the data definition statements to see which variables are under embargo.” This element will rarely be used.",
                                    "_ddi_xpath": "stdyDscr.dataAccs.setAvail.complete",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_availability.file_quantity",
                                    "type": "string",
                                    "title": "Number of files",
                                    "help_text": "The total number of physical files associated with a collection. This element will rarely be used.",
                                    "_ddi_xpath": "stdyDscr.dataAccs.setAvail.fileQnty",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_availability.notes",
                                    "type": "string",
                                    "title": "Notes",
                                    "help_text": "Additional information on the dataset availability, not included in one of the elements above.",
                                    "_ddi_xpath": "stdyDscr.dataAccs.setAvail.notes",
                                    "display_type": "textarea"
                                }
                            ]
                        },
                        {
                            "type": "section",
                            "key": "study_desc.data_access.dataset_use",
                            "title": "Data access and use",
                            "help_text": " Information on terms of use for the data collection",
                            "_ddi_xpath": "stdyDscr.dataAccs.useStmt",
                            "items": [
                                {
                                    "key": "study_desc.data_access.dataset_use.conf_dec",
                                    "type": "array",
                                    "title": "Confidentiality declaration",
                                    "help_text": "This element is used to determine if signing of a confidentiality declaration is needed to access a resource. We may indicate here what Affidavit of Confidentiality must be signed before the data can be accessed. Another option is to include this information in the element \"Access conditions\". If there is no confidentiality issue, this field can be left blank.",
                                    "props": [
                                        {
                                            "key": "required",
                                            "type": "boolean",
                                            "title": "Required",
                                            "help_text": "Indicate if a confidentiality declaration is required to access a resource. The \"Required\" element is used to aid machine processing of this element. ",
                                            "_ddi_xpath": "stdyDscr.dataAccs.useStmt.confDec.@required",
                                            "prop_key": "study_desc.data_access.dataset_use.conf_dec.required",
                                            "enum": [
                                                {
                                                    "code": "true",
                                                    "label": "True"
                                                },
                                                {
                                                    "code": "false",
                                                    "label": "False"
                                                }
                                            ],
                                            "display_type": "dropdown"
                                        },
                                        {
                                            "key": "txt",
                                            "type": "string",
                                            "title": "Text",
                                            "help_text": "A statement on confidentiality and limitations to data use. This statement does not replace a more comprehensive data agreement (see \"Access condition\"). ",
                                            "_ddi_xpath": "stdyDscr.dataAccs.useStmt.confDec",
                                            "prop_key": "study_desc.data_access.dataset_use.conf_dec.txt",
                                            "display_type": "textarea"
                                        },
                                        {
                                            "key": "form_id",
                                            "type": "string",
                                            "title": "Form ID",
                                            "help_text": "Indicates the number or ID of the confidentiality declaration form that the user must fill out.",
                                            "_ddi_xpath": "stdyDscr.dataAccs.useStmt.confDec.@formNo",
                                            "prop_key": "study_desc.data_access.dataset_use.conf_dec.form_id",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "form_url",
                                            "type": "string",
                                            "title": "Form URL",
                                            "help_text": "The \"Form URL\" element is used to provide a link to an online confidentiality declaration form.",
                                            "_ddi_xpath": "stdyDscr.dataAccs.useStmt.confDec.@URI",
                                            "prop_key": "study_desc.data_access.dataset_use.conf_dec.form_url",
                                            "rules": {
                                                "is_uri": true
                                            },
                                            "display_type": "text"
                                        }
                                    ]
                                },
                                {
                                    "key": "study_desc.data_access.dataset_use.spec_perm",
                                    "type": "array",
                                    "title": "Special permissions",
                                    "help_text": "This element is used to determine if any special permission is required to access a resource.",
                                    "_ddi_xpath": "stdyDscr.dataAccs.useStmt.specPerm",
                                    "props": [
                                        {
                                            "key": "required",
                                            "type": "boolean",
                                            "title": "Required",
                                            "help_text": "Indicate if special permissions are required to access a resource. The \"Required\" element is used to aid machine processing of this element. ",
                                            "prop_key": "study_desc.data_access.dataset_use.spec_perm.required",
                                            "enum": [
                                                {
                                                    "code": "true",
                                                    "label": "True"
                                                },
                                                {
                                                    "code": "false",
                                                    "label": "False"
                                                }
                                            ],
                                            "display_type": "dropdown"
                                        },
                                        {
                                            "key": "txt",
                                            "type": "string",
                                            "title": "Text",
                                            "help_text": "A statement on the special permissions required to access the dataset.",
                                            "prop_key": "study_desc.data_access.dataset_use.spec_perm.txt",
                                            "display_type": "textarea"
                                        },
                                        {
                                            "key": "form_url",
                                            "type": "string",
                                            "title": "Form URL",
                                            "help_text": "The \"Form URL\" is used to provide a link to a special on-line permission form.",
                                            "prop_key": "study_desc.data_access.dataset_use.spec_perm.form_url",
                                            "rules": {
                                                "is_uri": true
                                            },
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "form_id",
                                            "type": "string",
                                            "title": "Form ID",
                                            "help_text": "The “Form ID” indicates the number or ID of the special permissions form that the user must fill out.",
                                            "prop_key": "study_desc.data_access.dataset_use.spec_perm.form_id",
                                            "display_type": "text"
                                        }
                                    ]
                                },
                                {
                                    "key": "study_desc.data_access.dataset_use.restrictions",
                                    "type": "string",
                                    "title": "Restrictions",
                                    "help_text": "Any restrictions on access to or use of the collection such as privacy certification or distribution restrictions should be indicated here. These can be restrictions applied by the author, producer, or distributor of the data. This element can for example contain a statement (extracted from the DDI documentation) like: “In preparing the data file(s) for this collection, the National Center for Health Statistics (NCHS) has removed direct identifiers and characteristics that might lead to identification of data subjects. As an additional precaution NCHS requires, under Section 308(d) of the Public Health Service Act (42 U.S.C. 242m), that data collected by NCHS not be used for any purpose other than statistical analysis and reporting. NCHS further requires that analysts not use the data to learn the identity of any persons or establishments and that the director of NCHS be notified if any identities are inadvertently discovered. Users ordering data are expected to adhere to these restrictions.”",
                                    "_ddi_xpath": "stdyDscr.dataAccs.useStmt.restrctn",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_use.contact",
                                    "title": "Contacts",
                                    "type": "array",
                                    "props": [
                                        {
                                            "key": "name",
                                            "title": "Name",
                                            "type": "string",
                                            "prop_key": "study_desc.data_access.dataset_use.contact.name",
                                            "help_text": "Name of the person. Note that in some cases, it might be better to provide a title/function than the actual name of the person. Keep in mind that people do not stay forever in their position.",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "affiliation",
                                            "title": "Affiliation",
                                            "type": "string",
                                            "prop_key": "study_desc.data_access.dataset_use.contact.affiliation",
                                            "help_text": "Affiliation of the person mentioned in \"Name\".",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "uri",
                                            "title": "URL",
                                            "type": "string",
                                            "prop_key": "study_desc.data_access.dataset_use.contact.uri",
                                            "help_text": "URL for the person; it can be the URL of the organization the person belongs to.",
                                            "rules": {
                                                "is_uri": true
                                            },
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "email",
                                            "title": "Email",
                                            "type": "string",
                                            "prop_key": "study_desc.data_access.dataset_use.contact.email",
                                            "help_text": "The email element is used to indicate an email address for the contact individual mentioned in name. Ideally, a generic email address should be provided. It is easy to configure a mail server in such a way that all messages sent to the generic email address would be automatically forwarded to some staff members.",
                                            "display_type": "text"
                                        }
                                    ],
                                    "help_text": "Users of the data may need further clarification and information on the terms of use and conditions to access the data. This set of elements is used to identify the contact persons who can be used as resource persons regarding problems or questions raised by the user community."
                                },
                                {
                                    "key": "study_desc.data_access.dataset_use.cit_req",
                                    "title": "Citation requirement",
                                    "type": "string",
                                    "help_text": "A citation requirement that indicates the way that the dataset should be referenced when cited in any publication. Providing a citation requirement will guarantee that the data producer gets proper credit, and that results of analysis can be linked to the proper version of the dataset. The data access policy should explicitly mention the obligation to comply with the citation requirement. The citation should include at least the primary investigator, the name and abbreviation of the dataset, the reference year, and the version number. Include also a website where the data or information on the data is made available by the official data depositor. Ideally, the citation requirement will include a DOI (see the DataCite website for recommendations).",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_use.deposit_req",
                                    "type": "string",
                                    "title": "Deposit requirement",
                                    "help_text": "Information regarding data users’ responsibility for informing archives of their use of data through providing citations to the published work or providing copies of the manuscripts.",
                                    "_ddi_xpath": "stdyDscr.dataAccs.useStmt.deposReq",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_use.conditions",
                                    "title": "Access conditions",
                                    "type": "string",
                                    "help_text": "Indicates any additional information that will assist the user in understanding the access and use conditions of the data collection. Note that if this information is subject to change, it should not be captured in the study metadata but provided in a data catalog page. ",
                                    "_ddi_xpath": "stdyDscr.dataAccs.useStmt.conditions",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.data_access.dataset_use.disclaimer",
                                    "title": "Disclaimer",
                                    "help_text": "A disclaimer limits the liability that the data producer or data custodian has regarding the use of the data. A standard legal statement should be used for all datasets from a same agency. The following formulation could be used: The user of the data acknowledges that the original collector of the data, the authorized distributor of the data, and the relevant funding agency bear no responsibility for use of the data or for interpretations or inferences based upon such uses.",
                                    "type": "string",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "study_desc.data_access.notes",
                                    "type": "string",
                                    "title": "Notes",
                                    "help_text": "Any additional information related to data access that is not contained in the specific metadata elements provided in the section \"Data access and use\".",
                                    "_ddi_xpath": "stdyDscr.dataAccs.setAvail.notes",
                                    "display_type": "textarea"
                                }
                            ]
                        }
                    ]
                },
                {
                    "type": "section",
                    "key": "study_description.bib_citation_section",
                    "title": "Bibliographic citation",
                    "help_text": "Complete bibliographic reference containing all of the standard elements of a citation that can be used to cite the work. The `'bib_citation_format'` field is provided to enable specification of the particular citation style used, e.g., APA, MLA, Chicago, etc.",
                    "class": "recommended",
                    "items": [
                        {
                            "type": "string",
                            "key": "study_description.bib_citation",
                            "title": "Bibliographic citation",
                            "help_text": "Complete bibliographic reference containing all of the standard elements of a citation that can be used to cite the study. A \"Citation format\" element is also provided to enable specification of the particular citation style used, for example APA, MLA, or Chicago.",
                            "display_type": "textarea"
                        },
                        {
                            "key": "study_desc.bib_citation_format",
                            "title": "Citation format",
                            "type": "string",
                            "help_text": "This element is used to specify the particular citation style used in the field \"Bibliographic citation\", for example \"APA\", \"MLA\", or \"Chicago\".",
                            "display_type": "text"
                        }
                    ]
                },
                {
                    "type": "section",
                    "key": "study_description.holdings_section",
                    "title": "Holdings information",
                    "help_text": "Information concerning either the physical or electronic holdings of the cited work. Attributes include: location--The physical location where a copy is held; callno--The call number for a work at the location specified; and URI--A URN or URL for accessing the electronic copy of the cited work.",
                    "items": [
                        {
                            "key": "study_description.holdings",
                            "title": "Holdings information",
                            "help_text": "Information concerning either the physical or electronic holdings of the study being described. Note that this information should only be provided when the dataset is stored in a location that is unlikely to change. If a dataset is stored in multiple and/or changing locations, this information can be left empty as it would in many cases be inaccurate.\n",
                            "type": "array",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "type": "string",
                                    "prop_key": "study_description.holdings.name",
                                    "help_text": "Name of the physical or electronic holdings of the cited study.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "location",
                                    "title": "Location",
                                    "type": "string",
                                    "prop_key": "study_description.holdings.location",
                                    "help_text": "The physical location where a copy of the study is held.",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "callno",
                                    "title": "Call number",
                                    "type": "string",
                                    "prop_key": "study_description.holdings.callno",
                                    "help_text": "The call number at the location specified in \"Location\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "uri",
                                    "title": "URL",
                                    "type": "string",
                                    "prop_key": "study_description.holdings.uri",
                                    "help_text": "A URL for accessing the electronic copy of the cited study from the location mentioned in \"Name\".",
                                    "rules": {
                                        "is_uri": true
                                    },
                                    "display_type": "text"
                                }
                            ]
                        }
                    ]
                },
                {
                    "type": "section",
                    "key": "study_desc.distribution_statement",
                    "title": "Distribution",
                    "class": "mandatory recommended",
                    "expanded": true,
                    "items": [
                        {
                            "key": "study_desc.distribution_statement.distributors",
                            "title": "Distributors",
                            "type": "array",
                            "required": false,
                            "help_text": "The organization(s) designated by the author or producer to generate copies of the study output including any necessary editions or revisions.",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "description": "Organization name",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.distributors.name",
                                    "help_text": "The name of the distributor. It can be an individual or an organization.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "abbr",
                                    "title": "Abbreviation",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.distributors.abbr",
                                    "help_text": "The official abbreviation of the organization mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "affiliation",
                                    "type": "string",
                                    "title": "Affiliation",
                                    "prop_key": "study_desc.distribution_statement.distributors.affiliation",
                                    "help_text": "The affiliation of the person or organization mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "uri",
                                    "title": "URL",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.distributors.uri",
                                    "help_text": "A link (URL) to the ordering service or download facility website.",
                                    "rules": {
                                        "is_uri": true
                                    },
                                    "display_type": "text"
                                }
                            ]
                        },
                        {
                            "key": "study_desc.distribution_statement.contact",
                            "title": "Contacts",
                            "type": "array",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.contact.name",
                                    "help_text": "The name of the person or organization that can be contacted.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "affiliation",
                                    "title": "Affiliation",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.contact.affiliation",
                                    "help_text": "The affiliation of the person or organization mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "email",
                                    "title": "Email",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.contact.email",
                                    "help_text": "An email address for the contact mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "uri",
                                    "title": "URL",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.contact.uri",
                                    "help_text": "A link (URL) to the contact mentioned in \"Name\".",
                                    "rules": {
                                        "is_uri": true
                                    },
                                    "display_type": "text"
                                }
                            ],
                            "help_text": "Names and addresses of individuals responsible for the study. Individuals listed as contact persons will be used as resource persons regarding problems or questions raised by users."
                        },
                        {
                            "key": "study_desc.distribution_statement.depositor",
                            "title": "Depositor",
                            "type": "array",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.depositor.name",
                                    "help_text": "The name of the depositor. It can be an individual or an organization.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "abbr",
                                    "title": "Abbreviation",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.depositor.abbr",
                                    "help_text": "The official abbreviation of the organization mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "affiliation",
                                    "title": "Affiliation",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.depositor.affiliation",
                                    "help_text": "The affiliation of the person or organization mentioned in \"Name\".",
                                    "display_type": "text"
                                },
                                {
                                    "key": "uri",
                                    "title": "URL",
                                    "type": "string",
                                    "prop_key": "study_desc.distribution_statement.depositor.uri",
                                    "help_text": "A link (URL) to the depositor website.",
                                    "rules": {
                                        "is_uri": true
                                    },
                                    "display_type": "text"
                                }
                            ],
                            "help_text": "The name of the person or institution who provided this study to the archive storing it."
                        },
                        {
                            "key": "study_desc.distribution_statement.deposit_date",
                            "title": "Date of deposit",
                            "type": "string",
                            "help_text": "The date that the study was deposited with the archive that originally received it. The date should be entered in the ISO 8601 format (YYYY-MM-DD or YYYY-MM or YYYY). The exact date should be provided when possible. A regular expression can be entered in customized user templates to validate the content of this element. ",
                            "display_type": "text"
                        },
                        {
                            "key": "study_desc.distribution_statement.distribution_date",
                            "title": "Date of distribution",
                            "type": "string",
                            "help_text": "Date that the study was made available for distribution. The date should be entered in the ISO 8601 format (YYYY-MM-DD or YYYY-MM or YYYY). The exact date should be provided when possible. A regular expression can be entered in customized user templates to validate the content of this element. ",
                            "display_type": "text"
                        }
                    ]
                },
                {
                    "type": "section",
                    "key": "study_description.study_info",
                    "help_text": "This section contains information about the data collection's scope across several dimensions, including substantive content, geography, and time.",
                    "title": "Other information",
                    "items": [
                        {
                            "key": "study_desc.study_info.study_budget",
                            "title": "Budget",
                            "help_text": "The budget of a study will ideally be described by budget line. The currency used to describe the budget should be specified. This element can also be used to document issues related to the budget (e.g., documenting possible under-run and over-run).",
                            "type": "string",
                            "display_type": "textarea"
                        },
                        {
                            "key": "study_desc.method.study_class",
                            "type": "string",
                            "title": "Class of the study",
                            "help_text": "This element can be used to give the data archive’s class or study status number, which indicates the processing status of the study. But it can also be used as an element to indicate the type of study, based on a controlled vocabulary. The element is repeatable, allowing one study to belong to more than one class. ",
                            "_ddi_xpath": "stdyDscr.method.stdyClas",
                            "display_type": "text"
                        },
                        {
                            "key": "study_description.study_notes",
                            "title": "Notes on the study",
                            "help_text": "This element can be used to provide additional information on the study which cannot be accommodated in the specific metadata elements of the schema, in the form of a free text field.",
                            "type": "string",
                            "display_type": "textarea"
                        }
                    ]
                }
            ]
        },
        {
            "type": "section_container",
            "key": "file_description",
            "title": "Data files",
            "is_custom": true,
            "items": [
                {
                    "type": "section",
                    "key": "data_file",
                    "title": "Data file description",
                    "items": [
                        {
                            "key": "data_file.file_id",
                            "title": "File ID",
                            "type": "string",
                            "enum": [],
                            "help_text": "A unique file identifier (within the metadata document, not necessarily within a catalog). This will typically be the electronic file name.",
                            "is_required": true,
                            "display_type": "text"
                        },
                        {
                            "key": "data_file.file_name",
                            "title": "File name",
                            "type": "string",
                            "enum": [],
                            "help_text": "This is not the name of the electronic file (which is provided in the previous element). It is a short title (label) that will help distinguish a particular file/part from other files/parts in the dataset.",
                            "is_required": true,
                            "display_type": "text"
                        },
                        {
                            "key": "data_file.file_type",
                            "title": "File type",
                            "type": "string",
                            "enum": [],
                            "help_text": "The type of data files. For example, raw data (ASCII), or software-dependent files such as SAS / Stata / SPSS data file, etc. Provide specific information (e.g. Stata 10 or Stata 15, SPSS Windows or SPSS Export, etc.) Note that in an on-line catalog, data can be made available in multiple formats. In such case, the file_type element is not useful.",
                            "display_type": "text"
                        },
                        {
                            "key": "data_file.description",
                            "title": "Description",
                            "type": "string",
                            "enum": [],
                            "help_text": "The \"File ID\" and \"File name\" elements provide limited information on the content of the file. The description element is used to provide a more detailed description of the file content. This description should clearly distinguish collected variables and derived variables. It is also useful to indicate the availability in the data file of some particular variables such as the weighting coefficients. If the file contains derived variables, it is good practice to refer to the computer program that generated it. Information about the data file(s) that comprises a collection.",
                            "display_type": "textarea"
                        },
                        {
                            "key": "data_file.case_count",
                            "title": "Case count",
                            "type": "integer",
                            "enum": [],
                            "help_text": "Number of cases or observations in the data file. The value is 0 by default. This information will be automatically generated in Metadata Editors that provide an option to import data files.",
                            "rules": {
                                "numeric": true
                            },
                            "display_type": "text"
                        },
                        {
                            "key": "data_file.var_count",
                            "title": "Variable count",
                            "type": "integer",
                            "enum": [],
                            "help_text": "Number of variables in the data file. The value is 0 by default.  This information will be automatically generated in Metadata Editors that provide an option to import data files.",
                            "rules": {
                                "numeric": true
                            },
                            "display_type": "text"
                        },
                        {
                            "key": "data_file.producer",
                            "title": "Producer",
                            "type": "string",
                            "enum": [],
                            "help_text": "The name of the agency that produced the data file. Most data files will have been produced by the survey primary investigator. In some cases however, auxiliary or derived files from other producers may be released with a data set. This may for example be a file containing derived variables generated by a researcher.",
                            "display_type": "text"
                        },
                        {
                            "key": "data_file.data_checks",
                            "title": "Data checks",
                            "type": "string",
                            "enum": [],
                            "help_text": "Use this element if needed to provide information about the types of checks and operations that have been performed on the data file to make sure that the data are as correct as possible, e.g. consistency checking, wildcode checking, etc. Note that the information included here should be specific to the data file. Information about data processing checks that have been carried out on the data collection (study) as a whole should be provided in the Data editing element at the study level. You may also provide here a reference to an external resource that contains the specifications for the data processing checks (that same information may be provided also in the Data Editing filed in the Study Description section).",
                            "display_type": "textarea"
                        },
                        {
                            "key": "data_file.missing_data",
                            "title": "Missing data",
                            "type": "string",
                            "enum": [],
                            "help_text": "A description of missing data (number of missing cases, cause of missing values, etc.)",
                            "display_type": "textarea"
                        },
                        {
                            "key": "data_file.version",
                            "title": "Version",
                            "type": "string",
                            "enum": [],
                            "help_text": "The version of the data file. A data file may undergo various changes and modifications. File specific versions can be tracked in this element. This field will in most cases be left empty.",
                            "display_type": "textarea"
                        },
                        {
                            "key": "data_file.notes",
                            "title": "Notes on data file",
                            "type": "string",
                            "enum": [],
                            "help_text": "This field aims to provide information on the specific data file not covered elsewhere.",
                            "display_type": "textarea"
                        }
                    ]
                }
            ]
        },
        {
            "type": "section_container",
            "key": "variable_description",
            "title": "Variables",
            "is_custom": true,
            "items": [
                {
                    "type": "section",
                    "key": "variable",
                    "title": "Variable description",
                    "items": [
                        {
                            "key": "variable.file_id",
                            "title": "File ID",
                            "type": "string",
                            "enum": [],
                            "help_text": "A dataset can be composed of multiple data files. The File ID is the name of the data file that contains the variable being documented. This file name should correspond to a File ID listed in the \"Data file description\" section of the DDI. When using a Metadata Editor application, this information will typically be automatically generated when importing data files. This information is required.",
                            "is_required": true,
                            "display_type": "text"
                        },
                        {
                            "key": "variable.vid",
                            "title": "Variable ID",
                            "type": "string",
                            "enum": [],
                            "help_text": "A unique identifier given to the variable (unique within the full dataset, not only within a data file). This information is required. This is NOT the variable name (captured in element \"Variable name\"). This can be a system-generated ID, such as a sequential number within each data file. When using a Metadata Editor application, the ID will typically be automatically generated when importing data files. ",
                            "is_required": true,
                            "display_type": "text"
                        },
                        {
                            "key": "variable.name",
                            "title": "Variable name",
                            "type": "string",
                            "enum": [],
                            "help_text": "The name of the variable in the data file. This information is required. The name should be entered exactly as found in the data file (not abbreviated or converted to upper or lower cases, as some software applications are case-sensitive). This information can be programmatically extracted from the data file. When using a Metadata Editor application, the variable name will typically be extracted from the imported data files. The variable name is limited to eight characters in some statistical analysis software such as SAS or SPSS. A variable name must be unique within a data file (not within a full dataset, as a same variable may appear in multiple data files). ",
                            "is_required": true,
                            "display_type": "text"
                        },
                        {
                            "key": "variable.labl",
                            "title": "Variable label",
                            "type": "string",
                            "enum": [],
                            "help_text": "All variables should have a label that provides a short but clear indication of what the variable contains. Ideally, all variables in a data file will have a unique label. File formats like Stata or SPSS often contain variable labels. When using a Metadata Editor application, the variable name will typically be extracted from the imported data files. Variable labels can also be found in data dictionaries in software applications like Survey Solutions or CsPro. Avoid using the question itself as a label (specific elements are available to capture the literal question text). Think of a label as what you would want to see in a tabulation of the variables. Keep in mind that software applications like Stata and others impose a limit to the number of characters in a label (often, 80). \n",
                            "is_recommended": true,
                            "display_type": "text"
                        },
                        {
                            "key": "variable.var_universe",
                            "title": "Universe",
                            "type": "string",
                            "help_text": "The universe at the variable level defines the population the question applied to. It reflects skip patterns in a questionnaire. This information can typically be copy/pasted from the survey questionnaire. Try to be as specific as possible. This information is critical for the analyst, as it explains why missing values may be found in a variable.",
                            "enum": [],
                            "display_type": "textarea"
                        },
                        {
                            "key": "variable.var_txt",
                            "title": "Variable definition",
                            "type": "string",
                            "help_text": "This element provides a space to describe the variable in detail. Not all variables require a definition.",
                            "enum": [],
                            "display_type": "textarea"
                        },
                        {
                            "key": "variable.var_concept",
                            "title": "Concepts",
                            "type": "array",
                            "help_text": "The general subject to which the parent element may be seen as pertaining. This element serves the same purpose as the keywords and topic classification elements, but at the variable description level.",
                            "props": [
                                {
                                    "key": "title",
                                    "title": "Title",
                                    "type": "string",
                                    "prop_key": "variable.var_concept.title",
                                    "help_text": "The name (label) of the concept.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "vocab",
                                    "title": "Vocabulary",
                                    "type": "string",
                                    "prop_key": "variable.var_concept.vocab",
                                    "help_text": "The controlled vocabulary, if any, from which the concept `title’ was taken.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "uri",
                                    "title": "URL",
                                    "type": "string",
                                    "prop_key": "variable.var_concept.uri",
                                    "help_text": "A link (URL) to the controlled vocabulary mentioned in \"Vocabulary\".",
                                    "display_type": "text",
                                    "rules": {
                                        "is_uri": true
                                    }
                                }
                            ]
                        },
                        {
                            "key": "variable.var_sumstat",
                            "title": "Summary statistics",
                            "type": "array",
                            "help_text": "The DDI metadata standard provides multiple elements to capture various summary statistics such as minimum, maximum, or mean values (weighted and un-weighted) for each variable. The content of the \"Summary statistics\" section will be easy to fill out programmatically (using R or Python) or using a specialized DDI metadata editor, which can read the data file and generate the summary statistics.\n",
                            "props": [
                                {
                                    "key": "type",
                                    "title": "Type",
                                    "type": "string",
                                    "prop_key": "variable.var_sumstat.type",
                                    "help_text": "The type of statistics being shown: mean, median, mode, valid cases, invalid cases, minimum, maximum, or standard deviation.",
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "value",
                                    "title": "Value",
                                    "type": "string",
                                    "prop_key": "variable.var_sumstat.value",
                                    "help_text": "The value of the summary statistics mentioned in type.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "wgtd",
                                    "title": "Weighted",
                                    "type": "string",
                                    "prop_key": "variable.var_sumstat.wgtd",
                                    "help_text": "Indicates whether the statistics reported in value are weighted or not (for variables in sample surveys). Enter “weighted” if weighted, otherwise leave this element empty.",
                                    "display_type": "text",
                                    "enum": []
                                }
                            ]
                        },
                        {
                            "key": "variable.var_catgry",
                            "title": "Variable categories",
                            "type": "array",
                            "props": [
                                {
                                    "key": "value",
                                    "title": "Code",
                                    "type": "string",
                                    "prop_key": "variable.var_catgry.value",
                                    "help_text": "The code of the category.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "label",
                                    "title": "Label",
                                    "type": "string",
                                    "prop_key": "variable.var_catgry.label",
                                    "help_text": "The label of the category (or \"value label\")",
                                    "display_type": "text"
                                },
                                {
                                    "key": "stats",
                                    "title": "Statistics",
                                    "type": "array",
                                    "props": [
                                        {
                                            "key": "type",
                                            "title": "Type",
                                            "type": "string",
                                            "prop_key": "variable.var_catgry.stats.type",
                                            "help_text": "Type of statistics, e.g. \"Count\".",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "value",
                                            "title": "Value",
                                            "type": "string",
                                            "prop_key": "variable.var_catgry.stats.value",
                                            "help_text": "Estimate",
                                            "display_type": "text"
                                        },
                                        {
                                            "key": "wgtd",
                                            "title": "Weighted",
                                            "type": "string",
                                            "prop_key": "variable.var_catgry.stats.wgtd",
                                            "help_text": "Indicates whether the \"Value\" is weighted (for sample surveys) or not.",
                                            "display_type": "text"
                                        }
                                    ],
                                    "prop_key": "variable.var_catgry.stats"
                                }
                            ],
                            "help_text": "A description of the categories (codes with labels) that apply to the variable, for categorical variables. The element also includes summary statistics at the category level."
                        },
                        {
                            "key": "variable.var_std_catgry",
                            "title": "Standard categories",
                            "type": "array",
                            "help_text": "This element is used to indicate that the codes used for a categorical variable are from a standard international or other classification, like COICOP, ISIC, ISO country codes, etc.",
                            "props": [
                                {
                                    "key": "name",
                                    "title": "Name",
                                    "type": "string",
                                    "prop_key": "variable.var_std_catgry.name",
                                    "help_text": "The name of the classification, e.g. “International Standard Industrial Classification of All Economic Activities (ISIC), Revision 4”",
                                    "display_type": "text"
                                },
                                {
                                    "key": "source",
                                    "title": "Source",
                                    "type": "string",
                                    "prop_key": "variable.var_std_catgry.source",
                                    "help_text": "The source of the classification, for example “United Nations”.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "date",
                                    "title": "Date",
                                    "type": "string",
                                    "prop_key": "variable.var_std_catgry.date",
                                    "help_text": "The version (typically a date) of the classification used for the study.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "uri",
                                    "title": "URL",
                                    "type": "string",
                                    "prop_key": "variable.var_std_catgry.uri",
                                    "help_text": "A URL to a website where an electronic copy and more information on the classification can be obtained.",
                                    "rules": {
                                        "is_uri": true
                                    },
                                    "display_type": "text"
                                }
                            ]
                        },
                        {
                            "key": "variable.var_intrvl",
                            "title": "Interval type",
                            "help_text": "This element indicates whether the intervals between values for the variable are discrete or continuous.",
                            "type": "string",
                            "enum": [
                                {
                                    "code": "discrete",
                                    "label": "Discrete"
                                },
                                {
                                    "code": "continuous",
                                    "label": "Continuous"
                                }
                            ],
                            "display_type": "dropdown"
                        },
                        {
                            "key": "variable.var_dcml",
                            "title": "Decimal points",
                            "type": "string",
                            "help_text": "This element refers to the number of decimal points in the values of the variable. It must be a numeric value.",
                            "enum": [],
                            "display_type": "text"
                        },
                        {
                            "key": "variable.var_wgt",
                            "title": "Is weight",
                            "type": "integer",
                            "help_text": "This element, which applies to dataset from sample surveys, indicates whether the variable is a sample weight (value “1”) or not (value \"0). Sample weights play an important role in the calculation of summary statistics and sampling errors, and should therefore be flagged.",
                            "default": 0,
                            "enum": [
                                {
                                    "code": "0",
                                    "label": "Not a weight"
                                },
                                {
                                    "code": "1",
                                    "label": "Weight"
                                }
                            ],
                            "display_type": "dropdown"
                        },
                        {
                            "key": "variable.var_security",
                            "title": "Security",
                            "type": "string",
                            "help_text": "This element is used to provide information regarding levels of access, e.g., public, subscriber, need to know.",
                            "enum": [],
                            "display_type": "textarea"
                        },
                        {
                            "key": "variable.var_notes",
                            "title": "Notes on variable",
                            "type": "string",
                            "help_text": "This element is provided to record any additional or auxiliary information related to the specific variable.",
                            "enum": [],
                            "display_type": "textarea"
                        },
                        {
                            "key": "variable1674857821438",
                            "title": "Questions and instructions",
                            "type": "section",
                            "items": [
                                {
                                    "key": "variable.var_respunit",
                                    "title": "Respondent",
                                    "type": "string",
                                    "help_text": "Provides information regarding who provided the information contained within the variable, e.g., head of household, respondent, proxy, interviewer.",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "variable.var_qstn_preqtxt",
                                    "title": "Pre-question text",
                                    "type": "string",
                                    "help_text": "The pre-question texts are the instructions provided to the interviewers and printed in the questionnaire before the literal question. This does not apply to all variables. Do not confuse this with instructions provided in the interviewer’s manual.",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "variable.var_qstn_qstnlit",
                                    "title": "Literal question",
                                    "type": "string",
                                    "help_text": "The literal question is the full text of the questionnaire as the enumerator is expected to ask it when conducting the interview. This does not apply to all variables (it does not apply to derived variables).",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "variable.var_qstn_postqtxt",
                                    "title": "Post question text",
                                    "type": "string",
                                    "help_text": "The post-question texts are instructions provided to the interviewers, printed in the questionnaire after the literal question. Post-question can be used to enter information on skips provided in the questionnaire. This does not apply to all variables. Do not confuse this with instructions provided in the interviewer’s manual. With the previous two elements, one should be able to understand how the question was formulated in a questionnaire.",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "variable.var_forward",
                                    "title": "Forward skip",
                                    "type": "string",
                                    "help_text": "Contains a reference to the IDs of possible following questions. This can be used to document forward skip instructions.",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "variable.var_backward",
                                    "title": "Backward skip",
                                    "type": "string",
                                    "help_text": "Contains a reference to IDs of possible preceding questions. This can be used to document backward skip instructions.",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "variable.var_qstn_ivuinstr",
                                    "title": "Interviewer instructions",
                                    "type": "string",
                                    "help_text": "Specific instructions to the individual conducting an interview. The content will typically be entered by copy/pasting instructions in the interviewer’s manual (or in the CAPI application). In cases where the same instructions relate to multiple variables, repeat the same information in the metadata for all these variables.",
                                    "enum": [],
                                    "display_type": "textarea"
                                }
                            ],
                            "help_text": ""
                        },
                        {
                            "key": "variable1674858021022",
                            "title": "Imputation and derivation",
                            "type": "section",
                            "items": [
                                {
                                    "key": "variable.var_codinstr",
                                    "title": "Coder instructions",
                                    "type": "string",
                                    "help_text": "The coder instructions for the variable. These are any special instructions to those who converted information from one form to another (e.g., textual to numeric) for a particular variable.",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "variable.var_imputation",
                                    "title": "Imputation",
                                    "type": "string",
                                    "help_text": "Imputation is the process of estimating values for variables when a value is missing. The element is used to describe the procedure used to impute values when missing.",
                                    "enum": [],
                                    "display_type": "textarea"
                                },
                                {
                                    "key": "variable.var_derivation",
                                    "title": "Derivation",
                                    "type": "string",
                                    "help_text": "Used only in the case of a derived variable, this element provides both a description of how the derivation was performed and the command used to generate the derived variable, as well as a specification of the other variables in the study used to generate the derivation. The Derivation element is used to provide a brief description of this process. As full transparency in derivation processes is critical to build trust and ensure replicability or reproducibility, the information captured in this element will often not be sufficient. A reference to a document and/or computer program can in such case be provided in this element, and the document/scripts provided as external resources. ",
                                    "enum": [],
                                    "display_type": "textarea"
                                }
                            ],
                            "help_text": ""
                        },
                        {
                            "key": "variable.format",
                            "title": "Technical format",
                            "type": "section",
                            "help_text": "",
                            "items": [
                                {
                                    "key": "variable.var_format.type",
                                    "title": "Type",
                                    "type": "string",
                                    "help_text": "Indicates if the variable is numeric, fixed string, dynamic string, or date. Numeric variables are used to store any number, integer or floating point (decimals). A fixed string variable has a predefined length which enables the publisher to handle this data type more efficiently. Dynamic string variables can be used to store open-ended questions.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "variable.var_format.name",
                                    "title": "Name",
                                    "type": "string",
                                    "help_text": "The name of the particular, proprietary format used.",
                                    "display_type": "text"
                                },
                                {
                                    "key": "variable.var_format.note",
                                    "title": "Note",
                                    "type": "string",
                                    "help_text": "Additional information on the variable format.",
                                    "display_type": "textarea"
                                }
                            ]
                        },
                        {
                            "key": "variable1674857761764",
                            "title": "Position in fixed format file",
                            "type": "section",
                            "items": [
                                {
                                    "key": "variable.loc_start_pos",
                                    "title": "Start position",
                                    "type": "integer",
                                    "help_text": "The starting position of the variable when the data are saved in an ASCII fixed-format data file.",
                                    "enum": [],
                                    "display_type": "text",
                                    "rules": {
                                        "numeric": true
                                    }
                                },
                                {
                                    "key": "variable.loc_end_pos",
                                    "title": "End position",
                                    "type": "integer",
                                    "help_text": "The end position of the variable when the data are saved in an ASCII fixed-format data file.",
                                    "enum": [],
                                    "rules": {
                                        "numeric": true
                                    },
                                    "display_type": "text"
                                },
                                {
                                    "key": "variable.loc_width",
                                    "title": "Width",
                                    "type": "integer",
                                    "help_text": "The length of the variable (the maximum number of characters used for its values) in an ASCII fixed-format data file.",
                                    "enum": [],
                                    "rules": {
                                        "numeric": true
                                    },
                                    "display_type": "text"
                                },
                                {
                                    "key": "variable.loc_rec_seg_no",
                                    "title": "Record segment number",
                                    "type": "string",
                                    "help_text": "Record segment number, deck or card number the variable is located on.",
                                    "enum": [],
                                    "display_type": "text",
                                    "rules": {
                                        "numeric": true
                                    }
                                }
                            ],
                            "help_text": ""
                        }
                    ]
                }
            ]
        },
        {
            "type": "section_container",
            "key": "variable_groups_container",
            "title": "Variable groups",
            "is_custom": true,
            "items": [
                {
                    "type": "section",
                    "key": "variable_groups",
                    "title": "Variable groups",
                    "items": [
                        {
                            "type": "string",
                            "key": "variable_groups.vgid",
                            "title": "Group ID",
                            "is_required": false,
                            "help_text": "In a dataset, variables are grouped by data file. For the convenience of users, the DDI allows data curators to organize the variables into different, \"virtual\" groups to organize variables by theme, type of respondent, or any other criteria. Grouping variables is optional, and will not impact the way variables are stored in the data files. One variable can belong to more than a group, and a group of variables can contain variables from more than one data file. The variable groups do not necessarily have to cover all variables in the data files. Variable groups can also contain other variable groups. Group ID is a unique identifier (unique within the DDI metadata file) for the variable group.",
                            "display_type": "text"
                        },
                        {
                            "type": "string",
                            "key": "variable_groups.variables",
                            "title": "Variables",
                            "help_text": "The list of variables (\"Variable ID\") in the group. Enter a list with items separated by a space, e.g. \"V21 V22 V30\".",
                            "display_type": "textarea"
                        },
                        {
                            "type": "string",
                            "key": "variable_groups.variable_groups",
                            "title": "Variable groups",
                            "help_text": "The variable groups (\"Group ID\") that are embedded in this variable group. Enter a list with items separated by a space, e.g. \"VG2 VG5\".",
                            "display_type": "textarea"
                        },
                        {
                            "type": "string",
                            "key": "variable_groups.group_type",
                            "title": "Group type",
                            "enum": [
                                {
                                    "code": "subject",
                                    "label": "Subject"
                                },
                                {
                                    "code": "section",
                                    "label": "Section"
                                },
                                {
                                    "code": "multiResp",
                                    "label": "Multi response"
                                },
                                {
                                    "code": "grid",
                                    "label": "Grid"
                                },
                                {
                                    "code": "display",
                                    "label": "Display"
                                },
                                {
                                    "code": "repetition",
                                    "label": "Repetition"
                                },
                                {
                                    "code": "version",
                                    "label": "Version"
                                },
                                {
                                    "code": "iteration",
                                    "label": "Iteration"
                                },
                                {
                                    "code": "analysis",
                                    "label": "Analysis"
                                },
                                {
                                    "code": "pragmatic",
                                    "label": "Pragmatic"
                                },
                                {
                                    "code": "record",
                                    "label": "Record"
                                },
                                {
                                    "code": "file",
                                    "label": "File"
                                },
                                {
                                    "code": "randomized",
                                    "label": "Randomized"
                                },
                                {
                                    "code": "other",
                                    "label": "Other"
                                }
                            ],
                            "help_text": "The type of grouping of the variables. A controlled vocabulary should be used. The DDI proposes the following vocabulary: \"section\", \"multipleResp\", \"grid\", \"display\", \"repetition\", \"subject\", \"version\", \"iteration\", \"analysis\", \"pragmatic\", \"record\", \"file\", \"randomized\", \"other\". A description of the groups can be found in a document available at https://zenodo.org/record/3823051/files/maddiewshop.pdf, by W. Thomas, W. Block, R. Wozniak and J. Buysse.",
                            "display_type": "dropdown-custom"
                        },
                        {
                            "type": "string",
                            "key": "variable_groups.label",
                            "title": "Label",
                            "help_text": "A short description of the variable group.",
                            "display_type": "text"
                        },
                        {
                            "type": "string",
                            "key": "variable_groups.txt",
                            "title": "Description",
                            "help_text": "A more detailed description of variable group than the one provided in \"Label\".",
                            "display_type": "textarea"
                        },
                        {
                            "type": "string",
                            "key": "variable_groups.universe",
                            "title": "Universe",
                            "help_text": "The universe can be a population of individuals, households, facilities, organizations, or others, which can be defined by any type of criteria (e.g., \"adult males\", \"private schools\", \"small and medium-size enterprises\", etc.)",
                            "display_type": "textarea"
                        },
                        {
                            "type": "string",
                            "key": "variable_groups.notes",
                            "title": "Notes",
                            "help_text": "Used to provide additional information about the variable group.",
                            "display_type": "textarea"
                        },
                        {
                            "type": "string",
                            "key": "variable_groups.definition",
                            "title": "Rationale",
                            "help_text": "A brief rationale for the variable grouping.",
                            "display_type": "textarea"
                        }
                    ]
                }
            ]
        },
        {
            "type": "section_container",
            "id": "tags",
            "key": "tags_container",
            "title": "Tags",
            "items": [
                {
                    "key": "tags",
                    "title": "Tags",
                    "type": "array",
                    "props": [
                        {
                            "key": "tag",
                            "title": "Tag",
                            "type": "string",
                            "prop_key": "tags.tag",
                            "help_text": "A user-defined tag.",
                            "display_type": "text"
                        },
                        {
                            "key": "tag_group",
                            "title": "Tag group",
                            "type": "string",
                            "prop_key": "tags.tag_group",
                            "help_text": "A user-defined group (optional) to which the tag belongs. Grouping tags allows implementation of controlled facets in data catalogs.",
                            "display_type": "text"
                        }
                    ],
                    "help_text": "Tags, especially when organized in tag groups, provide a powerful and flexible solution to enable custom facets (filters) in data catalogs. Note that tags and tag groups are not element from the DDI Codebook standard."
                }
            ]
        }
    ]
}