<?php 
$lang['data_enclave_access_request']="Запрос на доступ к Национальному Анклаву данных";
$lang['data_enclave_description']="<p>Национальный Анклав Данных (НАД) был учрежден Национальным Архивом Данных (НАД)с целью предоставления исследователям с соответствующей квалификацией доступа к конфиденциальным статистическим файлам с микроданными под строгим надзором. НАД предоставляет механизм, благодаря которому исследователи получают доступ к файлам с подробными данными в защищенной среде,  не нарушая конфиденциальности респондентов.</p>
 
 <h2>Местонахождение</h2>
 <p>НАД находится в [укажите местонахождение здесь]</p>
 
 <h2>Работа НАД</h2>
 <p>Исследователи получают доступ к данным на месте, где им предоставляют данные, компьютеры, программное обеспечение, рабочее помещение и надзор со стороны работников НАД.</p>";
$lang['data_enclave_application_form_link']="Нажмите здесь, чтобы скачать бланк заявки на доступ к анклаву данных.";


/* End of file data_enclave_lang.php */
/* Location: ./application/language/russian/data_enclave_lang.php */