<?php 
$lang['title_terms_and_conditions']="Условия";
$lang['terms_text']="<ol>
  <li>Данные и другие материалы, обеспечиваемые Общенациональным архивом данных (National Data Archive), не должны передаваться другим лицам, учреждениям или организациям без письменного разрешения Общенационального архива данных. </li>
  <li>Данные будут использованы исключительно для статистических и научных целей. Они будут использованы единственно для сообщения совокупных данных, а не для исследования отдельных лиц или организаций. </li>
  <li>Не допускаются попытки повторной идентификации респондентов, а также не допускается использование случайно раскрытой информации по лицам или учреждениям. О любом подобном раскрытии следует немедленно сообщать в Общенациональный архив данных.</li>
  <li>Не допускаются попытки разработки линков между группами данных, обеспечиваемых Общенациональным архивом данных, или между данными Общенационального архива данных и другими группами данных, которые могут привести к идентификации лиц или организаций.</li>
  <li> В книгах, статьях, материалах конференций, тезисах, диссертациях, сообщениях или других публикациях ссылки на источник данных должны осуществляться в соответствии с Требованиями к цитированию для каждой группы данных.</li>
  <li>Электронные копии всех сообщений и публикаций, основанных на данных, предоставленных по запросу, следует присылать в Общенациональный архив данных.</li>
  <li>Первоначальный сборщик данных, Общенациональный архив данных и соответственные организации по финансированию не несут ответственности за использование данных, интерпретации или выводы, основанные на использовании данных.</li>
</ol>
<p> Продолжая процесс получения данных, вы подтверждаете свое согласие соблюдать вышеупомянутые условия и соглашаетесь с тем, что использование статистических данных, полученных из Общенационального архива данных, соответствует общепринятым стандартам применения и правовым ограничениям, направленным на защиту конфиденциальности респондентов.</p>";
$lang['form_removed_and_not_available']="Форма была удалена и более недоступна.";
$lang['survey_data_files']="Файлы с Данными Опросов";


/* End of file direct_access_terms_lang.php */
/* Location: ./application/language/russian/direct_access_terms_lang.php */