<?php 
$lang['Line ministry/public administration']="Отраслевое министерство/государственная администрация";
$lang['University']="Университет";
$lang['Research centre']="Исследовательский центр";
$lang['Private company']="Частная компания";
$lang['International organization']="Международная организация";
$lang['Non-governmental agency (national)']="Негосударственная организация (национальная)";
$lang['Non-governmental agency (international)']="Негосударственная организация (международная)";
$lang['Other']="Другие";
$lang['application_access_licensed_dataset']="Заявка на Доступ к Лицензированному Набору Данных";
$lang['required_fields']="Поля, обозначенные <span class=&quot;style1&quot;>*</span> являются обязательными.";
$lang['info_kept_confidential']="Информация на этой странице является конфиденциальной и может быть использована исключительно для внутренних целей.";
$lang['dataset_requested']="Запрошенный набор данных:";
$lang['filled_lead_research']="Эту форму следует заполнить и передать ведущему сотруднику. Ведущий сотрудник – лицо, играющее основную роль в обеспечении всех связей по данному договору. Доступ к лицензированной группе данных может быть открыт только в том случае, если ведущий сотрудник является сотрудником официально зарегистрированной организации-получателя (университета, компании, исследовательского центра, международной организации и др.), от имени которой запрашивается доступ к данным. Ведущий сотрудник несет полную ответственность за выполнение сотрудниками организации-получателя всех условий данного Договора о доступе к даннымДанный запрос будет рассмотрен комитетом по предоставлению данных, который решает: одобрить запрос, запретить доступ к данным или запросить дополнительную информацию у ведущего сотрудника. В такой запрос может входить и подписанная копия данного бланка запроса. При получении разрешения данные и документация представляються на CD-ROM/DVD или через безопасный ftp сервер";
$lang['receiving_org']="Название организации-получателя:";
$lang['rec_org_refers']="Организация-получатель – это организация /университет/учреждение, где работает ведущий сотрудник";
$lang['org_type']="Тип Организации";
$lang['other']="Если другой, обозначить:";
$lang['post_add']="Почтовый адрес";
$lang['telephone']="Телефон (с кодом страны)";
$lang['fax']="Факс (с кодом страны)";
$lang['intended_use']="Предполагаемое использование данных:";
$lang['provide_short_desc']="Пожалуйста, дайте краткую характеристику вашего исследовательского проекта (тема проекта, цели, методы, ожидаемые результаты, партнеры)";
$lang['expected_output']="Перечень ожидаемых выходных документов и правила распространения";
$lang['expected_completion']="Предполагаемая дата завершения (День-Месяц-Год) исследовательского проекта:";
$lang['data_matching']="Сопоставление данных";
$lang['merge_dataset']="Понадобится ли вам слияние этого набора данных с другими данными?";
$lang['other_data_merge']="Если ДА, то определите все другие массивы данных,подлежащие слиянию";
$lang['research_team']="Члены исследовательской группы (кроме ведущего сотрудника)";
$lang['provide_names']="Обозначить фамилии, звания и связи всех других членов исследовательской группы, которые получат доступ к закрытым данным";
$lang['ident_needed']="Идентификация требуемых файлов данных и переменных";
$lang['da_website']="Архив Данных размещает подробные метаданные на своем сайте, в том числе и характеристику файлов данных и переменных для каждого набора данных. Исследователи, которым не нужен доступ ко всему массиву данных, могут указать, какая именно подгруппа переменных или материалов их интересует. Это может повысить вероятность получения данных, поскольку снижает риск раскрытия информации.";
$lang['this_request']="Данный запрос подается для доступа:";
$lang['whole_dataset']="Весь массив данных (все файлы, все материалы)";
$lang['subset_data']=" Подгруппа переменных и/или материалов, как указано ниже (заметьте, что такие переменные, как коэффициенты взвешивания выборки и идентификаторы записей, всегда включаются в подгруппы):";
$lang['data_access_agreement']="Договор о доступе к данным";
$lang['i_read_and_agree']="Я прочитал и согласен с данными условиями";
$lang['agreement_text']="<p>Представитель Организации-получателя согласен соблюдать такие условия:</p>
<ul>
  <li>Доступ к закрытым данным для ведущего сотрудника и других членов исследовательской группы, перечисленных в данном запросе, будет ограничен. </li>
  <li>Копии закрытых данных или любых других данных, полученных на основе первоначальных данных, не будут копироваться и не будут доступными для какого-либо лица, не упомянутого в данном Договоре о доступе, за исключением тех случав, когда получено официальное разрешение Архива Данных.</li>
  <li>Обработка данных будет проводиться исключительно в заявленных статистических и исследовательских целях. Данные будут использованы исключительно для изучения совокупной информации, а не изучения отдельных лиц или организаций. Данные никоим образом не будут использованы в административных,  вещественно-правовых или правопринудительных  целях.</li>
  <li>В случае, если ведущий сотрудник намерен сравнивать закрытые данные с любым другим набором микроданных, он должен сообщить об этом. При любом сопоставлении следует подробно сообщить о наборах данных для сопоставления и причины сопоставления. Любые массивы данных, полученные в результате сопоставления будут рассматриваться как закрытые и должны быть согласованы с данным Договором о доступе к данным. </li>
  <li>Ведущий сотрудник гарантирует отсутствие попыток идентификации любых лиц, семей, бизнеса, предприятий или организаций. При случайном раскрытии идентификация любых лиц или учреждений не будет использована, а все подробности будут сообщены в Архив данных. Идентификация не должна касаться любых других лиц, не включенных в данный Договор о доступе к данным.</li>
  <li>Ведущий сотрудник будет осуществлять меры безопасности для предотвращения несанкционированного доступа к лицензионным микроданным, полученным из Архива данных. После завершения исследования микроданные должны быть уничтожены, за исключением случав, когда Архив данных получает достаточные гарантии того, что данные будут находиться в безопасности, и дает письменное разрешение организации-получателю на хранение таких данных. Уничтожение микроданных должно сопровождаться письменным подтверждением ведущего сотрудника, переданным в Архив данных.</li>
  <li>В книгах, статьях, материалах конференций, тезисах, диссертациях, сообщениях или других публикациях ссылки на источник данных должны осуществляться в соответствии с Требованиями к цитированию при каждой группе данных.</li>
  <li>Электронные копии всех сообщений и публикаций, основанных на данных, предоставленных по запросу, следует присылать в Общенациональный архив данных.</li>
  <li>Первоначальный сборщик данных, Общенациональный Архив Данных и соответствующие организации по финансированию не несут ответственности за использование данных, интерпретации или выводы, основанные на использовании данных.  </li>
  <li>Данный договор вступает в силу с момента получения разрешения на доступ к закрытым данным и остается в силе до даты завершения проекта или более ранней даты, если проект завершен досрочно.</li>
  <li> При любых изменения в проектном задании, организации безопасности, штате или организации, перечисленных в этой заявке, ведущий сотрудник обязан запросить разрешение Архива данных на такие изменения. При изменениях в организации-работодателе ведущего сотрудника следует составить новую заявку, а первоначальный проект будет прекращен. </li>
  <li> Нарушение договора влечет серьезные последствия, и Архив данных будет принимать меры по отношению к ответственным за преднамеренное или случайное нарушение. Невыполнение инструкций Архива данных будет рассматриваться как наибольшее нарушение данного договора и может стать основанием для судебного разбирательства. Архив данных, совместно с партнерскими архивами данных, ведет журнал лиц и организаций, ответственных за нарушение условий Договора о доступе к данным, и будет применять санкции по ограничению доступа этих сторон к данным. </li>
</ul>";
$lang['success_request_submitted']="Вы успешно отправили запрос для доступа к данным. Письмо с подтверждением было отправлено на Ваш адрес электронной почты.";
$lang['track_status_request']="Чтобы отслеживать статус Вашего запроса на сайте, зайдите на";
$lang['thank_you']="Спасибо!";
$lang['confirmation_application_for_licensed_dataset']="[подтверждение] Заявка на доступ к лицензированному набору данных";
$lang['view_all_requests']="Просмотреть все запросы ";
$lang['open_in_new_window']="Открыть в новом окне ";


/* End of file licensed_access_form_lang.php */
/* Location: ./application/language/russian/licensed_access_form_lang.php */