<?php
/*
* Public Access Request Form
*
*/
$lang['application_for_access_to_public_use_dataset'] = "Заявка на доступ к группе данных общего пользования";
$lang['fields_marked_mandatory'] = "Поля, обозначенные * , являются обязательными";
$lang['msg_information_confidential'] = "Информация на данной странице является конфиденциальной и используется исключительно для внутренних целей";
$lang['first_name'] = "Имя";
$lang['last_name'] = "Фамилия";
$lang['organization'] = "Организация";
$lang['email'] = "E-mail";
$lang['dataset_requested'] = "Запрашиваемый массив данных";
$lang['intended_use_of_data'] = "Предполагаемое использование данных";
$lang['describe_your_project'] = "Пожалуйста, дайте краткую характеристику вашего исследовательского проекта (тема проекта, цели, методы, ожидаемые результаты, партнеры)";
$lang['i_agree'] = "Согласен/Согласна";
$lang['terms_and_conditions'] = "Условия";
$lang['terms_text'] = "
<ol>
  <li> Данные и другие материалы, обеспечиваемые Общенациональным архивом данных, не должны передаваться другим лицам, учреждениям или организациям без письменного разрешения Общенационального архива данных. </li>
  <li>Данные будут использованы исключительно для статистических и научных целей. Они будут использованы единственно для сообщения совокупных данных, а не для исследования отдельных лиц или организаций. </li>
  <li>Не допускаются попытки повторной идентификации респондентов, а также не допускается использование случайно раскрытой информации по лицам или учреждениям. О любом подобном раскрытии следует немедленно сообщать в Общенациональный архив данных.</li>
  <li>Не допускаются попытки разработки линков между группами данных, обеспечиваемых Общенациональным архивом данных, или между данными Общенационального архива данных и другими группами данных, которые могут привести к идентификации лиц или организаций.</li>
  <li> В книгах, статьях, материалах конференций, тезисах, диссертациях, сообщениях или других публикациях ссылки на источник данных должны осуществляться в соответствии с Требованиями к цитированию по каждой группе данных.</li>
  <li>Электронные копии всех сообщений и публикаций, основанных на даннях, предоставленных по запросу, следует присылать в Общенациональный архив данных.</li>
  <li>Первоначальный сборщик данных, Общенациональный архив данных и соответственные организации по финансированию не несут ответственности за использование данных, интерпретации или выводы, основанные на использовании данных.</li>
</ol>
<p> Продолжая процесс получения данных, вы подтверждаете свое согласие соблюдать вышеупомянутые условия и соглашаетесь с тем, что использование статистических данных, полученных из Общенационального архива данных, соответствует общепринятым стандартам применения и правовым ограничениям, направленным на защиту конфиденциальности респондентов</p>";

$lang['public_use_files'] = "Файлы общего пользования";

/* End of file public_access_terms_lang.php */
/* Location: ./system/language/russian/public_access_terms_lang.php */